[
  {
    "id": 1,
    "text": "TVET Egypt operates in Culture. (Technical and Vocational Education and Training) is a national reform initiative co-funded by the Egyptian government and the European Union. It aims to enhance the employability of youth, improve the quality of technical education, and bridge the gap between labor market needs and vocational training. TVET Egypt operates across all 27 governorates, supporting human capital development and entrepreneurship.",
    "logo_image": "TVET-Egypt-Logo.png"
  },
  {
    "id": 2,
    "text": "Ashoka Arab World operates in Culture. has been a pioneer of social entrepreneurship in Egypt and the region since 2003. It identifies and supports visionary changemakers who tackle systemic social challenges through innovative, scalable solutions. Ashoka’s Fellows lead transformative initiatives in health, education, environment, and civic engagement.",
    "logo_image": "Ashoka-Arab-World-Logo.png"
  },
  {
    "id": 3,
    "text": "Endeavor Egypt operates in Culture. is part of the global Endeavor network, launched in 2008 to support high-impact entrepreneurs who scale businesses, create jobs, and inspire others. It focuses on founders with the potential to transform industries and drive economic growth.",
    "logo_image": "Endeavor-Egypt-Logo.png"
  },
  {
    "id": 4,
    "text": "International Labor Organization operates in Culture. The ILO has supported Egypt since 1936 in promoting decent work, labor rights, and inclusive entrepreneurship. Through its Cairo office, the ILO runs targeted programs to empower youth, refugees, and vulnerable communities by enhancing employability and supporting enterprise development.",
    "logo_image": "ILO-Logo.png"
  },
  {
    "id": 5,
    "text": "International Council for Small Business operates in Culture. ICSB Egypt is part of the global ICSB network, promoting entrepreneurship, SME development, and inclusive innovation. Egypt plays a strategic role in ICSB’s regional efforts, hosting flagship events and engaging with local universities, policymakers, and entrepreneurs.",
    "logo_image": "ICSB-Logo.png"
  },
  {
    "id": 6,
    "text": "Forsa - Ministry of Social Solidarity operates in Culture. Forsa is Egypt’s national economic empowerment initiative targeting vulnerable groups. It helps beneficiaries of the Takaful and Karama programs transition to self-reliance through employment and entrepreneurship.",
    "logo_image": "Forsa-Logo.png"
  },
  {
    "id": 7,
    "text": "Egypt Entrepreneurship and Innovation Center operates in Culture. Established in 2023 under the National Institute for Governance and Sustainable Development, EEIC is Egypt’s central hub for entrepreneurship and innovation. It aims to integrate local startups into global value chains and promote sustainable innovation.",
    "logo_image": "EEIC-Logo.png"
  },
  {
    "id": 8,
    "text": "Technology Innovation and Entrepreneurship Center operates in Culture. TIEC, launched in 2010 under Egypt’s Ministry of Communications and Information Technology, is a national hub for innovation and entrepreneurship in ICT. It empowers startups through incubation, funding, and ecosystem development.",
    "logo_image": "TIEC-Logo.png"
  },
  {
    "id": 9,
    "text": "Egyptian Banking Institute (EBI) operates in Culture. Established in 1991 as the official training arm of the Central Bank of Egypt, EBI is dedicated to developing human capital in the banking and financial sectors. It also plays a growing role in entrepreneurship education, financial literacy, and SME support across Egypt and Africa.",
    "logo_image": "EBI-Logo.png"
  },
  {
    "id": 10,
    "text": "AASTMT operates in Culture. is a regional university affiliated with the League of Arab States, with campuses across Egypt including Smart Village. Beyond its academic programs, AASTMT plays a strategic role in entrepreneurship, innovation, and SME development through its dedicated Entrepreneurship Center.",
    "logo_image": "AASTMT-Logo.png"
  },
  {
    "id": 11,
    "text": "Innovators Support Fund (ISF) operates in Culture. Established under Law No. 1 of 2019, ISF operates under Egypt’s Ministry of Higher Education and Scientific Research. It aims to discover, train, and fund gifted individuals, researchers, and entrepreneurs across all disciplines—from school students to university graduates and professionals.",
    "logo_image": "ISF-Logo.png"
  },
  {
    "id": 12,
    "text": "Micro, Small and Medium Enterprise Development Agency (MSMEDA) operates in Culture. MSMEDA is Egypt’s national authority for MSME development, established by Prime Ministerial Decree No. 947 of 2017. It evolved from the Social Fund for Development (1991) and now serves as a central policy integrator, funder, and ecosystem builder for entrepreneurship and inclusive growth.",
    "logo_image": "MSMEDA-Logo.png"
  },
  {
    "id": 13,
    "text": "Gemini Africa operates in Culture. Founded by Orascom Investment Holding, Gemini Africa is a one-stop entrepreneurial hub focused on empowering startups across Africa, with a strong emphasis on creative industries, social impact, and underserved regions. It bridges the gap between startups and investors through mentorship, funding, and strategic matchmaking.",
    "logo_image": "Gemini-Africa-Logo.png"
  },
  {
    "id": 14,
    "text": "Academy of Scientific Research and Technology (ASRT) operates in Culture. Established in 1971, ASRT is Egypt’s national think tank and innovation engine under the Ministry of Higher Education and Scientific Research. It drives science-based policy, funds applied research, and supports entrepreneurship through incubation, competitions, and regional development programs.",
    "logo_image": "ASRT-Logo.png"
  },
  {
    "id": 15,
    "text": "iSchool operates in Culture. Talent/ Innovation",
    "logo_image": "iSchool-Logo.png"
  },
  {
    "id": 16,
    "text": "icealex operates in Culture. ICEALEX, an innovation consultancy firm, is a leading platform for sector specific incubations, and acts as a community-driven technology innovation hub with a strong social and environmental commitment.The main approach for ice activities is to provide an enabling ecosystem for action-oriented minds co-creating sustainable solutions for local challenges and transforming them into sustainable businesses.",
    "logo_image": "icealex-Logo.png"
  },
  {
    "id": 17,
    "text": "CREATIVA operates in Culture. Creativa is a national initiative launched by MCIT with the aim of promoting the new technology support standard for youth in Egypt. The initiative bridges the gap between technology skills and on the ground requirements from the market. The Creativa hubs are available in Mansoura, Monufia , Menia , Sohag, Qena and Aswan, with each hub providing a unique offering for the local community based on demand. The initiative empowers youth by linking technology skills with",
    "logo_image": "CREATIVA-Logo.png"
  },
  {
    "id": 17,
    "text": "the required demand driver ranging from the future job market, freelancing/ remote job market and the entrepreneurial activities.",
    "logo_image": "CREATIVA-Logo.png"
  },
  {
    "id": 18,
    "text": "enactus operates in Culture. Enactus utilizes team-based experiential learning and competition to catalyze young people to take positive entrepreneurial action in their communities. Through their efforts, our students make a positive impact on people, the planet, and our shared prosperity – and contribute to achieving the Global Goals.",
    "logo_image": "enactus-Logo.png"
  },
  {
    "id": 19,
    "text": "IHub operates in Culture. To foster an enabling environment for innovation and entrepreneurship, and to advance research and development directed toward the needs of industry and businesses. Our mission is to contribute to industrial localization and technology transfer by promoting collaboration between universities and business sectors, and by providing the resources and knowledge necessary to transform ideas into innovative solutions and products that drive economic and social development,",
    "logo_image": "IHub-Logo.png"
  },
  {
    "id": 19,
    "text": "while helping to bridge the gap between imports and exports.",
    "logo_image": "IHub-Logo.png"
  },
  {
    "id": 20,
    "text": "Egypt Innovate operates in Culture. s is an electronic platform for innovation in Egypt, providing a source of inspiration, education, and communication for innovators and entrepreneurs. We will take you on a journey through educational and inspiring content, practical tools, and models, and you will enjoy the freedom to access networks of hubs and innovation spaces around the world.Egypt Innovates aims to shed light on Egyptian innovators locally and globally, create points of convergence among",
    "logo_image": "Egypt-Innovate-Logo.png"
  },
  {
    "id": 20,
    "text": "them, and build collaborative communities among representatives of the Egyptian innovation and entrepreneurship environment. Additionally, the platform aims to educate innovators and startups about technology and innovation management.SME Support: financial service, feasibility studies, Debt advisory, Bookkeeping & tax services, and CFO outsourcing",
    "logo_image": "Egypt-Innovate-Logo.png"
  },
  {
    "id": 21,
    "text": "Delta Square operates in Culture. is a company based in Egypt that focuses on innovation and technology. It operates as an \"Innovation Enablement Platform\" with a mission to bridge the gap between people and new technologies. The company achieves this through various programs, competitions, and capacity-building initiatives.SME Support: financial service, feasibility studies, Debt advisory, Bookkeeping & tax services, and CFO outsourcing",
    "logo_image": "Delta-Square-Logo.png"
  },
  {
    "id": 22,
    "text": "IEEE Young Professionals Egypt operates in Culture. IEEE Young Professionals (YP) Egypt is the national affinity group of IEEE for students and early-career engineers. It delivers large-scale programs such as Egyptian Engineering Day (EED), Made in Egypt (MIE), NASA Space Apps Cairo, Future City, and structured mentoring through Mentoring Meet cohorts. The group earned IEEE Region 8 recognition for outstanding activities in collaboration with universities and industry.",
    "logo_image": "IEEE-YP-Egypt-Logo.png"
  },
  {
    "id": 23,
    "text": "BznsBuilder operates in Culture. is an AI‑powered platform for business planning, financial forecasting, and investor‑ready documentation. It helps founders model revenue and costs, run scenarios, and generate visual dashboards. The software is used by startups, SMEs, universities and accelerators to standardize plans and improve funding readiness.",
    "logo_image": "BznsBuilder-Logo.png"
  },
  {
    "id": 24,
    "text": "CEO Business School (C.E.O.) operates in Culture. CEO Business School is an Egyptian training and higher-education provider offering MBA/DBA programs and executive diplomas. It specializes in administration, finance, HR, and operations tracks, serving managers and founders seeking practical skills.",
    "logo_image": "CEO-Business-School-Logo.png"
  },
  {
    "id": 25,
    "text": "Portolearn operates in Culture. provides live and online training in business, analytics, IT, and project management. Its public programming features domain experts and case-based content, with active learner communities hosted on Facebook.",
    "logo_image": "Portolearn-Logo.png"
  },
  {
    "id": 26,
    "text": "Octopus – Scientific Awareness Initiative operates in Culture. Octopus is a youth-led scientific awareness initiative in Egypt focused on aquaculture, environmental stewardship, and blue-economy literacy. It delivers Arabic-language outreach, events, and content to improve access to scientific knowledge.",
    "logo_image": "Octopus-Logo.png"
  },
  {
    "id": 27,
    "text": "AUEC – Aswan University Entrepreneurship Club operates in Culture. The club trains students in business development abilities through its scheduled events. It provides educational sessions and competitions that enable students to create new business concepts and make industry-professional connections.it helps building a generation of entrepreneurs who can participate locally, regionally and internationally in developing their societies with thought, science and innovation.",
    "logo_image": "AUEC-Logo.png"
  },
  {
    "id": 28,
    "text": "MET – Misr Higher Institute for Engineering & Technology operates in Culture. MET Mansoura is a higher‑education institute offering engineering and technology programs. It supports applied learning through labs and public e‑learning resources.",
    "logo_image": "MET-Logo.png"
  },
  {
    "id": 29,
    "text": "Startup Grind Cairo operates in Culture. Local chapters of the global Startup Grind community. They host monthly events, founder fireside chats, and networking sessions that connect founders, mentors and investors.",
    "logo_image": "Startup-Grind-Cairo-Logo.png"
  },
  {
    "id": 30,
    "text": "Entreprenelle operates in Culture. is a mission-driven organization founded in 2015 that empowers women entrepreneurs across Egypt. It reports supporting 100,000+ women and generating EGP 100M+ in economic value through programs, mentorship and access to partners.",
    "logo_image": "Entreprenelle-Logo.png"
  },
  {
    "id": 31,
    "text": "AASTMT – Arab Academy for Science, Technology & Maritime Transport operates in Culture. AASTMT is a regional university under the Arab League with campuses across Egypt. It provides degree programs and professional training, and hosts entrepreneurship and innovation initiatives through its colleges and centers.",
    "logo_image": "AASTMT-Logo.png"
  },
  {
    "id": 32,
    "text": "Om Habibeh Foundation (OHF) – AKDN operates in Culture. OHF is a locally registered NGO in Aswan (est. 1991) and an implementing agency for Aga Khan Foundation Egypt. It delivers programs in livelihoods, education, health, and civil society, and has reached tens of thousands of beneficiaries in Aswan.",
    "logo_image": "OHF-AKDN-Logo.png"
  },
  {
    "id": 33,
    "text": "Fekretak Sherketak (GAFI Entrepreneurship Center) operates in Culture. Fekretak Sherketak is GAFI’s national entrepreneurship platform providing training, mentorship, and a one‑stop Investor Services Centre. In 2025, it launched a Fast Track to accelerate startup establishment and licensing procedures.",
    "logo_image": "Fekretak-Sherketak-Logo.png"
  },
  {
    "id": 34,
    "text": "NubiAvest operates in Culture. is a platform and micro‑business studio focused on creative industries, green economy and tourism, with strong roots in Upper Egypt. It runs a Micro Business Studio program and partners with ecosystem actors such as enpact and Startup Haus Cairo.",
    "logo_image": "NubiAvest-Logo.png"
  },
  {
    "id": 35,
    "text": "Fab Lab Egypt (San3a Tech) operates in Culture. Fab Lab Egypt is a makerspace and innovation lab offering access to digital fabrication tools (3D printing, CNC, laser cutting), prototyping services, and training. It supports startups, students, and corporates with lab access and custom innovation programs.",
    "logo_image": "Fab-Lab-Egypt-Logo.png"
  },
  {
    "id": 36,
    "text": "INJAZ Egypt operates in Culture. (est. 2003) delivers experiential learning in entrepreneurship, work readiness, and financial literacy through school and university programs and a large corporate volunteer network. Impact reports cite hundreds of thousands of students served.",
    "logo_image": "INJAZ-Egypt-Logo.png"
  },
  {
    "id": 37,
    "text": "ASRT – Academy of Scientific Research & Technology operates in Culture. ASRT is Egypt’s national body for coordinating scientific research and innovation policy. It operates funding programs, IP services, and national initiatives such as the Children’s University.",
    "logo_image": "ASRT-Logo.png"
  },
  {
    "id": 38,
    "text": "Made in Egypt (MIE) – IEEE YP Competition operates in Culture. MIE is a national competition founded by IEEE Young Professionals Egypt that helps senior students turn graduation projects into startups by linking them with business mentorship and exposure.",
    "logo_image": "Made-in-Egypt-Logo.png"
  },
  {
    "id": 39,
    "text": "Enactus Egypt operates in Culture. supports student teams that build social enterprise projects. It runs the annual national competition and connects teams to the global Enactus network.",
    "logo_image": "Enactus-Egypt-Logo.png"
  },
  {
    "id": 40,
    "text": "Eitesal operates in Culture. EiTESAL for Information & Communication Technology is Egypt’s foremost private non-profit organization that has been actively and powerfully supporting the ICT industry in Egypt since 2004. It has played a significant and vital role in building and developing the ICT sector in the last 20 years.",
    "logo_image": "Eitesal-Logo.png"
  },
  {
    "id": 41,
    "text": "EPEA - Egyptian Private Equity Association operates in Culture. EPEA is a nonprofit association committed to supporting and developing the Private Equity and Venture Capital industry in Egypt and the surrounding region.",
    "logo_image": "EPEA-Logo.png"
  },
  {
    "id": 42,
    "text": "AWTAD operates in Culture. The Association for Women’s Total Advancement and Development (AWTAD) is an NGO dedicated to the professional and personal development of Egyptian women and youth as a means to empower them on both the social and economic level.",
    "logo_image": "AWTAD-Logo.png"
  },
  {
    "id": 43,
    "text": "GESR operates in Culture. is a program affiliated to Misr El-Kheir Foundation launched in 2013, showcasing its responsibility to contribute to a knowledge-based economy, through supporting innovators and technology startups solving social challenges in the fields of Water, Energy, Food, Health, Education, AI and IOT.",
    "logo_image": "GESR-Logo.png"
  },
  {
    "id": 44,
    "text": "ACSR operates in Culture. The Arab Council for Social Responsibility “ACSR” : is a member in the UN Global Compact and the first council in Egypt that aims to be the platform for community development in the Arab region for both sharing experiences and helping in the developmental process. The council have a wide number of partners nationally, regionally and internationally.",
    "logo_image": "ACSR-Logo.png"
  },
  {
    "id": 45,
    "text": "Enactus operates in Culture. is the world’s largest experiential learning platform dedicated to creating a better world while developing the next generation of entrepreneurial leaders and social innovators. The Enactus network of global business, academic and student leaders are unified by our vision - to create a better, more sustainable world.",
    "logo_image": "Enactus-Logo.png"
  },
  {
    "id": 46,
    "text": "DTA operates in Culture. is a non-profit organization that works as a hub for IT business people committed to develop a solid base of Entrepreneurship and Innovation culture to serve developing an IT Industry in Nile Delta Of Egypt.",
    "logo_image": "DTA-Logo.png"
  },
  {
    "id": 47,
    "text": "Giza Systems operates in Culture. , a digital transformation enabler and a leading systems integrator in the MEA region designs and deploys industry-specific technology solutions for asset-intensive industries such as the Telecoms, Utilities, Oil & Gas, Urban Communities, Smart Mobility and other market sectors. Giza Systems is part of the solutions by stc group of companies.",
    "logo_image": "Giza-Systems-Logo.png"
  },
  {
    "id": 48,
    "text": "EDEA operates in Culture. Economic Development & Entrepreneurship Association (EDEA) is a nongovernmental organization. EDEA members are business people, society, entrepreneurs and MSMEs owners. Enabling MSMEs to enhance economic and social development in Egypt.",
    "logo_image": "EDEA-Logo.png"
  },
  {
    "id": 49,
    "text": "YLF operates in Culture. Youth Leaders Foundation (YLF) is a non-profit organization with a registered number 809 for 2017 providing targeted services to find hidden calibres to support and strengthen Egypt’s youth segment.",
    "logo_image": "YLF-Logo.png"
  },
  {
    "id": 50,
    "text": "MALAIKAH operates in Culture. Malaikah-EGYBAN acts as the voice of the angel investment community, we represent the views and interests of the angel investment community to business leaders, government officials so as to link relevant and interested key players together.",
    "logo_image": "MALAIKAH-Logo.png"
  },
  {
    "id": 51,
    "text": "ETISAL ASSIUT operates in Culture. Etisal is the first non-governmental organization in Asyut (Upper Egypt). It serves and supports youth and entrepreneurs all over Upper Egypt in the Information and Communications Technology (ICT) sector to develop their startups and grow their revenues. Also, Etisal has implemented several projects that promote women's empowerment.",
    "logo_image": "ETISAL-ASSIUT-Logo.png"
  },
  {
    "id": 52,
    "text": "ABWA operates in Culture. The Assiut Business Women Association (ABWA) is a non-profit organization based in Assiut, Egypt, dedicated to local development and empowering women in business. Established in 2000 and registered under number 524, ABWA has aligned its operations with the provisions of Law No. 84 of 2002 governing civil associations.",
    "logo_image": "ABWA-Logo.png"
  },
  {
    "id": 53,
    "text": "OM HABIBEH Foundation operates in Culture. is a nonprofit organization whose goal is to empower Aswan’s young men and women for a better future. The Om Habibeh Foundation (OHF) is an Egyptian non-profit organization established in 1991 under the supervision of the Ministry of Social Solidarity.",
    "logo_image": "OM-HABIBEH-Foundation-Logo.png"
  },
  {
    "id": 54,
    "text": "EJB operates in Culture. The Egyptian Junior Business Association (EJB) is a nongovernmental, not-for-profit organization established in 1999. EJB is represented with a membership network of over 5000 successful, business leaders, representing various business sectors, allowing in excess of 300,000 job opportunities.",
    "logo_image": "EJB-Logo.png"
  },
  {
    "id": 55,
    "text": "Ceeba operates in Culture. CEEBA, the Confederation of Egyptian-European Business Associations was established to create one powerful national pan European network to advocate on behalf of Egyptian Business for market access to the EU and to promote EU-Egyptian Trade and Investment.",
    "logo_image": "Ceeba-Logo.png"
  },
  {
    "id": 56,
    "text": "ADEF operates in Culture. is a non-profit foundation registered in 2009 at the Egyptian Ministry of Social Solidary License number 7734-2009 which aims to enable teens and youth through fostering environments for education and learning, supporting free culture, developing capacity, and building knowledge tools in Arabic language.",
    "logo_image": "ADEF-Logo.png"
  },
  {
    "id": 57,
    "text": "LEAD operates in Culture. Leaders Egyptian Association for Development is a non-profitable NGO, It works under the title of public benefit, and it has been operating mainly on a national level in order to help individuals and institutions achieve their desired goals through capacities-building and empowerment programs.",
    "logo_image": "LEAD-Logo.png"
  },
  {
    "id": 58,
    "text": "ETIJAH operates in Culture. Youth and Development Consultancy Institute (Etijah) is specialized in youth empowerment. It provides young individuals with the necessary skills and works on building the capacity of not only youth, but also governmental and non-governmental youth serving organizations.",
    "logo_image": "ETIJAH-Logo.png"
  },
  {
    "id": 59,
    "text": "INJAS operates in Culture. INJAZ Egypt delivers experiential learning in financial literacy, work readiness, entrepreneurship, and, STEM and Ai, effectively enriching the ability of young people to both engage in their own economic development and contribute to the strength of their communities and economies.",
    "logo_image": "INJAS-Logo.png"
  },
  {
    "id": 60,
    "text": "The Egyptian Hands Association for the Development operates in Culture. of Crafts, Handicrafts, and the Environment in Fayoum is an association working in economic empowerment by focusing on the development of crafts, handicrafts, and the environment.",
    "logo_image": "Egyptian-Hands-Association-Logo.png"
  },
  {
    "id": 61,
    "text": "World Food Programme (WFP Egypt) operates in Culture. WFP is the UN’s food assistance arm, active in Egypt since 1968. While traditionally focused on nutrition and humanitarian aid, WFP has expanded into entrepreneurship, youth empowerment, and climate-smart innovation, aligning with Egypt Vision 2030 and the Haya Kareema initiative.",
    "logo_image": "WFP-Egypt-Logo.png"
  },
  {
    "id": 62,
    "text": "Japan International Cooperation Agency (JICA Egypt) operates in Culture. JICA is Japan’s official development agency, operating in Egypt since 1977. It supports inclusive growth, human capital development, and entrepreneurship through technical cooperation, grant aid, and public-private partnerships. JICA’s work in Egypt spans education, industrial development, and startup support—especially through innovation competitions and university partnerships.",
    "logo_image": "JICA-Egypt-Logo.png"
  },
  {
    "id": 63,
    "text": "Islamic Corporation for the Insurance of Investment and Export Credit (ICIEC) operates in Culture. ICIEC is a member of the Islamic Development Bank (IsDB) Group, headquartered in Jeddah, Saudi Arabia. It provides Sharia-compliant investment and export credit insurance to support trade and foreign direct investment in OIC member countries, including Egypt. ICIEC plays a strategic role in de-risking entrepreneurship, SME growth, and infrastructure development by enabling access to finance and",
    "logo_image": "ICIEC-Logo.png"
  },
  {
    "id": 63,
    "text": "cross-border trade.",
    "logo_image": "ICIEC-Logo.png"
  },
  {
    "id": 64,
    "text": "European Bank for Reconstruction and Development (EBRD) – Egypt operates in Culture. EBRD is a multilateral development bank focused on private sector development and transition economies. Egypt became a country of operation in 2012, and since then, EBRD has invested over €10.3 billion in 160+ projects. Its work in Egypt emphasizes entrepreneurship, youth employment, financial inclusion, and green innovation.",
    "logo_image": "EBRD-Egypt-Logo.png"
  },
  {
    "id": 65,
    "text": "European Investment Bank (EIB) – Egypt operates in Culture. The EIB is the European Union’s development bank and a key financier of Egypt’s infrastructure, entrepreneurship, and green economy transition. Through its arm EIB Global, the bank supports inclusive growth, SME development, and innovation ecosystems. Egypt has been a partner since 1979, with over €13.7 billion invested across 118 projects.",
    "logo_image": "EIB-Egypt-Logo.png"
  },
  {
    "id": 66,
    "text": "International Finance Corporation (IFC) – Egypt operates in Culture. IFC is the private sector arm of the World Bank Group, focused on promoting inclusive economic growth through investment and advisory services. In Egypt, IFC supports entrepreneurship, fintech innovation, and SME development, with a strong emphasis on youth employment, financial inclusion, and digital transformation.",
    "logo_image": "IFC-Egypt-Logo.png"
  },
  {
    "id": 67,
    "text": "GIZ Egypt – Deutsche Gesellschaft für Internationale Zusammenarbeit operates in Culture. GIZ is Germany’s official development agency, operating in Egypt on behalf of the Federal Ministry for Economic Cooperation and Development (BMZ). GIZ supports Egypt’s transition toward inclusive employment, entrepreneurship, and green economy transformation. Its programs focus on youth, women, SMEs, and public-private partnerships, with strong alignment to Egypt’s Vision 2030.",
    "logo_image": "GIZ-Egypt-Logo.png"
  },
  {
    "id": 68,
    "text": "Islamic Development Bank (IsDB) operates in Culture. IsDB is a multilateral development bank headquartered in Jeddah, Saudi Arabia, with Egypt as a founding member. Through its Regional Hub in Cairo, IsDB supports inclusive development, youth empowerment, entrepreneurship, and infrastructure across Egypt and neighboring countries. Its work aligns with the SDGs and Egypt’s Vision 2030, emphasizing human capital, innovation, and resilience.",
    "logo_image": "IsDB-Logo.png"
  },
  {
    "id": 69,
    "text": "Danish International Development Agency (DANIDA) operates in Culture. DANIDA is Denmark’s official development cooperation arm, operating under the Ministry of Foreign Affairs. In Egypt, DANIDA works through the Danish Embassy and the Danish-Arab Partnership Programme (DAPP), focusing on youth employment, entrepreneurship, human rights, and governance.",
    "logo_image": "DANIDA-Logo.png"
  },
  {
    "id": 70,
    "text": "Global Affairs Canada operates in Culture. Canada’s development cooperation with Egypt is managed through Global Affairs Canada. With a focus on inclusive economic growth, youth empowerment, and climate-smart job creation, Canada supports talent development through strategic partnerships in education, agribusiness, and technical training.",
    "logo_image": "Global-Affairs-Canada-Logo.png"
  },
  {
    "id": 71,
    "text": "United States Agency for International Development (USAID Egypt) operates in Culture. USAID has supported Egypt’s development for over four decades, focusing on education, economic growth, and entrepreneurship. Through initiatives like SEED, Business Egypt, and the Economic Governance Activity, USAID strengthens talent pipelines, incubators, and innovation hubs—especially for youth and women.",
    "logo_image": "USAID-Egypt-Logo.png"
  }
]