[
  {
    "id": 1,
    "fieldId": [
      "Culture"
    ],
    "name": "TVET Egypt",
    "description": "TVET Egypt (Technical and Vocational Education and Training) is a national reform initiative co-funded by the Egyptian government and the European Union. It aims to enhance the employability of youth, improve the quality of technical education, and bridge the gap between labor market needs and vocational training. TVET Egypt operates across all 27 governorates, supporting human capital development and entrepreneurship.",
    "websiteUrl": "https://tvetegypt.org",
    "email": "info@tvetegypt.org",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/TVET.png"
  },
  {
    "id": 2,
    "fieldId": [
      "Culture"
    ],
    "name": "Ashoka Arab World",
    "description": "Ashoka Arab World has been a pioneer of social entrepreneurship in Egypt and the region since 2003. It identifies and supports visionary changemakers who tackle systemic social challenges through innovative, scalable solutions. Ashoka’s Fellows lead transformative initiatives in health, education, environment, and civic engagement.",
    "websiteUrl": "https://www.ashoka.org/en-aaw/about/arab-world",
    "email": "arabworld@ashoka.org",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/Ashoka.png"
  },
  {
    "id": 3,
    "fieldId": [
      "Culture",
      "Accelerators"
    ],
    "name": "Endeavor Egypt",
    "description": "Endeavor Egypt is part of the global Endeavor network, launched in 2008 to support high-impact entrepreneurs who scale businesses, create jobs, and inspire others. It focuses on founders with the potential to transform industries and drive economic growth.",
    "websiteUrl": "https://endeavoreg.org",
    "email": "info@endeavoreg.org",
    "phone": null,
    "facebookUrl": null,
    "address": "Zamalek, Cairo, Cairo Governorate",
    "logoImageUrl": "images/Endeavor-Egypt.png"
  },
  {
    "id": 4,
    "fieldId": [
      "Culture"
    ],
    "name": "International Labor Organization",
    "description": "The ILO has supported Egypt since 1936 in promoting decent work, labor rights, and inclusive entrepreneurship. Through its Cairo office, the ILO runs targeted programs to empower youth, refugees, and vulnerable communities by enhancing employability and supporting enterprise development.",
    "websiteUrl": "https://www.ilo.org/regions-and-countries/africa/egypt",
    "email": "cairo@ilo.org",
    "phone": null,
    "facebookUrl": null,
    "address": "Zamalek, Cairo",
    "logoImageUrl": "images/ILO.png"
  },
  {
    "id": 5,
    "fieldId": [
      "Culture"
    ],
    "name": "International Council for Small Business",
    "description": "ICSB Egypt is part of the global ICSB network, promoting entrepreneurship, SME development, and inclusive innovation. Egypt plays a strategic role in ICSB’s regional efforts, hosting flagship events and engaging with local universities, policymakers, and entrepreneurs.",
    "websiteUrl": "https://icsb.org",
    "email": "info@icsbglobal.org",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt (via local partners such as AUC and RiseUp)",
    "logoImageUrl": "images/ICSB.png"
  },
  {
    "id": 6,
    "fieldId": [
      "Culture"
    ],
    "name": "Forsa - Ministry of Social Solidarity",
    "description": "Forsa is Egypt’s national economic empowerment initiative targeting vulnerable groups. It helps beneficiaries of the Takaful and Karama programs transition to self-reliance through employment and entrepreneurship.",
    "websiteUrl": "https://www.moss.gov.eg/Sites/MOSA/ar-eg/Pages/program-details.aspx?pid=11",
    "email": "info@moss.gov.eg",
    "phone": "+202 2260 0000",
    "facebookUrl": null,
    "address": "Nasr City, Cairo",
    "logoImageUrl": "images/Forsa.png"
  },
  {
    "id": 7,
    "fieldId": [
      "Culture"
    ],
    "name": "Egypt Entrepreneurship and Innovation Center",
    "description": "Established in 2023 under the National Institute for Governance and Sustainable Development, EEIC is Egypt’s central hub for entrepreneurship and innovation. It aims to integrate local startups into global value chains and promote sustainable innovation.",
    "websiteUrl": "https://www.eeic.gov.eg",
    "email": "info@eeic.gov.eg",
    "phone": "+202 2794 2040",
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/egypt ent.png"
  },
  {
    "id": 8,
    "fieldId": [
      "Culture",
      "Training"
    ],
    "name": "Technology Innovation and Entrepreneurship Center",
    "description": "TIEC, launched in 2010 under Egypt’s Ministry of Communications and Information Technology, is a national hub for innovation and entrepreneurship in ICT. It empowers startups through incubation, funding, and ecosystem development.",
    "websiteUrl": "https://tiec.gov.eg/English/Pages/default.aspx",
    "email": "info@tiec.gov.eg",
    "phone": "+202 3534 4400",
    "facebookUrl": null,
    "address": "Smart Village, Giza",
    "logoImageUrl": "images/tiec.png"
  },
  {
    "id": 9,
    "fieldId": [
      "Culture",
      "Training"
    ],
    "name": "Egyptian Banking Institute (EBI)",
    "description": "Established in 1991 as the official training arm of the Central Bank of Egypt, EBI is dedicated to developing human capital in the banking and financial sectors. It also plays a growing role in entrepreneurship education, financial literacy, and SME support across Egypt and Africa.",
    "websiteUrl": "http://www.ebi.gov.eg",
    "email": "info@ebi.gov.eg",
    "phone": null,
    "facebookUrl": null,
    "address": "Nasr City, Cairo, Nasr City, EG",
    "logoImageUrl": "images/Egyptian-Banking-Institute.png"
  },
  {
    "id": 10,
    "fieldId": [
      "Culture",
      "Training"
    ],
    "name": "AASTMT",
    "description": "AASTMT is a regional university affiliated with the League of Arab States, with campuses across Egypt including Smart Village. Beyond its academic programs, AASTMT plays a strategic role in entrepreneurship, innovation, and SME development through its dedicated Entrepreneurship Center.",
    "websiteUrl": "https://aast.edu/en/centers/Entrepreneurship/index.php",
    "email": "aastmt@aast.edu",
    "phone": null,
    "facebookUrl": null,
    "address": "Smart Village Campus, Cairo, Egypt",
    "logoImageUrl": "images/AASTMT.png"
  },
  {
    "id": 11,
    "fieldId": [
      "Culture",
      "IP/TTOS & KTOS"
    ],
    "name": "Innovators Support Fund (ISF)",
    "description": "Established under Law No. 1 of 2019, ISF operates under Egypt’s Ministry of Higher Education and Scientific Research. It aims to discover, train, and fund gifted individuals, researchers, and entrepreneurs across all disciplines—from school students to university graduates and professionals.",
    "websiteUrl": "https://isf.org.eg",
    "email": "info@isf.org.eg",
    "phone": "01015167094",
    "facebookUrl": null,
    "address": "101 Al Qasr El Einy street, 8th floor, Ministry of Higher Education and Scientific Research.",
    "logoImageUrl": "images/ISF - Talent - Innovation.png"
  },
  {
    "id": 12,
    "fieldId": [
      "Culture",
      "Seed"
    ],
    "name": "Micro, Small and Medium Enterprise Development Agency (MSMEDA)",
    "description": "MSMEDA is Egypt’s national authority for MSME development, established by Prime Ministerial Decree No. 947 of 2017. It evolved from the Social Fund for Development (1991) and now serves as a central policy integrator, funder, and ecosystem builder for entrepreneurship and inclusive growth.",
    "websiteUrl": "https://www.msmeda.org.eg",
    "email": "info@msmeda.org.eg",
    "phone": "16733",
    "facebookUrl": null,
    "address": "Dokki, Giza, Egypt.",
    "logoImageUrl": "images/Medium-Small-and-Micro-Enterprises.png"
  },
  {
    "id": 13,
    "fieldId": [
      "Culture",
      "Policy",
      "Seed",
      "Events",
      "Platforms",
      "Competitions"
    ],
    "name": "Gemini Africa",
    "description": "Founded by Orascom Investment Holding, Gemini Africa is a one-stop entrepreneurial hub focused on empowering startups across Africa, with a strong emphasis on creative industries, social impact, and underserved regions. It bridges the gap between startups and investors through mentorship, funding, and strategic matchmaking.",
    "websiteUrl": "https://geminiafrica.com",
    "email": "info@geminiafrica.com",
    "phone": "+20 233059971",
    "facebookUrl": null,
    "address": "Al Agouza, Giza, Egypt",
    "logoImageUrl": "images/Gemini-Africa.png"
  },
  {
    "id": 14,
    "fieldId": [
      "Culture",
      "R&D"
    ],
    "name": "Academy of Scientific Research and Technology (ASRT)",
    "description": "Established in 1971, ASRT is Egypt’s national think tank and innovation engine under the Ministry of Higher Education and Scientific Research. It drives science-based policy, funds applied research, and supports entrepreneurship through incubation, competitions, and regional development programs.",
    "websiteUrl": "http://www.asrt.sci.eg",
    "email": "info@asrt.sci.eg",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/ASRT.png"
  },
  {
    "id": 16,
    "fieldId": [
      "Innovation",
      "Women",
      "Accelerators"
    ],
    "name": "icealex",
    "description": "ICEALEX, an innovation consultancy firm, is a leading platform for sector specific incubations, and acts as a community-driven technology innovation hub with a strong social and environmental commitment.The main approach for ice activities is to provide an enabling ecosystem for action-oriented minds co-creating sustainable solutions for local challenges and transforming them into sustainable businesses.",
    "websiteUrl": "https://icealex.com/",
    "email": null,
    "phone": "+2 01012257535",
    "facebookUrl": null,
    "address": "Al Azaritah, Alexandria",
    "logoImageUrl": "images/icealex.png"
  },
  {
    "id": 17,
    "fieldId": [
      "Innovation"
    ],
    "name": "CREATIVA",
    "description": "Creativa is a national initiative launched by MCIT with the aim of promoting the new technology support standard for youth in Egypt. The initiative bridges the gap between technology skills and on the ground requirements from the market. The Creativa hubs are available in Mansoura, Monufia , Menia , Sohag, Qena and Aswan, with each hub providing a unique offering for the local community based on demand. The initiative empowers youth by linking technology skills with the required demand driver ranging from the future job market, freelancing/ remote job market and the entrepreneurial activities.",
    "websiteUrl": "https://creativa.gov.eg/",
    "email": "info@creativa.gov.eg",
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/creativa.png"
  },
  {
    "id": 18,
    "fieldId": [
      "Innovation"
    ],
    "name": "enactus",
    "description": "Enactus utilizes team-based experiential learning and competition to catalyze young people to take positive entrepreneurial action in their communities. Through their efforts, our students make a positive impact on people, the planet, and our shared prosperity – and contribute to achieving the Global Goals.",
    "websiteUrl": "https://enactus.org/",
    "email": "info@ihub.asu.edu.eg",
    "phone": "012345678901",
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/Enactus.png"
  },
  {
    "id": 19,
    "fieldId": [
      "Innovation"
    ],
    "name": "IHub",
    "description": "To foster an enabling environment for innovation and entrepreneurship, and to advance research and development directed toward the needs of industry and businesses. Our mission is to contribute to industrial localization and technology transfer by promoting collaboration between universities and business sectors, and by providing the resources and knowledge necessary to transform ideas into innovative solutions and products that drive economic and social development, while helping to bridge the gap between imports and exports.",
    "websiteUrl": "https://www.asu.edu.eg/ihub/",
    "email": "info@ihub.asu.edu.eg",
    "phone": "012345678901",
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/i-hub.png"
  },
  {
    "id": 20,
    "fieldId": [
      "Innovation"
    ],
    "name": "Egypt Innovate",
    "description": "Egypt Innovates is an electronic platform for innovation in Egypt, providing a source of inspiration, education, and communication for innovators and entrepreneurs. We will take you on a journey through educational and inspiring content, practical tools, and models, and you will enjoy the freedom to access networks of hubs and innovation spaces around the world.Egypt Innovates aims to shed light on Egyptian innovators locally and globally, create points of convergence among them, and build collaborative communities among representatives of the Egyptian innovation and entrepreneurship environment. Additionally, the platform aims to educate innovators and startups about technology and innovation management.SME Support: financial service, feasibility studies, Debt advisory, Bookkeeping & tax services, and CFO outsourcing",
    "websiteUrl": "https://www.egyptinnovate.com/",
    "email": null,
    "phone": null,
    "facebookUrl": "https://www.instagram.com/EgyptInnovate/#",
    "address": null,
    "logoImageUrl": "images/Egypt-Innovate.png"
  },
  {
    "id": 21,
    "fieldId": [
      "Innovation"
    ],
    "name": "Delta Square",
    "description": "Delta Square is a company based in Egypt that focuses on innovation and technology. It operates as an \"Innovation Enablement Platform\" with a mission to bridge the gap between people and new technologies. The company achieves this through various programs, competitions, and capacity-building initiatives.SME Support: financial service, feasibility studies, Debt advisory, Bookkeeping & tax services, and CFO outsourcing",
    "websiteUrl": "https://www.DeltaSqr.com",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "122 Othman Ibn Affan Street, 2nd floor, Heliopolis, Cairo 11736, EG",
    "logoImageUrl": "images/deltasquare.png"
  },
  {
    "id": 22,
    "fieldId": [
      "Education"
    ],
    "name": "IEEE Young Professionals Egypt",
    "description": "IEEE Young Professionals (YP) Egypt is the national affinity group of IEEE for students and early-career engineers. It delivers large-scale programs such as Egyptian Engineering Day (EED), Made in Egypt (MIE), NASA Space Apps Cairo, Future City, and structured mentoring through Mentoring Meet cohorts. The group earned IEEE Region 8 recognition for outstanding activities in collaboration with universities and industry.",
    "websiteUrl": "https://ieeeypegypt.org",
    "email": "yp@ieee.org",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/IEEEYPEGYPT?mibextid=ZbWKwL",
    "address": "Egypt Section (no single HQ address; events held nationwide).",
    "logoImageUrl": "images/IEEE.png"
  },
  {
    "id": 23,
    "fieldId": [
      "Education"
    ],
    "name": "BznsBuilder",
    "description": "BznsBuilder is an AI‑powered platform for business planning, financial forecasting, and investor‑ready documentation. It helps founders model revenue and costs, run scenarios, and generate visual dashboards. The software is used by startups, SMEs, universities and accelerators to standardize plans and improve funding readiness.",
    "websiteUrl": "https://bznsbuilder.com/",
    "email": null,
    "phone": "+20 010 60600 386",
    "facebookUrl": "https://www.facebook.com/BznsBuilder",
    "address": "49 Abd El-Hameed Badawi, Al Matar, El Nozha, Cairo Governorate, Egypt",
    "logoImageUrl": "images/Business-Builder.png"
  },
  {
    "id": 24,
    "fieldId": [
      "Education"
    ],
    "name": "CEO Business School (C.E.O.)",
    "description": "CEO Business School is an Egyptian training and higher-education provider offering MBA/DBA programs and executive diplomas. It specializes in administration, finance, HR, and operations tracks, serving managers and founders seeking practical skills.",
    "websiteUrl": "https://ceo4edu.com/",
    "email": "info@ceo4edu.com",
    "phone": "+20 120 496 6669",
    "facebookUrl": "https://www.facebook.com/CEO4Business/",
    "address": "33 Al-Sad Al Aali Street, Finney Square, Dokki, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 25,
    "fieldId": [
      "Education"
    ],
    "name": "Portolearn",
    "description": "Portolearn provides live and online training in business, analytics, IT, and project management. Its public programming features domain experts and case-based content, with active learner communities hosted on Facebook.",
    "websiteUrl": "lms.portolearn.com",
    "email": "training@portolearn.com",
    "phone": "+20 10 00130125",
    "facebookUrl": "https://www.facebook.com/portolearn/",
    "address": "5 Sunrise Buildings, 3rd Floor 28QW+4F, Nasr City, Egypt.",
    "logoImageUrl": null
  },
  {
    "id": 26,
    "fieldId": [
      "Education"
    ],
    "name": "Octopus – Scientific Awareness Initiative",
    "description": "Octopus is a youth-led scientific awareness initiative in Egypt focused on aquaculture, environmental stewardship, and blue-economy literacy. It delivers Arabic-language outreach, events, and content to improve access to scientific knowledge.",
    "websiteUrl": "https://octopus-initiative.blogspot.com",
    "email": "basel.ahmed.fsh@gmail.com",
    "phone": "+20 10 30183187",
    "facebookUrl": "https://www.facebook.com/octopda/",
    "address": "El-Kafori Street, Cairo, Egypt.",
    "logoImageUrl": null
  },
  {
    "id": 27,
    "fieldId": [
      "Education",
      "Training"
    ],
    "name": "AUEC – Aswan University Entrepreneurship Club",
    "description": "The club trains students in business development abilities through its scheduled events. It provides educational sessions and competitions that enable students to create new business concepts and make industry-professional connections.it helps building a generation of entrepreneurs who can participate locally, regionally and internationally in developing their societies with thought, science and innovation.",
    "websiteUrl": null,
    "email": "aya.dawaba@yahoo.com",
    "phone": "+201092249996",
    "facebookUrl": "https://www.instagram.com/azharentrepreneurshipclub/?r=nametag",
    "address": "Azhar University campus, Egypt.",
    "logoImageUrl": "images/AUEC.png"
  },
  {
    "id": 28,
    "fieldId": [
      "Education"
    ],
    "name": "MET – Misr Higher Institute for Engineering & Technology",
    "description": "MET Mansoura is a higher‑education institute offering engineering and technology programs. It supports applied learning through labs and public e‑learning resources.",
    "websiteUrl": "https://www.engmet.edu.eg/",
    "email": "info@engmet.edu.eg",
    "phone": "+20 50 2245726",
    "facebookUrl": "https://els-engmet.com/",
    "address": "Ring Road, Mansoura, Egypt.",
    "logoImageUrl": "images/Misr-Engineering-Technology-Higher-Institute.png"
  },
  {
    "id": 29,
    "fieldId": [
      "Education"
    ],
    "name": "Startup Grind Cairo",
    "description": "Local chapters of the global Startup Grind community. They host monthly events, founder fireside chats, and networking sessions that connect founders, mentors and investors.",
    "websiteUrl": "https://www.startupgrind.com/cairo/",
    "email": "ahmed@startupgrind.com",
    "phone": "+20 10 04018714",
    "facebookUrl": "https://www.facebook.com/SGNewCairo/",
    "address": "New Cairo, Cairo, Egypt",
    "logoImageUrl": "images/Startup-Grind-Cairo.png"
  },
  {
    "id": 30,
    "fieldId": [
      "Education",
      "Women",
      "Training"
    ],
    "name": "Entreprenelle",
    "description": "Entreprenelle is a mission-driven organization founded in 2015 that empowers women entrepreneurs across Egypt. It reports supporting 100,000+ women and generating EGP 100M+ in economic value through programs, mentorship and access to partners.",
    "websiteUrl": "https://entreprenelle.com/",
    "email": "community@entreprenelle.com",
    "phone": "+20 7700 1007",
    "facebookUrl": "https://www.facebook.com/Entreprenelle/",
    "address": "Space 803, Building 4, Street 151, Maadi, Cairo.",
    "logoImageUrl": "images/Entrepreneurelle.png"
  },
  {
    "id": 31,
    "fieldId": [
      "Education"
    ],
    "name": "AASTMT – Arab Academy for Science, Technology & Maritime Transport",
    "description": "AASTMT is a regional university under the Arab League with campuses across Egypt. It provides degree programs and professional training, and hosts entrepreneurship and innovation initiatives through its colleges and centers.",
    "websiteUrl": "https://aast.edu/en/",
    "email": null,
    "phone": "19838",
    "facebookUrl": null,
    "address": "Abu Qir, Alexandria (Main campus); multiple campuses nationwide.",
    "logoImageUrl": "images/AASTMT.png"
  },
  {
    "id": 32,
    "fieldId": [
      "Education"
    ],
    "name": "Om Habibeh Foundation (OHF) – AKDN",
    "description": "OHF is a locally registered NGO in Aswan (est. 1991) and an implementing agency for Aga Khan Foundation Egypt. It delivers programs in livelihoods, education, health, and civil society, and has reached tens of thousands of beneficiaries in Aswan.",
    "websiteUrl": "https://omhabibeh.org/",
    "email": "procurement@omhabibeh.org",
    "phone": null,
    "facebookUrl": "https://akf.org/country/egypt/",
    "address": "El‑Sadat Road, opposite Dr. Soliman Hospital, Aswan, Egypt.",
    "logoImageUrl": null
  },
  {
    "id": 33,
    "fieldId": [
      "Education",
      "Mentoring",
      "Training"
    ],
    "name": "Fekretak Sherketak (GAFI Entrepreneurship Center)",
    "description": "Fekretak Sherketak is GAFI’s national entrepreneurship platform providing training, mentorship, and a one‑stop Investor Services Centre. In 2025, it launched a Fast Track to accelerate startup establishment and licensing procedures.",
    "websiteUrl": "https://www.investinegypt.gov.eg/",
    "email": "info@gafi.gov.eg",
    "phone": "+20 2 24055425",
    "facebookUrl": "https://www.instagram.com/fekretaksherketak/?hl=en",
    "address": "GAFI HQ, 3 Salah Salem St., Nasr City, Cairo 11562.",
    "logoImageUrl": "images/Fekretak.png"
  },
  {
    "id": 34,
    "fieldId": [
      "Education"
    ],
    "name": "NubiAvest",
    "description": "NubiAvest is a platform and micro‑business studio focused on creative industries, green economy and tourism, with strong roots in Upper Egypt. It runs a Micro Business Studio program and partners with ecosystem actors such as enpact and Startup Haus Cairo.",
    "websiteUrl": "nubiavest.com",
    "email": "info@nubiavest.com",
    "phone": null,
    "facebookUrl": "https://www.instagram.com/nubiavest_/",
    "address": "wadi karkar st.10 , Aswan, Egypt",
    "logoImageUrl": "images/Nubiavest.png"
  },
  {
    "id": 35,
    "fieldId": [
      "Education",
      "Mentoring"
    ],
    "name": "Fab Lab Egypt (San3a Tech)",
    "description": "Fab Lab Egypt is a makerspace and innovation lab offering access to digital fabrication tools (3D printing, CNC, laser cutting), prototyping services, and training. It supports startups, students, and corporates with lab access and custom innovation programs.",
    "websiteUrl": "https://www.fablabegypt.com/",
    "email": "fablabegypt@san3atech.com",
    "phone": "+20 10 8033 1705",
    "facebookUrl": "https://www.facebook.com/fablab.egypt/",
    "address": "Villa 35, 100 Street, near Al Horia Square, Maadi, Cairo.",
    "logoImageUrl": "images/Fab-Lab.png"
  },
  {
    "id": 36,
    "fieldId": [
      "Education"
    ],
    "name": "INJAZ Egypt",
    "description": "INJAZ Egypt (est. 2003) delivers experiential learning in entrepreneurship, work readiness, and financial literacy through school and university programs and a large corporate volunteer network. Impact reports cite hundreds of thousands of students served.",
    "websiteUrl": "https://www.injaz-egypt.org/",
    "email": "injaz@injaz-egypt.org",
    "phone": "+2 02 25284205",
    "facebookUrl": "https://www.instagram.com/injazegypt/",
    "address": "El‑Shaikh Rihan, Abdeen, Cairo (office); historic address: 52 Corniche El‑Maadi.",
    "logoImageUrl": "images/INJAZ-EGYPT.png"
  },
  {
    "id": 37,
    "fieldId": [
      "Education"
    ],
    "name": "ASRT – Academy of Scientific Research & Technology",
    "description": "ASRT is Egypt’s national body for coordinating scientific research and innovation policy. It operates funding programs, IP services, and national initiatives such as the Children’s University.",
    "websiteUrl": "http://eforms.asrt.sci.eg/",
    "email": "info@asrt.sci.eg",
    "phone": "(+20 2) 27921263",
    "facebookUrl": "https://eforms.asrt.sci.eg/",
    "address": "101 Kasr Al‑Aini St., Cairo 11516, Egypt.",
    "logoImageUrl": "images/ASRT.png"
  },
  {
    "id": 38,
    "fieldId": [
      "Education"
    ],
    "name": "Made in Egypt (MIE) – IEEE YP Competition",
    "description": "MIE is a national competition founded by IEEE Young Professionals Egypt that helps senior students turn graduation projects into startups by linking them with business mentorship and exposure.",
    "websiteUrl": "https://ieeeypegypt.org/mie/",
    "email": "mie@ieeeypegypt.org",
    "phone": null,
    "facebookUrl": "https://www.instagram.com/madeinegyptcompetition/",
    "address": null,
    "logoImageUrl": "images/MIE-logo.png"
  },
  {
    "id": 39,
    "fieldId": [
      "Education"
    ],
    "name": "Enactus Egypt",
    "description": "Enactus Egypt supports student teams that build social enterprise projects. It runs the annual national competition and connects teams to the global Enactus network.",
    "websiteUrl": "https://enactusegypt.org/",
    "email": "fsirry@enactus.org",
    "phone": "+20100 606 3107",
    "facebookUrl": "https://enactusegypt.org/contact/",
    "address": "Villa 101, District 8, 3rd Neighborhood, Sheikh Zayed, Giza.",
    "logoImageUrl": "images/Enactus.png"
  },
  {
    "id": 40,
    "fieldId": [
      "NGOs"
    ],
    "name": "Eitesal",
    "description": "EiTESAL for Information & Communication Technology is Egypt’s foremost private non-profit organization that has been actively and powerfully supporting the ICT industry in Egypt since 2004. It has played a significant and vital role in building and developing the ICT sector in the last 20 years.",
    "websiteUrl": "https://www.eitesal.org/en/contact-us",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "22 Dessouk St., off Al-Imam Aly, Ismailia Square, Heliopolis",
    "logoImageUrl": "images/Eitesal.png"
  },
  {
    "id": 41,
    "fieldId": [
      "NGOs"
    ],
    "name": "EPEA - Egyptian Private Equity Association",
    "description": "EPEA is a nonprofit association committed to supporting and developing the Private Equity and Venture Capital industry in Egypt and the surrounding region.",
    "websiteUrl": "https://epea-eg.org/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "22 Mohamed Saeed El Halawani Street, Orouba Road, Heliopolis, Cairo, Egypt.",
    "logoImageUrl": "images/EPEA.png"
  },
  {
    "id": 42,
    "fieldId": [
      "NGOs"
    ],
    "name": "AWTAD",
    "description": "The Association for Women’s Total Advancement and Development (AWTAD) is an NGO dedicated to the professional and personal development of Egyptian women and youth as a means to empower them on both the social and economic level.",
    "websiteUrl": "https://www.awtad-egypt.org/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "19 151 Street, Maadi, Cairo, Egypt",
    "logoImageUrl": "images/Awtad-for-women.png"
  },
  {
    "id": 43,
    "fieldId": [
      "NGOs"
    ],
    "name": "GESR",
    "description": "GESR is a program affiliated to Misr El-Kheir Foundation launched in 2013, showcasing its responsibility to contribute to a knowledge-based economy, through supporting innovators and technology startups solving social challenges in the fields of Water, Energy, Food, Health, Education, AI and IOT.",
    "websiteUrl": "https://gesr.net/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "4 El Ahram Street, El Nafoura Square, Al Mokattam, Cairo, Egypt.",
    "logoImageUrl": "images/Gesr-MEK.png"
  },
  {
    "id": 44,
    "fieldId": [
      "NGOs"
    ],
    "name": "ACSR",
    "description": "The Arab Council for Social Responsibility “ACSR” : is a member in the UN Global Compact and the first council in Egypt that aims to be the platform for community development in the Arab region for both sharing experiences and helping in the developmental process. The council have a wide number of partners nationally, regionally and internationally.",
    "websiteUrl": "http://www.acsrglobal.org/en",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "106 Canadian School St.- Fourth district - fifth settlement.",
    "logoImageUrl": "images/ACSR.png"
  },
  {
    "id": 45,
    "fieldId": [
      "NGOs",
      "Policy"
    ],
    "name": "Enactus",
    "description": "Enactus is the world’s largest experiential learning platform dedicated to creating a better world while developing the next generation of entrepreneurial leaders and social innovators. The Enactus network of global business, academic and student leaders are unified by our vision - to create a better, more sustainable world.",
    "websiteUrl": "https://enactusegypt.org/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Villa 101, District 8, 3rd Neighborhood, Sheikh Zayed, Giza.",
    "logoImageUrl": "images/Enactus.png"
  },
  {
    "id": 46,
    "fieldId": [
      "NGOs"
    ],
    "name": "DTA",
    "description": "DTA is a non-profit organization that works as a hub for IT business people committed to develop a solid base of Entrepreneurship and Innovation culture to serve developing an IT Industry in Nile Delta Of Egypt.",
    "websiteUrl": "https://delta-it.org/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Al Qanah Tower, 9th Floor, Suez Canal Street, Mansoura, DK, Egypt.",
    "logoImageUrl": null
  },
  {
    "id": 47,
    "fieldId": [
      "NGOs",
      "Training"
    ],
    "name": "Giza Systems",
    "description": "Giza Systems, a digital transformation enabler and a leading systems integrator in the MEA region designs and deploys industry-specific technology solutions for asset-intensive industries such as the Telecoms, Utilities, Oil & Gas, Urban Communities, Smart Mobility and other market sectors. Giza Systems is part of the solutions by stc group of companies.",
    "websiteUrl": "https://gizasystems.com/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "City Center Plot 176, Second Sector, New Cairo 1, Cairo Governorate 11835, Egypt.",
    "logoImageUrl": "images/Giza_systems-Foundation.png"
  },
  {
    "id": 48,
    "fieldId": [
      "NGOs"
    ],
    "name": "EDEA",
    "description": "Economic Development & Entrepreneurship Association (EDEA) is a nongovernmental organization. EDEA members are business people, society, entrepreneurs and MSMEs owners. Enabling MSMEs to enhance economic and social development in Egypt.",
    "websiteUrl": "https://www.edea-alex.com/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Alexandria/Egypt.",
    "logoImageUrl": "images/EDEA.png"
  },
  {
    "id": 49,
    "fieldId": [
      "NGOs",
      "Training"
    ],
    "name": "YLF",
    "description": "Youth Leaders Foundation (YLF) is a non-profit organization with a registered number 809 for 2017 providing targeted services to find hidden calibres to support and strengthen Egypt’s youth segment.",
    "websiteUrl": "https://ylf-eg.org/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "108 belal ibn rabaha 5 settlement, Cairo Governorate/Egypt.",
    "logoImageUrl": "images/YLF.png"
  },
  {
    "id": 50,
    "fieldId": [
      "NGOs"
    ],
    "name": "MALAIKAH",
    "description": "Malaikah-EGYBAN acts as the voice of the angel investment community, we represent the views and interests of the angel investment community to business leaders, government officials so as to link relevant and interested key players together.",
    "websiteUrl": "http://malaikah.org/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "76- Abdel Moneim Riyad St. El Mohandeseen, 2nd Floor, Office 201. Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 61,
    "fieldId": [
      "Donors"
    ],
    "name": "World Food Programme (WFP Egypt)",
    "description": "WFP is the UN’s food assistance arm, active in Egypt since 1968. While traditionally focused on nutrition and humanitarian aid, WFP has expanded into entrepreneurship, youth empowerment, and climate-smart innovation, aligning with Egypt Vision 2030 and the Haya Kareema initiative.",
    "websiteUrl": "https://www.wfp.org/countries/egypt",
    "email": "egypt.info@wfp.org",
    "phone": "+20 (2) 2528-1730",
    "facebookUrl": null,
    "address": "12 Mohamed Mahmoud Street, Garden City, Cairo, Egypt",
    "logoImageUrl": "images/1010px-World_Food_Programme_Logo_Simple.svg.png"
  },
  {
    "id": 62,
    "fieldId": [
      "Donors"
    ],
    "name": "Japan International Cooperation Agency (JICA Egypt)",
    "description": "JICA is Japan’s official development agency, operating in Egypt since 1977. It supports inclusive growth, human capital development, and entrepreneurship through technical cooperation, grant aid, and public-private partnerships. JICA’s work in Egypt spans education, industrial development, and startup support—especially through innovation competitions and university partnerships.",
    "websiteUrl": "https://www.jica.go.jp/english/overseas/egypt/office/index.html",
    "email": "egypt@jica.go.jp",
    "phone": "+20 (2) 2574-8240",
    "facebookUrl": "https://www.linkedin.com/company/japan-international-cooperation-agency-jica-/",
    "address": "World Trade Center, 6th Floor, 1191 Corniche El Nile, Boulak, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 63,
    "fieldId": [
      "Donors"
    ],
    "name": "Islamic Corporation for the Insurance of Investment and Export Credit (ICIEC)",
    "description": "ICIEC is a member of the Islamic Development Bank (IsDB) Group, headquartered in Jeddah, Saudi Arabia. It provides Sharia-compliant investment and export credit insurance to support trade and foreign direct investment in OIC member countries, including Egypt. ICIEC plays a strategic role in de-risking entrepreneurship, SME growth, and infrastructure development by enabling access to finance and cross-border trade.",
    "websiteUrl": "https://www.iciec.isdb.org/",
    "email": "iciec@isdb.org",
    "phone": "+966 12 636 1400",
    "facebookUrl": "https://www.linkedin.com/company/iciec-isdb/",
    "address": "Operates via IsDB Regional Hub – Boomerang Building, 90th Street, New Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 64,
    "fieldId": [
      "Donors"
    ],
    "name": "European Bank for Reconstruction and Development (EBRD) – Egypt",
    "description": "EBRD is a multilateral development bank focused on private sector development and transition economies. Egypt became a country of operation in 2012, and since then, EBRD has invested over €10.3 billion in 160+ projects. Its work in Egypt emphasizes entrepreneurship, youth employment, financial inclusion, and green innovation.",
    "websiteUrl": "https://www.ebrd.com/",
    "email": "egypt@ebrd.com",
    "phone": "+20 (2) 2461-4230",
    "facebookUrl": "https://www.linkedin.com/company/ebrd/",
    "address": null,
    "logoImageUrl": "images/EBRD.png"
  },
  {
    "id": 65,
    "fieldId": [
      "Donors"
    ],
    "name": "European Investment Bank (EIB) – Egypt",
    "description": "The EIB is the European Union’s development bank and a key financier of Egypt’s infrastructure, entrepreneurship, and green economy transition. Through its arm EIB Global, the bank supports inclusive growth, SME development, and innovation ecosystems. Egypt has been a partner since 1979, with over €13.7 billion invested across 118 projects.",
    "websiteUrl": "https://www.eib.org/en/projects/country/egypt",
    "email": "info@eib.org",
    "phone": null,
    "facebookUrl": "https://www.linkedin.com/company/european-investment-bank/",
    "address": null,
    "logoImageUrl": null
  },
  {
    "id": 66,
    "fieldId": [
      "Donors"
    ],
    "name": "International Finance Corporation (IFC) – Egypt",
    "description": "IFC is the private sector arm of the World Bank Group, focused on promoting inclusive economic growth through investment and advisory services. In Egypt, IFC supports entrepreneurship, fintech innovation, and SME development, with a strong emphasis on youth employment, financial inclusion, and digital transformation.",
    "websiteUrl": "https://www.ifc.org/en/home",
    "email": "info@ifc.org",
    "phone": "+20 (2) 2461-4230",
    "facebookUrl": "https://www.linkedin.com/company/ifclinkedin",
    "address": "World Bank Group Office, 10th Floor, 6A Midan Simón Bolívar, Garden City, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 67,
    "fieldId": [
      "Donors"
    ],
    "name": "GIZ Egypt – Deutsche Gesellschaft für Internationale Zusammenarbeit",
    "description": "GIZ is Germany’s official development agency, operating in Egypt on behalf of the Federal Ministry for Economic Cooperation and Development (BMZ). GIZ supports Egypt’s transition toward inclusive employment, entrepreneurship, and green economy transformation. Its programs focus on youth, women, SMEs, and public-private partnerships, with strong alignment to Egypt’s Vision 2030.",
    "websiteUrl": "https://www.giz.de",
    "email": "giz-egypt@giz.de",
    "phone": "+20 (2) 2528-2000",
    "facebookUrl": "https://de.linkedin.com/company/gizgmbh?trk=similar-pages",
    "address": "4A El Gezira Street, Garden City, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 68,
    "fieldId": [
      "Donors"
    ],
    "name": "Islamic Development Bank (IsDB)",
    "description": "IsDB is a multilateral development bank headquartered in Jeddah, Saudi Arabia, with Egypt as a founding member. Through its Regional Hub in Cairo, IsDB supports inclusive development, youth empowerment, entrepreneurship, and infrastructure across Egypt and neighboring countries. Its work aligns with the SDGs and Egypt’s Vision 2030, emphasizing human capital, innovation, and resilience.",
    "websiteUrl": "https://www.isdb.org/hub/cairo",
    "email": "cairohub@isdb.org",
    "phone": "+20 (2) 2537-0044",
    "facebookUrl": "https://www.linkedin.com/company/islamic-development-bank/",
    "address": "6th Floor, Plot 46, Financial Center, Boomerang Building, 90th Street, New Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 69,
    "fieldId": [
      "Donors"
    ],
    "name": "Danish International Development Agency (DANIDA)",
    "description": "DANIDA is Denmark’s official development cooperation arm, operating under the Ministry of Foreign Affairs. In Egypt, DANIDA works through the Danish Embassy and the Danish-Arab Partnership Programme (DAPP), focusing on youth employment, entrepreneurship, human rights, and governance.",
    "websiteUrl": "https://egypten.um.dk/en/danida",
    "email": "cairoamb@um.dk",
    "phone": "+20 (2) 2461-1100",
    "facebookUrl": "https://www.linkedin.com/company/udenrigsministeriet-denmark/?_l=en_US",
    "address": "Embassy of Denmark, 13 El Sheikh Mohamed Abd El Wahab Street, Zamalek, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 70,
    "fieldId": [
      "Donors"
    ],
    "name": "Global Affairs Canada",
    "description": "Canada’s development cooperation with Egypt is managed through Global Affairs Canada. With a focus on inclusive economic growth, youth empowerment, and climate-smart job creation, Canada supports talent development through strategic partnerships in education, agribusiness, and technical training.",
    "websiteUrl": "https://www.canada.ca/en/global-affairs",
    "email": "cfli-cairo@international.gc.ca",
    "phone": "+20 (2) 2461-2200",
    "facebookUrl": "https://www.linkedin.com/company/global-affairs-canada/?_l=en_US",
    "address": "Embassy of Canada, 26 Ahmed Heshmat Street, Zamalek, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 71,
    "fieldId": [
      "Donors"
    ],
    "name": "United States Agency for International Development (USAID Egypt)",
    "description": "USAID has supported Egypt’s development for over four decades, focusing on education, economic growth, and entrepreneurship. Through initiatives like SEED, Business Egypt, and the Economic Governance Activity, USAID strengthens talent pipelines, incubators, and innovation hubs—especially for youth and women.",
    "websiteUrl": "usaid.gov/egypt",
    "email": "egypt-info@usaid.gov",
    "phone": "+20 (2) 2522-7000",
    "facebookUrl": "https://www.linkedin.com/company/usaid",
    "address": "1/A Nady El Etisalat Street, New Maadi, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 72,
    "fieldId": [
      "Women"
    ],
    "name": "Mitcha",
    "description": "Mitcha, launched in 2018 by Hilda Louca, is Egypt’s premier multi-brand fashion ecommerce platform. Its mission is to unite and showcase over 300 homegrown Egyptian designers on a curated, internationally-standard digital platform, bringing local fashion to both local and global audiences.",
    "websiteUrl": "https://mitcha.com",
    "email": "customerservice@mitcha.com",
    "phone": "+20 110 299 0184",
    "facebookUrl": "https://www.facebook.com/officialmitcha",
    "address": "5 Fatma El Sharbatly Square, Cairo, Egypt",
    "logoImageUrl": "images/mitcha.png"
  },
  {
    "id": 73,
    "fieldId": [
      "Women"
    ],
    "name": "Women-UP (Egyptian Initiative)",
    "description": "Women-UP is a national initiative funded by the European Union and coordinated by the Academy of Scientific Research and Technology (ASRT) in collaboration with the SEKEM Development Foundation and Techno Khair for Development – Assuit. It aims to enhance the capabilities and sustainability of women-led businesses across Egypt.",
    "websiteUrl": "https://www.womenup.eg.net",
    "email": "womenup@asrt.sci.eg",
    "phone": "+20227964421",
    "facebookUrl": "https://www.facebook.com/p/Women-UP-100064041159202/",
    "address": "Academy of Scientific Research and Technology (Women-UP Project Coordinator), 101 Kasr Al-Aini Street, 6th floor, 11516, Cairo, Egypt",
    "logoImageUrl": "images/womanup.png"
  },
  {
    "id": 74,
    "fieldId": [
      "Women",
      "Accelerators"
    ],
    "name": "World Food Programme (WFP)",
    "description": "The World Food Programme (WFP) is the food-assistance branch of the United Nations and the largest humanitarian organization globally, providing food support and capacity-building to communities in need. In Egypt, WFP works closely with government and local partners to secure food and nutrition, strengthen resilience, support livelihoods, and enhance institutional capacity.",
    "websiteUrl": "https://www.wfp.org",
    "email": "amina.alkorey@wfp.org",
    "phone": "+20 2 2526 1992",
    "facebookUrl": "https://www.facebook.com/WorldFoodProgramme.Arabic",
    "address": "WFP Egypt Country Office, 49 Road 105, Maadi, Cairo, Egypt",
    "logoImageUrl": "images/1010px-World_Food_Programme_Logo_Simple.svg.png"
  },
  {
    "id": 75,
    "fieldId": [
      "Women"
    ],
    "name": "She Leads - Youth Leaders Foundation (YLF), Egypt",
    "description": "She Leads is the pioneering initiative by the Youth Leaders Foundation (YLF) focused on empowering young women in vocational and technical education across Egypt. YLF is a non-profit organization established in 2017 by young professionals to support Egyptian youth, aligning with Egypt’s Vision 2030 and the UN’s Sustainable Development Goals through cross-sector partnerships.",
    "websiteUrl": "https://ylfeg.org/",
    "email": "info@ylfeg.org",
    "phone": "+20 2 2537 9654",
    "facebookUrl": "https://m.facebook.com/ylf.org/about/",
    "address": "108A Belal Ibn Rabah, 5th Settlement, Cairo Governorate, Egypt",
    "logoImageUrl": "images/YLF.png"
  },
  {
    "id": 77,
    "fieldId": [
      "Women"
    ],
    "name": "TIEC (Technology Innovation & Entrepreneurship Center)",
    "description": "The Technology Innovation & Entrepreneurship Center (TIEC), established in September 2010, operates under Egypt’s Information Technology Industry Development Agency (ITIDA) and Ministry of Communications and Information Technology (MCIT). Its mission is to catalyze innovation, promote ICT entrepreneurship, and drive the creation of intellectual property within Egypt's tech ecosystem.",
    "websiteUrl": "http://www.tiec.gov.eg",
    "email": "inquiries@tiec.gov.eg",
    "phone": "+20 2 3534 5196",
    "facebookUrl": "https://m.facebook.com/tiec.egypt/about/",
    "address": "Smart Village, Building B5, Cairo–Alexandria Desert Road, Abou Rawash, Giza, Egypt",
    "logoImageUrl": "images/tiec.png"
  },
  {
    "id": 78,
    "fieldId": [
      "Women",
      "Accelerators"
    ],
    "name": "Businessita",
    "description": "Businessita is a Cairo-based ecosystem enabler dedicated to empowering social entrepreneurs and women-led ventures. They emphasize a unique “Psychology in Business” approach—integrating self-awareness, mindset, and emotional intelligence with strategy and operations to nurture more holistic, sustained entrepreneurial success.",
    "websiteUrl": "https://www.businessita-we.com/",
    "email": "hello@businessitawe.com",
    "phone": "+20 0106 496 3484",
    "facebookUrl": "https://www.facebook.com/businessita.we",
    "address": "146 Nasr Street, New Maadi, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 79,
    "fieldId": [
      "Women",
      "Special Abilities"
    ],
    "name": "Assiut Business Women Association (ABWA)",
    "description": "The Assiut Business Women Association (ABWA) is a non-profit organization established in the year 2000. Based in Assiut, Egypt, ABWA focuses on empowering marginalized women through economic development and capacity-building initiatives.",
    "websiteUrl": "https://abwa-eg.org/",
    "email": "info@abwa-eg.com",
    "phone": "+20 88 226 5875",
    "facebookUrl": null,
    "address": "Assiut, El Gomhoureya St, Osman Ibn Affan Towers, Main Entrance, Assiut, 71111, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 80,
    "fieldId": [
      "Women"
    ],
    "name": "Rabeha",
    "description": "\"Rabeha\" (meaning “winner” in Arabic) is a five-year joint initiative, spearheaded by UN Women and UNIDO, aimed at economically empowering women across Egypt. The programme focuses on capacity building, job placement, entrepreneurial support, and integration into sustainable value chains.",
    "websiteUrl": null,
    "email": "wee-egypt@unwomen.org",
    "phone": "+20 2 2751 0191",
    "facebookUrl": null,
    "address": "UN Women Egypt Office: 21 Al Nahda Street, Maadi, Cairo",
    "logoImageUrl": null
  },
  {
    "id": 81,
    "fieldId": [
      "Women"
    ],
    "name": "Conseil Consulting EG",
    "description": "Conseil Consulting EG is a Cairo-based consultancy firm focused on business and management transformation, strategic planning, and organizational excellence. Under the leadership of Dr. Dina Yacout (MCIM, CMKtr), the firm delivers tailored consulting, training, research, and capacity-building services across institutions, private entities, and nonprofits.",
    "websiteUrl": "http://conseilconsultingeg.com",
    "email": "dinayacout@conseilconsultingeg.com",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/DrDinaYacout",
    "address": null,
    "logoImageUrl": null
  },
  {
    "id": 82,
    "fieldId": [
      "Women"
    ],
    "name": "Women Entrepreneurs Network (WEN)",
    "description": "The Women Entrepreneurs Network (WEN) is Egypt’s first entrepreneurial “network of networks,” established in 2018 with support from USAID and currently backed by the Business Egypt project. It connects member organizations across diverse sectors and regions to create a vibrant ecosystem supporting both emerging and established women entrepreneurs.",
    "websiteUrl": "https://wen.org.eg/about/",
    "email": "info@wen.org.eg",
    "phone": null,
    "facebookUrl": null,
    "address": "22 Anwar ElMufti Street, Tiba 2000 Administrative Building, Nasr City, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 84,
    "fieldId": [
      "Women",
      "Accelerators",
      "Incubators"
    ],
    "name": "CinemaTech",
    "description": "CinemaTech is the world’s first entrepreneurial track specifically designed to inject technological solutions into the entertainment industry—spanning film, TV, and related creative sectors. It is powered by Gemini Africa, in partnership with the Academy of Scientific Research & Technology (ASRT).",
    "websiteUrl": "https://www.cinematech.org/",
    "email": "info@geminiafrica.com",
    "phone": "+20 233059971",
    "facebookUrl": "https://www.facebook.com/CinemaTechTrack",
    "address": "160 26th July Corridor, Agouza, Giza, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 85,
    "fieldId": [
      "Women"
    ],
    "name": "Om Habibeh Foundation (OHF)",
    "description": "The Om Habibeh Foundation is a long-standing Egyptian non-profit founded in 1991. It operates as the Egyptian affiliate of the Aga Khan Development Network (AKDN) and is supervised by the Ministry of Social Solidarity. Based in Aswan, the Foundation advances community development across health, education, early childhood, agriculture, women’s empowerment, and economic inclusion.",
    "websiteUrl": "https://omhabibeh.org/",
    "email": "rania.elkishawi@akdn.org",
    "phone": "+20 123 210 010",
    "facebookUrl": null,
    "address": "El-Sadat Road, opposite Dr. Soliman Hospital, Aswan, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 86,
    "fieldId": [
      "Women"
    ],
    "name": "IEEE Young Professionals",
    "description": "IEEE Young Professionals (YP) Egypt is an affinity group under IEEE Egypt Section dedicated to empowering engineers, technologists, and innovators in the early stages of their careers (typically IEEE members who graduated within the past 15 years). It provides professional development opportunities, leadership training, networking, and exposure to cutting-edge technology trends.",
    "websiteUrl": "https://yp.ieee.org/",
    "email": "Yp@ieee.org",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/ieeeyp",
    "address": "IEEE Egypt Section / IEEE Young Professionals Egypt, 101 El Kasr El Aini Street, 3rd Floor, Cairo, Egypt (ASRT Building, IEEE Egypt HQ)",
    "logoImageUrl": "images/IEEE.png"
  },
  {
    "id": 87,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Inno101 Accelerator",
    "description": "Inno101 is a Cairo-based startup accelerator focusing on technology-driven and digital transformation startups. It helps both early-stage and growth-stage ventures refine business models, validate product-market fit, and prepare for scaling.",
    "websiteUrl": "https://inno101.com",
    "email": "info@inno101.com",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/INNO101-Support-Accelerators.png"
  },
  {
    "id": 88,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Athar Accelerator",
    "description": "Saudi-based program supporting early-stage startups in social entrepreneurship, technology, and innovation.",
    "websiteUrl": "https://athar-sa.com",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Riyadh, Saudi Arabia",
    "logoImageUrl": "images/athar-logo-150x75.png"
  },
  {
    "id": 89,
    "fieldId": [
      "Accelerators"
    ],
    "name": "AUC Venture Lab (V-Lab)",
    "description": "Egypt’s first university-based accelerator (2013), hosted at AUC School of Business, supporting innovation-driven startups.",
    "websiteUrl": "https://business.aucegypt.edu/centers/vlab",
    "email": "vlab@aucegypt.edu",
    "phone": "+20 2 2615 3295",
    "facebookUrl": null,
    "address": "AUC New Cairo, Egypt",
    "logoImageUrl": "images/AUC-Venture-Lab.png"
  },
  {
    "id": 90,
    "fieldId": [
      "Accelerators",
      "Mentoring"
    ],
    "name": "Endeavor Egypt – ScaleUp Program",
    "description": "Part of Endeavor Global Network, focusing on scaling high-impact startups.",
    "websiteUrl": "https://endeavoreg.org/programs/scaleup",
    "email": "info@endeavoreg.org",
    "phone": "+20 2 2461 9444",
    "facebookUrl": null,
    "address": "Nile City Towers, Cairo, Egypt",
    "logoImageUrl": "images/Endeavor-Egypt.png"
  },
  {
    "id": 91,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Flat6Labs",
    "description": "Founded in 2011, one of MENA’s largest accelerators and seed-stage VCs.",
    "websiteUrl": "https://flat6labs.com",
    "email": "cairo@flat6labs.com",
    "phone": "+20 2 3568 5856",
    "facebookUrl": null,
    "address": "Giza, Egypt",
    "logoImageUrl": "images/Flat6labs.png"
  },
  {
    "id": 92,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Falak Startups",
    "description": "Founded under Egypt Ventures, supports tech-enabled startups.",
    "websiteUrl": "https://falakstartups.com",
    "email": "info@falakstartups.com",
    "phone": null,
    "facebookUrl": null,
    "address": "The Greek Campus, Cairo",
    "logoImageUrl": "images/Falak.png"
  },
  {
    "id": 93,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Tanmia wa Tatweer (TWT) Accelerator",
    "description": "Egyptian accelerator focusing on SMEs in manufacturing, agribusiness, and technology.",
    "websiteUrl": "https://twtegypt.com",
    "email": "info@twtegypt.com",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/Tanmia-Wa-Tatweer-TWT.png"
  },
  {
    "id": 94,
    "fieldId": [
      "Accelerators"
    ],
    "name": "AUC – Onsi Sawiris Business School",
    "description": "One of the top business schools in MENA with triple accreditation. Hosts CEI and V-Lab.",
    "websiteUrl": "https://business.aucegypt.edu",
    "email": "business@aucegypt.edu",
    "phone": "+20 2 2615 3242",
    "facebookUrl": null,
    "address": "AUC Avenue, New Cairo",
    "logoImageUrl": null
  },
  {
    "id": 95,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Ripple Impact",
    "description": "Consulting collective offering personalized acceleration for entrepreneurs, authors, and speakers.",
    "websiteUrl": "https://rippleimpact.com",
    "email": "hello@rippleimpact.com",
    "phone": null,
    "facebookUrl": null,
    "address": "USA (remote-first)",
    "logoImageUrl": null
  },
  {
    "id": 96,
    "fieldId": [
      "Accelerators",
      "Preseed",
      "Venture Capital"
    ],
    "name": "EdVentures",
    "description": "Launched in 2017 by Nahdet Misr, the first MENA corporate VC focused on EdTech.",
    "websiteUrl": "https://www.nmedventures.com",
    "email": "info@nmedventures.com",
    "phone": "+20 1029 980 661",
    "facebookUrl": null,
    "address": "Giza, Egypt",
    "logoImageUrl": "images/EdVentures.png"
  },
  {
    "id": 97,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Supply Chain and Logistics Incubator",
    "description": "First Arab incubator specializing in logistics and supply chain under AASTMT.",
    "websiteUrl": "https://www.aast.edu/en/centers/Entrepreneurship",
    "email": "ec@aast.edu",
    "phone": "19838",
    "facebookUrl": null,
    "address": "AASTMT, Cairo & Alexandria",
    "logoImageUrl": null
  },
  {
    "id": 98,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Orange Digital Center Egypt",
    "description": "Part of Orange Group’s digital inclusion initiative, offering coding, FabLab, and startup acceleration.",
    "websiteUrl": "https://www.orangedigitalcenters.com/country/EG/home",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 99,
    "fieldId": [
      "Accelerators"
    ],
    "name": "TEQDAR Accelerator Program – Banque Misr",
    "description": "Banque Misr’s six-month fintech-focused accelerator (launched 2020).",
    "websiteUrl": "https://digital.banquemisr.com/accelerator",
    "email": "teqdar@banquemisr.com",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 100,
    "fieldId": [
      "Accelerators",
      "Incubators"
    ],
    "name": "TIEC – Technology Innovation & Entrepreneurship Center",
    "description": "National ICT innovation hub under MCIT Egypt (founded 2010).",
    "websiteUrl": "https://tiec.gov.eg",
    "email": "inquiries@tiec.gov.eg",
    "phone": "+20 2 3534 5813",
    "facebookUrl": null,
    "address": "Smart Village, Giza, Egypt",
    "logoImageUrl": "images/tiec.png"
  },
  {
    "id": 101,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Accelerator 101 – ASRT",
    "description": "Program by Academy of Scientific Research & Technology, focusing on women and social entrepreneurs.",
    "websiteUrl": "http://www.asrt.sci.eg",
    "email": "international.relations.asrt@gmail.com",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/ASRT.png"
  },
  {
    "id": 102,
    "fieldId": [
      "Accelerators",
      "Incubators",
      "Culture",
      "Training"
    ],
    "name": "NilePreneurs",
    "description": "Initiative by Central Bank of Egypt and Nile University to support SMEs and startups.",
    "websiteUrl": "https://np.eg",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Nile University, Sheikh Zayed, Giza",
    "logoImageUrl": "images/NilePreneurs.png"
  },
  {
    "id": 103,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Entlaq",
    "description": "Think tank and accelerator founded in 2023 to position Egypt as a startup hub.",
    "websiteUrl": "https://entlaq.com",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 104,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Rally Accelerate – AASTMT",
    "description": "Fundraising-focused accelerator by AASTMT Entrepreneurship Center.",
    "websiteUrl": "https://ec.aast.edu/rally-accelerate.php",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "AASTMT Entrepreneurship Center, Egypt",
    "logoImageUrl": "images/AASTMT.png"
  },
  {
    "id": 105,
    "fieldId": [
      "Accelerators"
    ],
    "name": "AASTMT (Institution)",
    "description": "Arab Academy for Science, Technology & Maritime Transport, offering education and entrepreneurial programs.",
    "websiteUrl": "https://aast.edu",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Multiple campuses, Egypt",
    "logoImageUrl": "images/AASTMT.png"
  },
  {
    "id": 106,
    "fieldId": [
      "Accelerators"
    ],
    "name": "ESLSCA's Entrepreneurial Enterprises (Ex³)",
    "description": "ESLSCA University’s entrepreneurship program integrating incubation and training for students.",
    "websiteUrl": "https://eslsca.edu.eg/ex3",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "ESLSCA University, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 107,
    "fieldId": [
      "Accelerators"
    ],
    "name": "ElRehla (JRNY – The Journey)",
    "description": "ElRehla offers immersive, four-day retreat experiences designed for entrepreneurs, founders, industry leaders, and corporate teams. Set in environments like the Sinai desert, these “out-of-office” camps blend business workshops with wellness, creative expression, and deep social bonding.",
    "websiteUrl": "https://jrny.me",
    "email": "info@jrny.me",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 108,
    "fieldId": [
      "Accelerators",
      "Platforms"
    ],
    "name": "MAGNiTT",
    "description": "MAGNiTT is a Dubai-based startup data platform (Software-as-a-Service) that provides data, analytics, insights, and reports on venture capital, startups and investors across the Middle East, Africa, Pakistan, Turkey and Southeast Asia.",
    "websiteUrl": "https://magnitt.com",
    "email": "info@magnitt.com",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/MAGNiTT",
    "address": "Innovation One Building, Level 10, DIFC, Dubai, UAE",
    "logoImageUrl": "images/mag.png"
  },
  {
    "id": 109,
    "fieldId": [
      "Accelerators"
    ],
    "name": "UNICA (Unica Research)",
    "description": "UNICA (Unica Research) is the first market research agency in Egypt dedicated to serving startups and SMEs, founded by Engy Abdelwahab.",
    "websiteUrl": "https://unicaresearch.com",
    "email": "engy.wahab@unicaresearch.com",
    "phone": "+20 1007017192",
    "facebookUrl": "https://www.facebook.com/unica.research",
    "address": "25 Naguib El-Rihani Street, Downtown Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 110,
    "fieldId": [
      "Accelerators"
    ],
    "name": "The Egyptian Center for Economic Studies (ECES)",
    "description": "The Egyptian Center for Economic Studies (ECES) is an independent, non-profit think tank established in 1992 that specialises in economic research and policy analysis.",
    "websiteUrl": "https://eces.org.eg",
    "email": "eces@eces.org.eg",
    "phone": "+20 2 2461 9037",
    "facebookUrl": "https://www.facebook.com/ECESEgypt",
    "address": "Nile City Towers, North Tower, 8th Floor, Corniche El Nil, Ramlet Boulak, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 111,
    "fieldId": [
      "Accelerators"
    ],
    "name": "ICRP Egypt & MENA",
    "description": "ICRP Egypt & MENA (International Center for Research & Production) is a market research and consulting firm based in Cairo.",
    "websiteUrl": "https://icrp-mena.com",
    "email": "info@icrp-mena.com",
    "phone": "+20 1015994407",
    "facebookUrl": "https://www.facebook.com/icrpmena",
    "address": "Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 112,
    "fieldId": [
      "Accelerators"
    ],
    "name": "CEFRS (Cairo University)",
    "description": "An independent research unit established in 1984 at Cairo University’s Faculty of Economics and Political Science. CEFRS conducts applied economic and financial studies to inform policy and support decision-makers.",
    "websiteUrl": "https://cu.edu.eg",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Faculty of Economics and Political Science, Cairo University, Giza, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 113,
    "fieldId": [
      "Accelerators"
    ],
    "name": "GISR Institution for Survey Research",
    "description": "GISR Institution for Survey Research is an independent survey research centre in Egypt devoted to gathering and analysing public opinions.",
    "websiteUrl": "https://gisr.org",
    "email": "info@gisr.org",
    "phone": "+20 1122131965",
    "facebookUrl": "https://www.facebook.com/GISRInstitution",
    "address": "35 El Hussein Street, Dokki, Giza, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 115,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Mentors",
    "description": "Mentors is a global business consulting group and entrepreneurial development firm founded in 2011 in the Netherlands, expanding to Egypt and the Middle East in 2018.",
    "websiteUrl": "https://mentorsis.com",
    "email": "info@mentorsis.com",
    "phone": "+20 1111793772",
    "facebookUrl": "https://www.facebook.com/mentorsis",
    "address": "622 Bavaria Tower, Ring Road, Maadi, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 116,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Digital Investors",
    "description": "Digital Investors is a Cairo-headquartered management consulting and venture services company founded in 2017, focusing on IT and business consulting to support startup growth and digital transformation.",
    "websiteUrl": "https://digitinv.com",
    "email": "info@digitinv.com",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/DigitalInvestorsInc",
    "address": "22 Kamal El Tawil Street, Zamalek, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 118,
    "fieldId": [
      "Accelerators"
    ],
    "name": "The Egyptian Entrepreneurship & Innovation Center (EEIC)",
    "description": "The Egyptian Entrepreneurship & Innovation Center (EEIC) is a government-established platform launched in 2023 under the Ministry of Planning and Economic Development to support entrepreneurship and innovation nationwide.",
    "websiteUrl": "https://eeic.gov.eg",
    "email": "support@eeic.gov.eg",
    "phone": "+20 10 123456789",
    "facebookUrl": "https://www.facebook.com/eeic.egypt",
    "address": "National Institute for Governance and Sustainable Development (NIGSD), Salah Salem Street, Heliopolis, Cairo, Egypt",
    "logoImageUrl": "images/egypt ent.png"
  },
  {
    "id": 119,
    "fieldId": [
      "Accelerators"
    ],
    "name": "WealthGrid",
    "description": "WealthGrid is a Cairo-based venture studio and credit-counselling service that positions itself as a “house of expertise”.",
    "websiteUrl": "https://wealth-grid.com",
    "email": "available4u@wealth-grid.com",
    "phone": "01005152822",
    "facebookUrl": "https://www.facebook.com/WealthGridVentureStudio",
    "address": "16 Batal Street, Cairo, Egypt",
    "logoImageUrl": "images/Wealth-Grid.png"
  },
  {
    "id": 122,
    "fieldId": [
      "Accelerators",
      "Incubators"
    ],
    "name": "IbtikarKhana",
    "description": "IbtikarKhana is the first local Egyptian social entrepreneurship school aimed at creating an inclusive community of proactive social entrepreneurs.",
    "websiteUrl": "https://ibtikarkhana.wordpress.com",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 123,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Creativa Innovation Hubs",
    "description": "Creativa Innovation Hubs are a national initiative launched by the Ministry of Communications and Information Technology (MCIT) to promote technology support standards for youth in Egypt.",
    "websiteUrl": "https://creativa.gov.eg",
    "email": "info@creativa.gov.eg",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/CreativaInnovationHubs",
    "address": "Various hubs across Egypt; central coordination via MCIT (Cairo, Egypt)",
    "logoImageUrl": "images/creativa.png"
  },
  {
    "id": 124,
    "fieldId": [
      "Accelerators",
      "Teach Advice",
      "Mentoring"
    ],
    "name": "Karakeeb Makerspace",
    "description": "Karakeeb Makerspace is a community-driven innovation and fabrication lab founded in Alexandria in 2013 to spread maker culture and STEM education.",
    "websiteUrl": "https://karakeeb.org",
    "email": "info@karakeeb.org",
    "phone": "+20 1096466219",
    "facebookUrl": "https://www.facebook.com/karakeebmakerspace",
    "address": "70 Tiba Street, Ibrahimiyya, Alexandria, Egypt",
    "logoImageUrl": "images/Karakeeb.png"
  },
  {
    "id": 125,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Forsa",
    "description": "Forsa (“Opportunity”) is an Egyptian government economic empowerment programme under the Ministry of Social Solidarity designed for working-age individuals, especially social protection beneficiaries and vulnerable groups.",
    "websiteUrl": "https://forsa.moss.gov.eg",
    "email": "info@moss.gov.eg",
    "phone": "16439",
    "facebookUrl": null,
    "address": "Forsa Program Management Unit, Ministry of Social Solidarity Headquarters, Administrative Capital, Cairo, Egypt",
    "logoImageUrl": "images/Forsa.png"
  },
  {
    "id": 126,
    "fieldId": [
      "Accelerators"
    ],
    "name": "Fekretak Sherketak",
    "description": "Fekretak Sherketak (“Your Idea, Your Company”) is a national entrepreneurship initiative launched in 2017 by the Egyptian Ministry of Investment and International Cooperation in partnership with the Ministry of Communications and private sector partners.",
    "websiteUrl": "https://falakstartups.com",
    "email": "info@falakstartups.com",
    "phone": "+20 2 2451 7051",
    "facebookUrl": "https://www.facebook.com/FekretakSherketak",
    "address": "Falak Startups Hub, The Greek Campus, Downtown Cairo, Egypt",
    "logoImageUrl": "images/Fekretak.png"
  },
  {
    "id": 128,
    "fieldId": [
      "Accelerators"
    ],
    "name": "MindShift MENA",
    "description": "MindShift MENA is an education technology and training company operating in Egypt and the MENA region, focused on entrepreneurship education and youth empowerment.",
    "websiteUrl": "https://mindshiftmena.com",
    "email": "info@mindshiftmena.com",
    "phone": "+20 1112345678",
    "facebookUrl": "https://www.facebook.com/mindshiftmena",
    "address": "Villa 5, Street 9, Maadi, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 129,
    "fieldId": [
      "Special Abilities"
    ],
    "name": "Kalmny Ishara",
    "description": "Online Arabic platform specializing in sign-language education/training and accessibility services providing educational & training services in various fields for people with disabilities, to achieve excellence & maximize all the outcomes of human assets by modern content, innovation, and the use of assistive technology.",
    "websiteUrl": "https://www.kalmnyishara.com",
    "email": "info@kalmnyishara.com",
    "phone": "+201020811511",
    "facebookUrl": "https://www.facebook.com/kalmnyIshara",
    "address": "Assiut Street, Sohag",
    "logoImageUrl": null
  },
  {
    "id": 130,
    "fieldId": [
      "Special Abilities"
    ],
    "name": "Goodwill Incubator (AAST Entrepreneurship Center)",
    "description": "An AAST Entrepreneurship Center program focused on supporting entrepreneurs with disabilities. It aims to build generations of young entrepreneurs and change agents who reshape the social & economic status of the Arab & African regions by enabling an environment of innovation, growth, support & mentorship for private businesses in AASTMT.",
    "websiteUrl": "https://ec.aast.edu/contenttemp.php?page_id=48200217&utm_source=chatgpt.com",
    "email": null,
    "phone": "19838",
    "facebookUrl": "https://www.facebook.com/profile.php?id=100066649772527",
    "address": null,
    "logoImageUrl": "images/AASTMT.png"
  },
  {
    "id": 132,
    "fieldId": [
      "Special Abilities"
    ],
    "name": "Etijah – Youth & Development Consultancy Institute",
    "description": "Egyptian development institute focusing on youth empowerment, training, and employability. It provides young individuals with the necessary skills and works on building the capacity of not only youth, but also governmental and non-governmental youth serving organizations.",
    "websiteUrl": "https://www.etijah.org",
    "email": "info@etijah.org",
    "phone": "+202 24 17 7 375",
    "facebookUrl": "https://etijah.org/about/",
    "address": "56 Nozha St., 1st Floor, Heliopolis, Cairo, Egypt",
    "logoImageUrl": "images/etijah.png"
  },
  {
    "id": 133,
    "fieldId": [
      "Special Abilities"
    ],
    "name": "Dameg",
    "description": "An innovative digital accessibility solutions provider dedicated to creating accessible solutions for any digital platform, our flagship product, Dameg the Accessibility Widget, transforms websites and applications into inclusive experiences for users of all abilities.",
    "websiteUrl": "https://www.dameg.net",
    "email": "info@dameg.net",
    "phone": "+201505432634",
    "facebookUrl": "https://www.facebook.com/damegplugin",
    "address": null,
    "logoImageUrl": null
  },
  {
    "id": 135,
    "fieldId": [
      "Incubators"
    ],
    "name": "GESR – Misr El-Kheir Foundation",
    "description": "Hardware/IoT-oriented incubator and innovation lab supporting social impact startups in fields of Water, Energy, Food, Health, Education, and AI/IoT. It is a program affiliated to Misr El-Kheir Foundation, showcasing its responsibility to contribute to a knowledge-based economy.",
    "websiteUrl": "https://www.gesr.net",
    "email": "gesr@misrelkheir.org",
    "phone": "+02-28452549",
    "facebookUrl": null,
    "address": "4 El Ahram Street, El Nafoura Square, Al Mokattam, Cairo, Egypt",
    "logoImageUrl": "images/Gesr-MEK.png"
  },
  {
    "id": 136,
    "fieldId": [
      "Incubators"
    ],
    "name": "MSME Egypt",
    "description": "Egypt’s national agency for MSME finance and support that will expand your business and reach more people with your services and consultations by registering as a service provider or consultant on the platform.",
    "websiteUrl": "https://www.msme.eg",
    "email": "serviceprovider@msme.eg",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/MSME.EGY",
    "address": "محي الدين أبو العز -امام نادي الصيد - الدقي – الجيزة 120",
    "logoImageUrl": "images/Medium-Small-and-Micro-Enterprises.png"
  },
  {
    "id": 137,
    "fieldId": [
      "Incubators"
    ],
    "name": "TechSpace (at Nile University / Innovation Hub / IECC)",
    "description": "University makerspace & innovation hub providing labs, coworking, and prototyping support. The first Technology Incubator specialized in Cognitive Technologies in Egypt, helping startups improve their product and business model and prepare them to scale worldwide.",
    "websiteUrl": "https://www.nu.edu.eg/innovation-hub",
    "email": null,
    "phone": "16453",
    "facebookUrl": "https://www.facebook.com/NileUniversity",
    "address": "Juhayna Square, 26th of July Corridor, El Sheikh Zayed, Giza, Egypt",
    "logoImageUrl": "images/Tech-Space.png"
  },
  {
    "id": 138,
    "fieldId": [
      "Incubators"
    ],
    "name": "MINT Incubator (by EG Bank)",
    "description": "Equity-free startup incubator powered by EGBANK. A platform by EGBANK dedicated to the young and curious – enabling them to access the world of banking, accelerate their business, and unleash their potential.",
    "websiteUrl": "https://www.mint-incubator.com",
    "email": "mint@eg-bank.com",
    "phone": "02 26733118",
    "facebookUrl": "https://www.facebook.com/MINTbyEGBANK/",
    "address": "15 Kasr Al Nile, Ismailia, Abdeen, Cairo Governorate 4272102",
    "logoImageUrl": "images/mint.png"
  },
  {
    "id": 139,
    "fieldId": [
      "Incubators"
    ],
    "name": "EdVentures (Nahdet Misr)",
    "description": "EdTech-focused VC, incubator & accelerator (Nahdet Misr). A corporate venture capital specialized in serving the fields of Education, Culture, and Innovative Learning Solutions.",
    "websiteUrl": "https://www.nmedventures.com",
    "email": "info@nmedventures.com",
    "phone": "+20 10 299 806 61",
    "facebookUrl": "https://www.nmedventures.com/about/",
    "address": "21 Ahmed Oraby Street, Mohandseen, Giza, Egypt",
    "logoImageUrl": "images/EdVentures.png"
  },
  {
    "id": 140,
    "fieldId": [
      "Incubators"
    ],
    "name": "Heliopolis University – Entrepreneurship Center for Social Impact (ECSI)",
    "description": "University center fostering sustainable entrepreneurship and social impact. It aims to be the engine for creating sustainable startups, that can create growing financial profits and social impact in both local and global markets.",
    "websiteUrl": "https://www.hu.edu.eg/ecsi/",
    "email": "admission@hu.edu.eg",
    "phone": "16418",
    "facebookUrl": "https://www.facebook.com/HU.ECSI",
    "address": "3 Belbeis – Cairo Desert Road, El Salam City, Cairo, with a postal code of 11785",
    "logoImageUrl": "images/newECSI.png"
  },
  {
    "id": 141,
    "fieldId": [
      "Incubators",
      "Business Angles"
    ],
    "name": "InstaDeel",
    "description": "A B2B marketplace that regulate the startups and SMEs scene, enables them to generate more leads, reach to aggregated industry offers, accelerate their businesses by reaching funds and incubation programs locally and globally.",
    "websiteUrl": "https://instadeel.com/",
    "email": "support@instadeel.com",
    "phone": "+201111317776",
    "facebookUrl": "https://www.facebook.com/InstaDeel#",
    "address": "Ring Rd, Maadi, Cairo Governorate Cairo, Cairo Governorate, Egypt 11728",
    "logoImageUrl": "images/InstaDeel.png"
  },
  {
    "id": 142,
    "fieldId": [
      "Incubators"
    ],
    "name": "Wealth-Grid Venture Studio",
    "description": "Venture studio building fintech/wealth-related startups. The leadership advisors to firms leaders, helping to solve their most challenging problems with confidence, positive outlook, and impact to rapidly operate at full power.",
    "websiteUrl": "https://wealth-grid.com/",
    "email": "available4u@wealth-grid.com",
    "phone": "01005152822",
    "facebookUrl": "https://www.facebook.com/WealthGrid",
    "address": "Linx Business Park BA. First Floor Office 108-109 Smart Village, 28k Cairo-Alex Desert Road, Egypt",
    "logoImageUrl": "images/Wealth-Grid.png"
  },
  {
    "id": 143,
    "fieldId": [
      "Incubators"
    ],
    "name": "CULTIV",
    "description": "A platform for supporting innovation through venture building, product design, VC, business support, networking and community building focusing on deep-tech. Early-stage investor/accelerator operating in MENA.",
    "websiteUrl": "https://cultiv.llc/",
    "email": "info@cultiv.llc",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/cultivllc",
    "address": "124 Othman Ibn Afan Street, Heliopolis, Cairo 11361, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 144,
    "fieldId": [
      "Incubators"
    ],
    "name": "Forsa Program – MoSS (Ministry of Social Solidarity)",
    "description": "Government economic-empowerment program providing jobs and productive-asset support to vulnerable households. It aims to empower and prepare people for entering the labor market and securing decent jobs. It also supports those capable of working to transition from dependence on aid to financial independence and self-reliance.",
    "websiteUrl": "https://forsa.moss.gov.eg/ladingpage",
    "email": "info@efinance.com.eg",
    "phone": "16439",
    "facebookUrl": null,
    "address": "A3-B82 Smart Village, KM 28 Cairo-Alexandria Desert Road, Giza, Egypt, Postal code: 363 01 03",
    "logoImageUrl": "images/Forsa.png"
  },
  {
    "id": 145,
    "fieldId": [
      "Incubators"
    ],
    "name": "Horus BDC (Business Development Center)",
    "description": "Business development/entrepreneurship support organization (Upper Egypt) by assisting companies in transforming their business into the most profitable enterprises and companies possible by providing them with the best legal and financial advice.",
    "websiteUrl": "http://www.horusbdc.com/",
    "email": "info@horusbdc.com",
    "phone": "01221544403",
    "facebookUrl": "https://www.facebook.com/horusbdceg/",
    "address": "5&6 Dyar Business Park El Mokattam Cairo , Cairo, Egypt, 4411310",
    "logoImageUrl": null
  },
  {
    "id": 146,
    "fieldId": [
      "Incubators"
    ],
    "name": "TWT – Tanmia Wa Tatweer (AAST)",
    "description": "Entrepreneurship & development initiative affiliated with AAST Entrepreneurship Center to establish, manage and operate successful innovation-driven businesses in 3 priority sectors: agribusiness, clean and green, and creative industries.",
    "websiteUrl": null,
    "email": "info.tanmiawatatweer@gmail.com",
    "phone": "19838",
    "facebookUrl": "https://www.facebook.com/TWTEgypt/",
    "address": null,
    "logoImageUrl": "images/Tanmia-Wa-Tatweer-TWT.png"
  },
  {
    "id": 147,
    "fieldId": [
      "Incubators"
    ],
    "name": "Dalil for Training and Development",
    "description": "Community development/training nonprofit presence in Upper Egypt. It seeks to build a strong social entrepreneurship sector that contributes to sustainable development by strengthening institutional capabilities and providing various services aimed at developing human capital within organizations.",
    "websiteUrl": null,
    "email": null,
    "phone": "+201018833839",
    "facebookUrl": "https://www.facebook.com/dalil.eg.Training.development/",
    "address": null,
    "logoImageUrl": null
  },
  {
    "id": 148,
    "fieldId": [
      "Incubators"
    ],
    "name": "Goodwill Incubator",
    "description": "AAST Entrepreneurship Center was established by The Arab Academy for Science, Technology & Maritime Transport, in 2015 with the main focus of empowering Arab youth to create a sustainable growing ecosystem in the Arab region & Africa.",
    "websiteUrl": "https://ec.aast.edu/contenttemp.php?page_id=48200217",
    "email": "aast.auth@aast.edu",
    "phone": "01116445412",
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": null
  },
  {
    "id": 149,
    "fieldId": [
      "Incubators"
    ],
    "name": "Rwaq Incubator",
    "description": "The aim of the incubator is to help innovators transform their ideas into a product that can be launched in the market, and to provide technical support.",
    "websiteUrl": "https://www.facebook.com/Rwaq.Business.Incubator/",
    "email": "rwaq.incubator@gmail.com",
    "phone": "01003913018",
    "facebookUrl": "https://www.facebook.com/Rwaq.Business.Incubator/",
    "address": null,
    "logoImageUrl": "images/rawaq.png"
  },
  {
    "id": 150,
    "fieldId": [
      "Incubators"
    ],
    "name": "Gemini Enterprises Africa",
    "description": "A leading Entrepreneur Support Organization (ESO) dedicated to empowering startups, MSMEs, and entrepreneurs across Egypt and Africa. In collaboration with strategic partners, they design and implement innovative development programs for underserved communities.",
    "websiteUrl": "https://geminiafrica.com/",
    "email": "info@gemini-africa.com",
    "phone": "+20 233059971",
    "facebookUrl": null,
    "address": "160 26th of July Corridor -Al Agouza, Giza, Egypt.",
    "logoImageUrl": "images/Gemini-Africa.png"
  },
  {
    "id": 153,
    "fieldId": [
      "Incubators"
    ],
    "name": "ESLSCA's Entrepreneurial Enterprises",
    "description": "ESLSCA's Entrepreneurial Enterprises - Ex3 is designed to enhance the university's entrepreneurial identity and inspire a captivating entrepreneurial spirit among ESLSCAians and beyond.",
    "websiteUrl": "https://eslsca.edu.eg/ex3/",
    "email": "admission@eslsca.edu.eg",
    "phone": "19298",
    "facebookUrl": null,
    "address": "Pyramids Heights, Building B06, Km 22 of Cairo – Alexandria Desert Road, Giza, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 154,
    "fieldId": [
      "Incubators",
      "Training"
    ],
    "name": "Masaar",
    "description": "Masaar is a group of lawyers and technologists interested in enhancing and promoting digital rights and related freedoms in Egypt. We focus on merging law and technology and deepening our understanding of their impact on human rights and fundamental freedoms.",
    "websiteUrl": "https://masaar.net/en/",
    "email": "Askmasaar@gmail.com",
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/masar.png"
  },
  {
    "id": 155,
    "fieldId": [
      "Incubators"
    ],
    "name": "Benha Uni Biotechnology Incubator",
    "description": "The Goals of Biotechnology Incubator: 1. Help in creating entrepreneurial innovative startups in biotechnology. 2. Help Researchers and Innovators to go to the market. 3. Being a regional hub for biotechnology. Vision: To create a vibrant and sustainable ecosystem on University campus for nurturing and enrichment of Creativity, Innovation and Entrepreneurship in Biotechnology fields.",
    "websiteUrl": "https://bbi.bu.edu.eg/Segment.php",
    "email": "info@bu.edu.eg",
    "phone": "0133231011",
    "facebookUrl": null,
    "address": "Fareed Nada Street, Benha, Qalubiya Governorate, Arab Republic of Egypt",
    "logoImageUrl": null
  },
  {
    "id": 156,
    "fieldId": [
      "Incubators"
    ],
    "name": "Ebda3 Incubator",
    "description": "Ebda3 Incubator is a specialized business in the Information and Communication Technology (ICT) field. Established in 2017 with the support of the Academy of Scientific Research and Technology, Ebda3 Incubator is a success story in supporting entrepreneurs and startups in Egypt.",
    "websiteUrl": "https://cit-fei.org/en/incubator-ebda3",
    "email": "cit@cit-fei.org",
    "phone": "20224031985",
    "facebookUrl": null,
    "address": "51 Abbas Elakkad, Nasr city - Membership Department:FEI , 2nd Floor, 1195 Nile Corniche, Boulak, Cairo, Egypt.",
    "logoImageUrl": null
  },
  {
    "id": 157,
    "fieldId": [
      "Incubators"
    ],
    "name": "StartEgypt - Flat6labs",
    "description": "StartEgypt provides a pre-acceleration incubation program, established to inspire and support millions of Egyptian entrepreneurs in the field of social impact enterprises.",
    "websiteUrl": "https://flat6labs.com/programs/",
    "email": "cairo@flat6labs.com",
    "phone": "20235685856",
    "facebookUrl": null,
    "address": "1 Dr. Mohamed Sobhy St., Flat 5 - Giza",
    "logoImageUrl": "images/StartEgypt.png"
  },
  {
    "id": 158,
    "fieldId": [
      "Incubators"
    ],
    "name": "Youth Incubator - AAST",
    "description": "Comprehensive Support Program. Young entrepreneurs, graduates & undergraduates, experience different challenges and are looking for special support that can fulfill their needs. Our Youth Incubator is dedicated to provide a comprehensive support package to all AAST students who are willing to start their own business.",
    "websiteUrl": "https://ec.aast.edu/contenttemp.php?page_id=48200092",
    "email": "aast.auth@aast.edu",
    "phone": "01116445412",
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/AASTMT.png"
  },
  {
    "id": 159,
    "fieldId": [
      "Incubators"
    ],
    "name": "Nubiavest",
    "description": "Nubiavest, \"an economic empowerment platform for women and youth,\" aims to connect investors and entrepreneurs in the development of the heritage creative industries sectors. Nubia is one of the sub-cultures of Egypt.",
    "websiteUrl": "https://www.linkedin.com/in/nubiavest-nif-3a4b93207/?originalSubdomain=eg",
    "email": "info@nubiavest.com",
    "phone": null,
    "facebookUrl": null,
    "address": "wadi karkar st.10, Aswan, Egypt, 11931",
    "logoImageUrl": "images/Nubiavest.png"
  },
  {
    "id": 160,
    "fieldId": [
      "Incubators"
    ],
    "name": "FEPS Business Invest",
    "description": "It’s an incubator association located in Cairo university. It also offers a business clinic for startups operating for more than two years in the market and provides a consultancy services for startups.",
    "websiteUrl": "https://fepsbi.net/",
    "email": "incubator@feps.edu.eg",
    "phone": "01062287018",
    "facebookUrl": null,
    "address": "FEPS Business Incubator, Faculty of Economics and Political Science, Cairo University, Giza.",
    "logoImageUrl": "images/FEPS.png"
  },
  {
    "id": 162,
    "fieldId": [
      "Incubators"
    ],
    "name": "EBNI",
    "description": "EiTESAL Business Nurturing Initiative (EBNI) is an incubation project initiated by Eitesal and other institutions, our main task is to boost startups in the field of ICTE, by giving them end to end support & Global footprint to start their ventures from scratch & take them into scale up.",
    "websiteUrl": "https://www.ebni.io/",
    "email": "info@ebni.io",
    "phone": "+201027111136",
    "facebookUrl": null,
    "address": "22 Desouk st. of El-Imam Ali Almazah, Heliopolis, Cairo Governorate, Egypt",
    "logoImageUrl": "images/EBNI Official Logo.png"
  },
  {
    "id": 163,
    "fieldId": [
      "Incubators"
    ],
    "name": "DMZ Cairo",
    "description": "DMZ Cairo's program is sector-agnostic and helps tech startups in various stages of growth accelerate their success. Founders can access one-on-one guidance from Program Leads and mentors, peer-to-peer sessions, expert-led workshops, networking opportunities, and more.",
    "websiteUrl": "https://www.facebook.com/DMZCairo/",
    "email": "dmzcairo@uofcanada.edu.eg",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/DMZCairo/",
    "address": null,
    "logoImageUrl": "images/DMZ-Cairo-Stack.png"
  },
  {
    "id": 164,
    "fieldId": [
      "Incubators"
    ],
    "name": "Startups of Alex",
    "description": "Investment Management. That's the power of the Startups Of Alex (SOA) incubation program, powered by icealex. Built upon decades of icealex's commitment to fostering innovation, we connect you with the sharpest minds in the industry.",
    "websiteUrl": "https://www.linkedin.com/showcase/startupsofafrica/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/SoA.png"
  },
  {
    "id": 165,
    "fieldId": [
      "Incubators"
    ],
    "name": "Nahdet El Mahrousa",
    "description": "Supporting enterprises and organizations in expanding their social impact. NM’s mission is to support social entrepreneurs to develop/build successful and scalable social enterprises by providing (i) an ecosystem enabling social innovation, (ii) incubation services, and (iii) seed funding.",
    "websiteUrl": "https://nahdetelmahrousa.org/",
    "email": "info@nahdetelmahrousa.org",
    "phone": "+201000336238",
    "facebookUrl": null,
    "address": "17 Kasr El Nil St, Downtown Cairo, Egypt",
    "logoImageUrl": "images/Nahdet-ElMahrousa.png"
  },
  {
    "id": 166,
    "fieldId": [
      "Incubators"
    ],
    "name": "Technological Incubator (Omran) at the Housing and Building National Research Center",
    "description": "Technological Incubator (Omran) at the Housing and Building National Research Center. The Technology Incubator (Omran) was established by Ministerial Resolution No. 803 of 2020 by the Minister of Housing, Utilities and Urban Communities.",
    "websiteUrl": "https://hbrc.edu.eg/en/scientific-activities-en/technology-incubator-omran",
    "email": "omran.incubator@hbrc.edu.eg",
    "phone": "37498823",
    "facebookUrl": null,
    "address": "The Housing and Building National Research Center - 87 Tahrir Street - Dokki - Giza",
    "logoImageUrl": null
  },
  {
    "id": 167,
    "fieldId": [
      "Incubators",
      "Training"
    ],
    "name": "Intilaq",
    "description": "IntilaQ is a business and innovation center building the capacities of young Tunisians by fostering innovation and encouraging entrepreneurship in the information and communication technologies sector. IntilaQ’s main mission is to help build an entrepreneurial ecosystem that fosters innovation and supports start-ups development.",
    "websiteUrl": "https://intilaq.tn",
    "email": "contact@intilaq.tn",
    "phone": "+216 71 85 84 10",
    "facebookUrl": null,
    "address": "Ariana ,Bloc E2 ,Technopole Elghazela",
    "logoImageUrl": "images/intilac.png"
  },
  {
    "id": 168,
    "fieldId": [
      "Policy"
    ],
    "name": "ERRADA",
    "description": "The Egyptian regulatory reform and development activity is a national initiative launched in 2008 to overhaul Egypt's legislative and regulatory framework. Its primary goals include enhancing policymaking, stimulating businesses, encouraging investment, and fostering dialogue between the government and businesses.",
    "websiteUrl": null,
    "email": "info@errada.gov.eg",
    "phone": "+20224070769",
    "facebookUrl": null,
    "address": "38H8+VGJ, Salah Salem St, Ash Sharekat, Nasr City, Cairo Governorate 4451046",
    "logoImageUrl": null
  },
  {
    "id": 169,
    "fieldId": [
      "Policy",
      "Training"
    ],
    "name": "NTRA",
    "description": "National Telecommunication Regulatory Authority, established in 2003, to regulate the telecommunication sector in Egypt, Key responsibilities include Policy and licensing, ensuring quality and fair access to telecom services at reasonable prices, while preventing anti‑competitive behavior, Research and development, Frequency spectrum management, Equipment certification, Numbering regulation.",
    "websiteUrl": null,
    "email": null,
    "phone": "+20235344000",
    "facebookUrl": null,
    "address": "Building 4, SV",
    "logoImageUrl": "images/NTRA.png"
  },
  {
    "id": 170,
    "fieldId": [
      "Policy"
    ],
    "name": "ILUJIS",
    "description": "Government relation services & legal Solutions, to your firm doors in A. R. E, ILUJIS is a full-spectrum government relations services and government consultancy company. they provide expert advice, innovative resources, and timely solutions, such as business operating licenses for our clients, building and zoning permits and all-around immigration services.",
    "websiteUrl": null,
    "email": "hello@ilujis.com",
    "phone": "+202-20299755",
    "facebookUrl": null,
    "address": "Building 1 Area 127B, Rehab 2, New Cairo",
    "logoImageUrl": null
  },
  {
    "id": 171,
    "fieldId": [
      "Policy"
    ],
    "name": "EEIC",
    "description": "Egypt Entrepreneurship and Innovation Center, The center was established in June 2023 with the aim of supporting entrepreneurship and innovation and supporting the transformation of the knowledge economy by empowering Egyptian youth to transform their innovative ideas into startups integrated into global value chains.",
    "websiteUrl": null,
    "email": "support@eeic.gov.eg",
    "phone": "010123456789",
    "facebookUrl": null,
    "address": "National Institute for Governance and Compliance - Salah Salem Street -Heliopolis - Cairo – Egypt",
    "logoImageUrl": "images/egypt ent.png"
  },
  {
    "id": 172,
    "fieldId": [
      "Policy"
    ],
    "name": "Innovators Support Fund (IFS)",
    "description": "The Innovators Support Fund (ISF) was established by Law 1/2019, reporting to the Minister of Higher Education & Scientific Research. The ISF was created to discover, train, support and fund gifted individuals, entrepreneurs and innovators working in any field.",
    "websiteUrl": null,
    "email": null,
    "phone": "01015167094",
    "facebookUrl": null,
    "address": "193, 26th July ST, Agoza – Giza",
    "logoImageUrl": "images/ISF - Talent - Innovation.png"
  },
  {
    "id": 173,
    "fieldId": [
      "Policy"
    ],
    "name": "MSMEF",
    "description": "The Egyptian Federation for the Financing of Small, Medium and Micro Enterprises, which was established by Law No. 141 under the leadership of Dr. Mona Zulfiqar and the membership of 11 banks, 21 companies, and 995 financial associations and institutions.",
    "websiteUrl": null,
    "email": null,
    "phone": "01111922379",
    "facebookUrl": null,
    "address": "22 Mosaddak Street, Dokki",
    "logoImageUrl": "images/Medium-Small-and-Micro-Enterprises.png"
  },
  {
    "id": 174,
    "fieldId": [
      "Policy"
    ],
    "name": "MSME",
    "description": "The Small Projects Platform is a one-stop-shop that provides all the necessary information for establishing and licensing projects, and it offers easy financing programs for the establishment, implementation, and development of small and micro enterprises.",
    "websiteUrl": null,
    "email": "serviceprovider@msme.eg",
    "phone": null,
    "facebookUrl": null,
    "address": "120 Mohy ElDin Abu Elezz st. Dokki Giza",
    "logoImageUrl": "images/Medium-Small-and-Micro-Enterprises.png"
  },
  {
    "id": 175,
    "fieldId": [
      "Policy"
    ],
    "name": "ITIDA",
    "description": "ITIDA plays a pivotal function in developing the local IT industry. It has custom-tailored programs; policy advice and implementation; trade promotion in regional and global markets; and being a strategic advisor to domestic SMEs and multinational corporations contribute to a cross-country economic growth.",
    "websiteUrl": null,
    "email": null,
    "phone": "16248",
    "facebookUrl": null,
    "address": "B121, Cairo-Alex Desert Road, Smart Village, Giza.",
    "logoImageUrl": "images/itida.png"
  },
  {
    "id": 176,
    "fieldId": [
      "Policy"
    ],
    "name": "Ministry of Education",
    "description": "The Egyptian Ministry of Education plays a vital role in fostering skills development and supporting entrepreneurship among students and youth. Through its educational reforms and initiatives, the ministry emphasizes practical learning, vocational training, and the integration of entrepreneurship into school and university curricula.",
    "websiteUrl": null,
    "email": null,
    "phone": "19126",
    "facebookUrl": null,
    "address": "located in the new capital",
    "logoImageUrl": "images/Ministry-of-Education.png"
  },
  {
    "id": 177,
    "fieldId": [
      "Policy"
    ],
    "name": "The Ministry of Communication and information technology",
    "description": "The Ministry of Communications and Information Technology (MCIT) in Egypt plays a central role in advancing entrepreneurship through its commitment to digital transformation and innovation. By fostering a dynamic digital ecosystem, the ministry provides entrepreneurs and startups with access to modern infrastructure, incubation programs, and funding opportunities.",
    "websiteUrl": null,
    "email": null,
    "phone": "+202 35341300",
    "facebookUrl": null,
    "address": "New Administrative Capital Government District, Egypt. Building No.: 10B-L2M",
    "logoImageUrl": "images/ministryOfCommunication.png"
  },
  {
    "id": 178,
    "fieldId": [
      "Policy"
    ],
    "name": "Ministry of Trade & Industry",
    "description": "The Ministry of Trade and Industry in Egypt plays a key role in supporting entrepreneurship by creating an enabling environment for industrial growth, innovation, and private sector development. It works to enhance the competitiveness of Egyptian products and industries, while also fostering small and medium-sized enterprises (SMEs) as engines of economic growth and job creation.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "New Administrative Capital Government District, Egypt.",
    "logoImageUrl": "images/Ministry-of-Trade-and-Industry.png"
  },
  {
    "id": 180,
    "fieldId": [
      "Policy"
    ],
    "name": "Arab Rally for Entrepreneurship & Innovation",
    "description": "The Arab Rally for Entrepreneurship & Innovation is one of the largest and most impactful startup competitions in the Arab region. It was launched in 2016 by the Arab Academy for Science, Technology, and Maritime Transport (AASTMT) through its Entrepreneurship Center, in collaboration with major regional and international partners.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Arab Academy for Science, Technology, and Maritime Transport – Graduate Studies Building P.O. Box 2033 – Elhorria – El Moshir Ismail st. – behind Sheraton Buildings.",
    "logoImageUrl": null
  },
  {
    "id": 181,
    "fieldId": [
      "Policy",
      "Events",
      "Training",
      "Competitions"
    ],
    "name": "Super Fny",
    "description": "Super Fny is an Egyptian edtech platform and vocational training initiative designed to empower youth and professionals with technical and entrepreneurial skills. It was founded in January 2016 and operates across multiple Egyptian cities including Alexandria, Cairo, Port Said, and Aswan.",
    "websiteUrl": null,
    "email": null,
    "phone": "+201032244569",
    "facebookUrl": null,
    "address": "3 Siraj Mounir Street, off Sultan Hussein Street Raml Station, Alexandria Governorate, Egypt",
    "logoImageUrl": "images/Super fny.png"
  },
  {
    "id": 182,
    "fieldId": [
      "Policy",
      "Events",
      "Competitions"
    ],
    "name": "Fanni Mobtaker",
    "description": "Fanni Mobtaker is an annual competition that was launched in 2018. It is the first competition in entrepreneurship and innovation dedicated to students of technical education. The competition is held in cooperation with the Egypt Workforce Project funded by the United States Agency for International Development in Egypt (USAID Egypt), and in cooperation with the Ministry of Education and Technical Education, the Academy of Scientific Research and Technology, the Borg El Arab Creativity Complex, and is organized by Cultiv and Idea Space.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/fannilogo.7ff7c7f8.png"
  },
  {
    "id": 183,
    "fieldId": [
      "Policy"
    ],
    "name": "IbTIECAR",
    "description": "IbTIECar is TIEC’s graduation projects competition launched yearly in cooperation with different multinational corporations and MCIT’s affiliated organizations. Targeting undergraduates of ICT universities in their final year [senior students], IbTIECar recognizes this year’s outstanding graduation projects.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": null
  },
  {
    "id": 184,
    "fieldId": [
      "Policy",
      "Seed",
      "Events",
      "Competitions"
    ],
    "name": "Seedstars",
    "description": "Seedstars is a global organization focused on empowering entrepreneurs in emerging markets. Their work spans Startup acceleration and investment, Capacity building and training, Ecosystem development and research, and Event execution and community engagement.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/seedstars_blue.fcbd2a36c116.png"
  },
  {
    "id": 185,
    "fieldId": [
      "Policy"
    ],
    "name": "Hult Prize",
    "description": "The Hult Prize is a global student competition that challenges university teams to solve pressing social issues through innovative startups. Each year, the winning team receives $1 million USD in seed funding to launch their idea.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/Hult-Prize.png"
  },
  {
    "id": 186,
    "fieldId": [
      "Policy"
    ],
    "name": "Arab IOT & AI",
    "description": "It is a nationwide innovation program that empowers students and startups to develop solutions using Internet of Things (IoT) and Artificial Intelligence (AI). It’s one of the most dynamic tech competitions in Egypt. Founded in 2016 by Intel Corporation and TIEC (Technology Innovation and Entrepreneurship Center).",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/arablot.png"
  },
  {
    "id": 188,
    "fieldId": [
      "Policy"
    ],
    "name": "GENEgypt",
    "description": "The Egyptian affiliate of the Global Entrepreneurship Network (GEN), a worldwide platform that supports entrepreneurship through programs, competitions, and ecosystem-building initiatives. Its mission is to inspire and empower young Egyptians to turn ideas into successful ventures.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/GEN-Egypt.png"
  },
  {
    "id": 189,
    "fieldId": [
      "Policy"
    ],
    "name": "Creativa",
    "description": "Egypt’s Creativa competitions are part of a dynamic national effort to foster innovation, entrepreneurship, and digital transformation across the country. Organized by the Technology Innovation and Entrepreneurship Center (TIEC), this is a flagship series of local competitions held across Egypt’s Creativa Innovation Hubs.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/creativa.png"
  },
  {
    "id": 190,
    "fieldId": [
      "Policy"
    ],
    "name": "NASA Space Apps Cairo",
    "description": "NASA Space Apps Cairo is the local edition of the annual NASA International Space Apps Challenge, a global 48-hour hackathon where developers, scientists, designers, and creatives come together to solve real-world challenges using NASA’s open data. It serves as a catalyst that equips aspiring entrepreneurs with skills, networks, and visibility to potentially launch startups or innovative projects.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "The American University in Cairo (AUC), New Cairo campus",
    "logoImageUrl": "images/NASA Space Apps (Cairo Chapter).png"
  },
  {
    "id": 191,
    "fieldId": [
      "Preseed"
    ],
    "name": "Wealth Grid",
    "description": "WealthGrid Venture Studio defines themselves as “We are the leadership advisors for startups, and creating ours as well”. WealthGrid is one of the few venture studios operating in Egypt. Based in Cairo and founded in 2022, it focuses on building and investing in startups from the ground up, often at the pre-seed stage.",
    "websiteUrl": "http://www.wealth-grid.com",
    "email": "mohamed.hisham@wealth-grid.com",
    "phone": "+201005152822",
    "facebookUrl": null,
    "address": "First Floor Office 108-109 Smart Village, Giza, Egypt.",
    "logoImageUrl": "images/Wealth-Grid.png"
  },
  {
    "id": 192,
    "fieldId": [
      "Preseed",
      "Seed"
    ],
    "name": "Tanmia Wa Tatweer - TWT",
    "description": "Tanmia Wa Tatweer (TWT) is a standout initiative in Egypt’s pre-seed funding and incubation ecosystem, especially for underserved regions and sectors. The project is implemented by the Academy of Scientific Research and Technology (ASRT) in partnership with other organizations like the Arab Academy for Science, Technology & Maritime Transport (AASTMT).",
    "websiteUrl": null,
    "email": "info.tanmiawatatweer@gmail.com",
    "phone": "+2035520612",
    "facebookUrl": "https://www.facebook.com/AAST-Entrepreneurship-Center-200175893647691/?hc_location=ufi",
    "address": "Can be reached from ASRT or AAST.",
    "logoImageUrl": "images/Tanmia-Wa-Tatweer-TWT.png"
  },
  {
    "id": 193,
    "fieldId": [
      "Preseed"
    ],
    "name": "ASU Eng iHub",
    "description": "iHub short for the Innovation and Entrepreneurship Hub at Ain Shams University. It is a key player in Egypt’s pre-seed support ecosystem, especially within academia-driven innovation. It supports MVP development, business modeling, and pitch readiness.",
    "websiteUrl": null,
    "email": "info@ihub.asu.edu.eg",
    "phone": "+2012345678901",
    "facebookUrl": null,
    "address": "Credit Building, Office 934, 3rd Floor, Ahmed Fouad Abd Al Aziz Al Sarayat Sabekaa, As Sarayat, El Weili, Cairo Governorate",
    "logoImageUrl": "images/i-hub.png"
  },
  {
    "id": 194,
    "fieldId": [
      "Preseed",
      "Teach Advice",
      "Grants"
    ],
    "name": "Information Technology Industry Development Agency (ITIDA)",
    "description": "Established in 2004 under Law No. 15, ITIDA is a governmental entity under the Ministry of Communications and Information Technology. Its mission is to develop Egypt’s ICT industry, boost global competitiveness, and attract foreign investment.",
    "websiteUrl": "https://itida.gov.eg/English/Pages/default.aspx",
    "email": null,
    "phone": "16248",
    "facebookUrl": "https://www.facebook.com/itidaegypt",
    "address": "B121, Smart Village, Giza, Egypt",
    "logoImageUrl": "images/itida.png"
  },
  {
    "id": 195,
    "fieldId": [
      "Preseed"
    ],
    "name": "Innovators Support Fund: ISF",
    "description": "The Innovators Support Fund (ISF) was officially founded in 2019, however, the idea was first proposed in 2017 during Egypt’s Science Day celebration, when President Abdel Fattah El-Sisi recommended establishing a fund to support young innovators and gifted individuals.",
    "websiteUrl": null,
    "email": "info@isf.org.eg",
    "phone": "+201015167094",
    "facebookUrl": null,
    "address": "101 Al Qasr El Einy street, 8th floor, Ministry of Higher Education and Scientific Research.",
    "logoImageUrl": "images/ISF - Talent - Innovation.png"
  },
  {
    "id": 199,
    "fieldId": [
      "Seed"
    ],
    "name": "INJAZ EGYPT",
    "description": "INJAZ Egypt is a powerhouse in youth empowerment and entrepreneurial education, and it complements the strategic interests in ecosystem development, innovation, and societal impact. It aims to help empower a generation of young Egyptians to own their economic success.",
    "websiteUrl": null,
    "email": "hr@injaz-egypt.org",
    "phone": "+20225284205",
    "facebookUrl": "https://www.facebook.com/InjazEgypt/",
    "address": "El-Shaikh Rihan, El-Shaikh Abd Allah, Abdeen, Cairo Governorate",
    "logoImageUrl": "images/INJAZ-EGYPT.png"
  },
  {
    "id": 202,
    "fieldId": [
      "Business Angles",
      "Marketing"
    ],
    "name": "Alexandria Angles Network",
    "description": "Alex Angels, also known as the Alexandria Angels Network, is a cornerstone of Egypt’s early-stage investment ecosystem, especially outside Cairo. Founded in 2016 by entrepreneur Tarek El-Kady, the network was created to decentralize startup funding and empower innovation beyond Cairo.",
    "websiteUrl": "https://www.alexandriaangels.com/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Alexandria, Egypt",
    "logoImageUrl": "images/Alex-Angles.png"
  },
  {
    "id": 204,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Fundrs.VC",
    "description": "Funders.VC is an emerging venture capital firm that’s gaining traction across MENA and Africa, particularly in the seed and early-stage funding space. Fundrs.VC is a comprehensive fundraising platform designed for startup founders.",
    "websiteUrl": null,
    "email": "projects@funders.vc",
    "phone": "+13025202404",
    "facebookUrl": null,
    "address": "651 N Broad St., Ste 201, Middletown, DE 19709, USA.",
    "logoImageUrl": null
  },
  {
    "id": 205,
    "fieldId": [
      "Business Angles"
    ],
    "name": "AUC Angels",
    "description": "AUC Angels was founded by The American University in Cairo (AUC), through its Onsi Sawiris School of Business and in partnership with AUC Venture Lab. AUC Angels holds the distinction of being the first university-based angel investor network in the MENA region, launched by the American University in Cairo in partnership with AUC Venture Lab.",
    "websiteUrl": null,
    "email": "vlab@aucegypt.edu",
    "phone": "+20226153295",
    "facebookUrl": "https://www.facebook.com/aucventurelab/",
    "address": "The American University in Cairo Onsi Sawiris School of Business AUC Avenue, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 206,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Kamelizer",
    "description": "Kamelizer is an Egyptian angel startup studio providing services, expertise, and more to technology startups. We support founders in shaping their ideas to transform their startup from seed stage to series A stage.",
    "websiteUrl": null,
    "email": "hello@kamelizer.com",
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/Kamilizer.png"
  },
  {
    "id": 207,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Egyptian Business Angels Network - EGYBAN",
    "description": "The Egyptian Business Angels Network (EGYBAN) is a network that connects angel investors with early-stage startups in Egypt. EGYBAN aims to foster entrepreneurship by providing funding, mentorship, and strategic guidance to startups.",
    "websiteUrl": null,
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/egyptban.png"
  },
  {
    "id": 208,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Acasia Group",
    "description": "The Cairo Angels—now rebranded as Acasia Group—was originally founded in 2011, making it Egypt’s first formal angel investment network. It played a pioneering role in supporting early-stage startups across Egypt and the broader MENA region. With a mission to empower entrepreneurs through capital, mentorship, and strategic guidance, the network quickly became a cornerstone of Egypt’s innovation ecosystem.",
    "websiteUrl": "https://acasia.group/contact-us/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Consoleya, 5 El-Fadl, Bab Al Louq, Abdeen, Cairo, Egypt.",
    "logoImageUrl": null
  },
  {
    "id": 209,
    "fieldId": [
      "Hiring"
    ],
    "name": "Business Web",
    "description": "Business Web offers business brokerage and B2B marketing services to SMEs.",
    "websiteUrl": "https://businessweb-eg.com/",
    "email": "info@businessweb-eg.com",
    "phone": "1222733745",
    "facebookUrl": "https://www.facebook.com/Businesswebeg/",
    "address": "24 El Shaheed Mostafa Riad St Nasr City, Cairo, Egypt",
    "logoImageUrl": "images/Business.png"
  },
  {
    "id": 210,
    "fieldId": [
      "Hiring"
    ],
    "name": "Passion Point",
    "description": "Passion Point offers workshops, community events, or training services.",
    "websiteUrl": "https://www.passionpoint.co/",
    "email": "contact@passionpoint.co",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/ThePassionPoint/",
    "address": "6 Square 1160, Cairo, Sheraton Heliopolis 11361, EG",
    "logoImageUrl": "images/passion point.png"
  },
  {
    "id": 211,
    "fieldId": [
      "Hiring"
    ],
    "name": "Farinas - Marketing Services",
    "description": "Farinas provides digital marketing services to startups and small businesses.",
    "websiteUrl": "https://farinasmarketing.com",
    "email": "info@farinasmarketing.com",
    "phone": "012 27178174",
    "facebookUrl": "https://www.facebook.com/Farinasmarketing/",
    "address": "Mokattam, Egypt",
    "logoImageUrl": "images/cropped-Farinas-Logo-1-25.png"
  },
  {
    "id": 212,
    "fieldId": [
      "Hiring"
    ],
    "name": "Niche Magazine",
    "description": null,
    "websiteUrl": "https://ksa.nichemagazine.me",
    "email": "info@nichemagazine.me",
    "phone": "012 07269700",
    "facebookUrl": "https://www.facebook.com/NicheMagazineEgy/",
    "address": null,
    "logoImageUrl": "images/niche.png"
  },
  {
    "id": 213,
    "fieldId": [
      "Hiring"
    ],
    "name": "Zeeny Design House",
    "description": "Zeeny Studio is an advertising and marketing company that specializes in brand identity design.",
    "websiteUrl": "https://zeeny.net",
    "email": "welcome@zeeny.net",
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/zeeny.png"
  },
  {
    "id": 214,
    "fieldId": [
      "Hiring"
    ],
    "name": "Brainy Squad",
    "description": "Brainy Squad is a creative one-stop-shop for digital and creative needs.",
    "websiteUrl": "https://brainysquad.com",
    "email": "info@brainysquad.com",
    "phone": "010 94008375",
    "facebookUrl": null,
    "address": "6 AlGehad street, Lebanon Square, Mohendesin, Cairo, Egypt",
    "logoImageUrl": "images/brainy.png"
  },
  {
    "id": 215,
    "fieldId": [
      "Hiring"
    ],
    "name": "Startups Galaxy",
    "description": "Startups Galaxy matches startups with top growth experts and marketing technology tools to help them grow rapidly.",
    "websiteUrl": "https://startupsgalaxy.com",
    "email": "nono@startupsgalaxy.com",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/startupsgalaxy/",
    "address": null,
    "logoImageUrl": "images/startups.png"
  },
  {
    "id": 216,
    "fieldId": [
      "Hiring"
    ],
    "name": "مشاريع مصر جهاز تنمية المشروعات - Msme",
    "description": "Msme is a governmental organization that focuses on the development of small and medium-sized enterprises in Egypt.",
    "websiteUrl": "https://msmeda.org.eg",
    "email": "mailmaster@sfdegypt.org",
    "phone": "16733",
    "facebookUrl": "https://www.facebook.com/msmeda.eg/",
    "address": "ش محي الدين ابو العز/ الدقي 120, Cairo, Egypt",
    "logoImageUrl": "images/Medium-Small-and-Micro-Enterprises.png"
  },
  {
    "id": 218,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Career 180",
    "description": "Career 180 focuses on career development for youth and fresh graduates. They offer career coaching, online courses, and host Egypt’s largest youth employment fair. It is perfect for students and fresh grads looking for guidance, mentorship, and entry-level opportunities.",
    "websiteUrl": "https://career-180.com",
    "email": "info@career180.com",
    "phone": "+20 106 508 8512",
    "facebookUrl": "https://www.facebook.com/Career180.net/",
    "address": "Primarily based in Cairo",
    "logoImageUrl": null
  },
  {
    "id": 219,
    "fieldId": [
      "Marketing"
    ],
    "name": "Hired HR",
    "description": "Hired HR specializes in recruitment and personality-based hiring. They help companies find culturally aligned talent, making it great for companies seeking fast, personality-matched hires.",
    "websiteUrl": "https://www.hiredhr.net",
    "email": "business@hiredhr.net",
    "phone": "+20 106 605 5858",
    "facebookUrl": "https://www.facebook.com/hiredrecruitment/",
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/hired.png"
  },
  {
    "id": 220,
    "fieldId": [
      "Marketing"
    ],
    "name": "Talents Arena",
    "description": "Talents Arena uses AI to match tech talent with companies. They also offer CTO-as-a-service and technical assessments, making them ideal for startups and tech firms needing vetted developers or fractional CTOs.",
    "websiteUrl": "https://talentsarena.net",
    "email": "info@talentsarena.net",
    "phone": "+20 100 440 6121",
    "facebookUrl": "https://www.facebook.com/TalentsArena/",
    "address": "Almostakbal 136a, El Sheikh Zayed, Giza, Egypt",
    "logoImageUrl": "images/talent.png"
  },
  {
    "id": 221,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Forasna",
    "description": "Forasna is Egypt’s leading platform for blue-collar and Arabic-speaking job seekers. It is part of the BasharSoft group (which also owns Wuzzuf) and is best for non-English speakers and vocational job seekers.",
    "websiteUrl": "https://forasna.com",
    "email": "feedback@forasna.com",
    "phone": "+20 2 2520 2330",
    "facebookUrl": "https://www.facebook.com/Forasna/",
    "address": "Maadi, Cairo, Egypt",
    "logoImageUrl": "images/forasna.png"
  },
  {
    "id": 222,
    "fieldId": [
      "Marketing"
    ],
    "name": "Jobzella",
    "description": "Jobzella is a career network offering job listings, training, and outsourcing services. It was acquired by Alkhaleej Training & Education Group and is great for networking, career events, and outsourcing solutions.",
    "websiteUrl": "https://www.jobzella.com",
    "email": null,
    "phone": "+20 10 2154 7700",
    "facebookUrl": "https://www.facebook.com/Jobzella/",
    "address": "The Greek Campus, Mall of Arabia, 6th of October City, Giza, Egypt",
    "logoImageUrl": "images/Jobzella.png"
  },
  {
    "id": 223,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Techiematter",
    "description": "Techiematter is a tech-focused recruitment platform that acts as an all-in-one hiring partner. It helps companies find, assess, interview, and onboard technical talent with ease and speed. They have an operational presence across Egypt, Saudi Arabia, and the U.S.",
    "websiteUrl": "https://www.techiematter.com/",
    "email": "info@techiematter.com",
    "phone": "+201023253409",
    "facebookUrl": "https://www.facebook.com/TechHiringArm/",
    "address": null,
    "logoImageUrl": "images/techiematter.png"
  },
  {
    "id": 224,
    "fieldId": [
      "Marketing"
    ],
    "name": "Bayt",
    "description": "Bayt is a prominent online recruitment and job search platform specifically designed for the MENA region. Launched in 2000 in Dubai, it has since expanded its operations across numerous countries including Egypt, Saudi Arabia, Kuwait, Jordan, and Lebanon. The platform also features AI-powered tools to modernize hiring.",
    "websiteUrl": "https://www.bayt.com",
    "email": "https://www.bayt.com/en/feedback/submit/",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/baytcom/",
    "address": null,
    "logoImageUrl": "images/bayt.png"
  },
  {
    "id": 225,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Job Master 4 Startups (J4S)",
    "description": "J4S is a people and culture management partner specializing in empowering startups for growth through a tailored HR engagement model. They provide a fully-fledged HR team and talent management services to identify unique needs and forge customized solutions that create a culture of success.",
    "websiteUrl": null,
    "email": "ask@jm4startups.com",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/profile.php?id=100090015716531&sk=about_contact_and_basic_info",
    "address": null,
    "logoImageUrl": null
  },
  {
    "id": 226,
    "fieldId": [
      "Marketing"
    ],
    "name": "Abdaa / ابداع",
    "description": "Abdaa is an AI-powered recruitment and job matching platform designed to streamline hiring processes for employers and simplify job searches for applicants. It offers features like Insta-Match, an integrated Applicant Tracking System (ATS), and head-hunting with refined filters.",
    "websiteUrl": "https://abdaa.net",
    "email": "contactus@abdaa.com",
    "phone": null,
    "facebookUrl": null,
    "address": "Building No. 11G/4 El-Laselky New Maadi, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 227,
    "fieldId": [
      "Marketing"
    ],
    "name": "Mattlob",
    "description": "Mattlob is a fintech-powered B2B2C 'Recruitment as a Service' (RaaS) marketplace and a leading hiring network in Upper Egypt. The platform enables efficient and reliable hiring by reducing time-to-hire and ensuring quality candidate matches. It was formerly known as Mini-Me and rebranded in 2021.",
    "websiteUrl": "https://mattlob.com/en/",
    "email": "info@mattlob.com",
    "phone": null,
    "facebookUrl": null,
    "address": "Qena, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 228,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "75BIT",
    "description": "A software development company that offers technical advice and implementation services for web and mobile applications. They help businesses translate their ideas into functional digital products.",
    "websiteUrl": "https://75bit.com/",
    "email": "hello@75bit.com",
    "phone": "1-206-886-0035",
    "facebookUrl": "https://www.facebook.com/75bit/about",
    "address": "Sharm El Sheikh, EG",
    "logoImageUrl": null
  },
  {
    "id": 229,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "SWATX",
    "description": "A software solutions company specializing in building products for startups. They provide technical advice and development services, acting as a technical partner to help non-technical founders build and launch their digital products.",
    "websiteUrl": "https://swatxsolutions.com/",
    "email": "info@swatx.co",
    "phone": "00201080703999",
    "facebookUrl": "https://www.facebook.com/swatxsolutions/",
    "address": null,
    "logoImageUrl": "images/swatax.png"
  },
  {
    "id": 230,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "PE Module",
    "description": "PE Module is a software development and technology consulting firm. Their primary benefit is providing businesses with the technical expertise and development services needed to build and implement digital solutions.",
    "websiteUrl": "https://www.pemodule.com/",
    "email": "sales@pemodule.com",
    "phone": "+20121243458",
    "facebookUrl": "https://www.facebook.com/pemodule.eg/",
    "address": "243 werash Al Shabab, Light Industrial Area, Beni Suef Governorate 62511, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 231,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "Alpharalph",
    "description": "Alpharalph is a multi-faceted business development and consultancy firm that helps businesses grow both locally and internationally. They offer export development, international trade services, business and technology consultancy, and digital transformation services.",
    "websiteUrl": "https://www.alpharalph.com/",
    "email": "info@alpharalph.com",
    "phone": "+20 100 121 2544",
    "facebookUrl": "https://www.facebook.com/Alpharalph/",
    "address": "Downtown, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 232,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "NASA Space Apps (Cairo Chapter)",
    "description": "An annual hackathon where participants receive mentorship and technical advice from experts to solve real-world challenges using NASA's open data. It's a platform for learning, collaboration, and innovation in space and earth sciences technology.",
    "websiteUrl": "https://2017.spaceappschallenge.org/locations/space-apps-cairo",
    "email": null,
    "phone": null,
    "facebookUrl": "https://www.facebook.com/spaceappscairo",
    "address": "B148, Smart Village - 28 Km by Cairo / Alexandria Desert, 6 October, Egypt",
    "logoImageUrl": "images/NASA Space Apps (Cairo Chapter).png"
  },
  {
    "id": 233,
    "fieldId": [
      "Teach Advice",
      "Grants",
      "Coworking/Marker Spaces"
    ],
    "name": "Technology Innovation & Entrepreneurship Center (TIEC)",
    "description": "TIEC, an integral part of ITIDA, drives innovation and entrepreneurship in Egypt's ICT. They aim to build a strong local IT industry and foster a knowledge-based economy by cultivating talent, promoting cutting-edge technology, and shaping the digital future.",
    "websiteUrl": "https://www.tiec.gov.eg/",
    "email": "tiec@tiec.gov.eg",
    "phone": "16248",
    "facebookUrl": "https://www.facebook.com/tiec.egypt/",
    "address": "Smart Village, Building (B5) Cairo Alexandria Desert Road, Giza, Cairo, Egypt",
    "logoImageUrl": "images/tiec.png"
  },
  {
    "id": 234,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "icealexandria",
    "description": "icealex is an innovation consultancy firm that has evolved to become a leading platform for sector-specific incubations. It acts as a community-driven technology innovation hub with a strong social and environmental commitment.",
    "websiteUrl": "https://icealex.com/",
    "email": "info@icealex.com",
    "phone": "010 12257535",
    "facebookUrl": "https://www.facebook.com/icealexHub/",
    "address": "19 Abd Al Moaty Al Khial, Al Azaritah WA Ash Shatebi, Bab Sharqi, Alexandria, Egypt",
    "logoImageUrl": "images/icealex.png"
  },
  {
    "id": 236,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "Growth Hack",
    "description": "Growth Hack Services is a professional entity that provides tools to enhance business and growth through business growth services, training, and web solutions. They offer a set of courses on topics like digital marketing, social media marketing, and web development.",
    "websiteUrl": null,
    "email": "hi@GrowthHackSe",
    "phone": "+1567 25 8 25 18",
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": null
  },
  {
    "id": 237,
    "fieldId": [
      "Teach Advice",
      "Coworking/Marker Spaces"
    ],
    "name": "Fab Lab Egypt",
    "description": "Fab Lab Egypt (a sub-brand of San3a Tech) is a member of the Fab Lab global network and a community makerspace and digital fabrication lab.",
    "websiteUrl": "https://fablabegypt.com",
    "email": "fablabegypt@san3atech.com",
    "phone": "010 80331705",
    "facebookUrl": "https://www.facebook.com/fablabegypt/",
    "address": "Villa 35 - 100 St. - Near Al Horia Square - Maadi , Cairo, Egypt",
    "logoImageUrl": "images/Fab-Lab.png"
  },
  {
    "id": 239,
    "fieldId": [
      "Business Angles"
    ],
    "name": "الجهاز القومي لتنظيم الاتصالات - مصر",
    "description": "The National Telecommunication Regulatory Authority of Egypt (NTRA) is a government agency responsible for regulating the telecommunications sector in Egypt.",
    "websiteUrl": "https://tra.gov.eg",
    "email": "info@tra.gov.eg",
    "phone": "010 15515155",
    "facebookUrl": null,
    "address": "Smart Village, Giza, Egypt",
    "logoImageUrl": "images/NTRA.png"
  },
  {
    "id": 240,
    "fieldId": [
      "Business Angles"
    ],
    "name": "Industrial council for technology & innovation centers. eg",
    "description": null,
    "websiteUrl": null,
    "email": "itic.mti.eg@gmail.com",
    "phone": null,
    "facebookUrl": null,
    "address": null,
    "logoImageUrl": "images/industrialc.png"
  },
  {
    "id": 241,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "OrbScope",
    "description": "OrbScope is a full software and marketing house established in 2013 based in Egypt and the MENA regions.",
    "websiteUrl": "https://orbscope.com",
    "email": "Info@OrbScope.com",
    "phone": "010 04516716",
    "facebookUrl": "https://www.facebook.com/orbscope/",
    "address": "38 Salah Eldeen St, behind Degla View Building Maadi Ring-Road, Cairo, Egypt",
    "logoImageUrl": "images/orbscope-logo-300x266.png"
  },
  {
    "id": 242,
    "fieldId": [
      "Teach Advice"
    ],
    "name": "مسار",
    "description": "مسار (Masar) is a program that aims to empower youth socially and economically.",
    "websiteUrl": null,
    "email": "info@enroot.org",
    "phone": null,
    "facebookUrl": null,
    "address": "Moqattam, Cairo, Egypt",
    "logoImageUrl": "images/masar.png"
  },
  {
    "id": 243,
    "fieldId": [
      "Business Online"
    ],
    "name": "The Board of Directors of the National Bank of Egypt",
    "description": "The National Bank of Egypt (NBE) is the first governmental bank in Egypt, established in 1898. It is the largest bank in Egypt and plays a significant role in the country's financial sector.",
    "websiteUrl": "https://www.nbe.com.eg/",
    "email": null,
    "phone": "19888",
    "facebookUrl": "https://www.facebook.com/NBE.Egypt/",
    "address": "24, Sherif St., Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 244,
    "fieldId": [
      "Business Online"
    ],
    "name": "Commercial International Bank - Egypt (CIB)",
    "description": "CIB is Egypt's largest private sector bank, offering a wide range of banking services to individuals, businesses, and institutions.",
    "websiteUrl": "https://www.cibeg.com/",
    "email": "contactus@cibeg.com",
    "phone": "+20223639400",
    "facebookUrl": "https://www.facebook.com/CIBeg/",
    "address": "16 Nile Tower, Corniche El Nil, Garden City, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 245,
    "fieldId": [
      "Business Online"
    ],
    "name": "Banque Misr",
    "description": "Banque Misr is one of the largest Egyptian banks, offering a comprehensive suite of banking and financial services.",
    "websiteUrl": "https://www.banquemisr.com/",
    "email": null,
    "phone": "19888",
    "facebookUrl": "https://www.facebook.com/BanqueMisrEG/",
    "address": "151 Mohamed Farid Street, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 246,
    "fieldId": [
      "Business Online"
    ],
    "name": "Alexandria Bank",
    "description": "Alexandria Bank is a leading Egyptian bank providing a wide array of banking products and services.",
    "websiteUrl": "https://www.alexbank.com/",
    "email": "contactus@alexbank.com",
    "phone": "+20235354100",
    "facebookUrl": "https://www.facebook.com/AlexBank.Egypt/",
    "address": "49, Kasr El Nil Street, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 247,
    "fieldId": [
      "Business Online"
    ],
    "name": "Fawry",
    "description": "Fawry is a leading electronic payment network in Egypt, offering a wide range of services including bill payments, mobile top-ups, and e-commerce solutions.",
    "websiteUrl": "https://www.fawry.com/",
    "email": "info@fawry.com",
    "phone": "0227797599",
    "facebookUrl": "https://www.facebook.com/Fawry.Egypt/",
    "address": "Building B1, Smart Village, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 248,
    "fieldId": [
      "Business Online"
    ],
    "name": "Valu",
    "description": "Valu is a leading digital payment solutions provider in Egypt, offering flexible payment plans and financing options.",
    "websiteUrl": "https://www.valu.com.eg/",
    "email": "info@valu.com.eg",
    "phone": "16672",
    "facebookUrl": "https://www.facebook.com/ValuEgypt/",
    "address": "254, South Academy Street, New Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 249,
    "fieldId": [
      "Business Online"
    ],
    "name": "Contact Cars",
    "description": "Contact Cars is a leading online platform for buying and selling used cars in Egypt, offering financing solutions through Contact Credit.",
    "websiteUrl": "https://www.contactcars.com/",
    "email": "info@contactcars.com",
    "phone": "16055",
    "facebookUrl": "https://www.facebook.com/ContactCarsEgypt/",
    "address": "138, Ramses Street, Downtown, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 250,
    "fieldId": [
      "Business Online"
    ],
    "name": "Contact Credit",
    "description": "Contact Credit is a financial services company providing installment loans for various purchases, including cars and home appliances.",
    "websiteUrl": "https://www.contactcredit.com.eg/",
    "email": "info@contactcredit.com.eg",
    "phone": "16055",
    "facebookUrl": "https://www.facebook.com/ContactCreditEG/",
    "address": "138, Ramses Street, Downtown, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 251,
    "fieldId": [
      "Business Online"
    ],
    "name": "MoneyFellows",
    "description": "MoneyFellows is a fintech company operating a digital lending platform, offering interest-free installment loans.",
    "websiteUrl": "https://www.moneyfellows.com/",
    "email": "info@moneyfellows.com",
    "phone": "16486",
    "facebookUrl": "https://www.facebook.com/MoneyFellows/",
    "address": "The Waterway, Ring Road, New Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 252,
    "fieldId": [
      "Business Online"
    ],
    "name": "Tamweel",
    "description": "Tamweel is a leading provider of microfinance solutions in Egypt, supporting small businesses and entrepreneurs.",
    "websiteUrl": "https://www.tamweel.com.eg/",
    "email": "info@tamweel.com.eg",
    "phone": "16844",
    "facebookUrl": "https://www.facebook.com/TamweelEG/",
    "address": "6, El Sarayat Street, Dokki, Giza, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 253,
    "fieldId": [
      "IP/TTOS & KTOS"
    ],
    "name": "Egyptian Patent Office (EGPO)",
    "description": "The Egyptian Patent Office, under the Academy of Scientific Research & Technology, is the official body responsible for issuing and managing patents and trademarks in Egypt. Its primary function is to help individuals and companies protect their intellectual property, including technological innovations, brand names, and unique processes.",
    "websiteUrl": "http://www.egypo.gov.eg/",
    "email": "patinfo@egypo.gov.eg",
    "phone": "(202) 279-21291 - (202) 279-21274",
    "facebookUrl": null,
    "address": "Egyptian Patent Office, Kasr Al Ainy st., Cairo, Egypt 101, P.O. Box 11516 Cairo",
    "logoImageUrl": "images/EGPO.png"
  },
  {
    "id": 254,
    "fieldId": [
      "IP/TTOS & KTOS"
    ],
    "name": "Furniture Technology Center",
    "description": "The Furniture Technology Center, located in the 10th of Ramadan City, is a training and technical center for the furniture industry. It provides technical expertise and industry knowledge, making it a valuable resource for furniture startups looking to enhance their technical know-how and project execution.",
    "websiteUrl": null,
    "email": null,
    "phone": "0554498591",
    "facebookUrl": "https://www.facebook.com/share/16Jh6HkahF/",
    "address": "10th of Ramadan Vocational Training Center, Egypt",
    "logoImageUrl": "images/Furniture-Technology-Centers.png"
  },
  {
    "id": 255,
    "fieldId": [
      "Science/Tecknology Parks"
    ],
    "name": "The GrEEK Campus",
    "description": "The GrEEK Campus is a major technology and innovation hub located in the heart of Cairo. It provides a dynamic co-working space, hosts a wide array of networking events, and serves as a central point for the local startup community. It is an ideal location for connecting with tech talent and potential business partners.",
    "websiteUrl": "https://www.thegreekcampus.com/",
    "email": "info@thegreekcampus.com",
    "phone": "0227952325",
    "facebookUrl": null,
    "address": "171 El Tahrir Street, Bab El Louq, Cairo, Egypt",
    "logoImageUrl": "images/The-Greek-Campus.png"
  },
  {
    "id": 256,
    "fieldId": [
      "R&D"
    ],
    "name": "National Telecom Regulatory Authority (NTRA)",
    "description": "The National Telecom Regulatory Authority (NTRA) is the governmental body in Egypt responsible for regulating the telecommunications sector. It oversees and ensures that all telecommunications services and platforms, including those with online payments and data handling, comply with national regulations and security standards.",
    "websiteUrl": "https://www.tra.gov.eg/ar/",
    "email": "info@tra.gov.eg",
    "phone": "35344000-202",
    "facebookUrl": "https://www.facebook.com/share/16n26mgsxu/",
    "address": "Headquarters: Building 4, km 28, Cairo-Alexandria Desert Road",
    "logoImageUrl": "images/NTRA.png"
  },
  {
    "id": 257,
    "fieldId": [
      "IP/TTOS & KTOS"
    ],
    "name": "Academy of Scientific Research & Technology (ASRT)",
    "description": "The Academy of Scientific Research & Technology (ASRT) is a prominent institution in Egypt dedicated to promoting scientific research and technological innovation. It offers various forms of support, including innovation grants, R&D funding, and opportunities to participate in technology-related competitions, helping to connect and empower the scientific and technological community.",
    "websiteUrl": "http://www.asrt.sci.eg/",
    "email": "asrt@asrt.sci.eg",
    "phone": "27921286 - 27921285",
    "facebookUrl": "https://www.facebook.com/share/1D1zt6MCv3/",
    "address": "101 Kasr Al-aini St, Cairo, Egypt, Postal Code 11516",
    "logoImageUrl": "images/ASRT.png"
  },
  {
    "id": 260,
    "fieldId": [
      "IP/TTOS & KTOS"
    ],
    "name": "Knowledge & Technology Alliances (KTA) – ASRT",
    "description": "Knowledge & Technology Alliances (KTA) is a program by the Academy of Scientific Research & Technology (ASRT) in Egypt. Its primary function is to bridge the gap between academia and industry. The program supports collaborative research and development (R&D) projects and facilitates technology transfer partnerships to help bring scientific innovations to the commercial market.",
    "websiteUrl": "http://www.asrt.sci.eg/program/kta/",
    "email": null,
    "phone": "+20 2 2792 1285",
    "facebookUrl": null,
    "address": "101 Kasr Al-Ainy St., Cairo, Egypt",
    "logoImageUrl": "images/Egypt-Knowledge-and-Technology-Alliances.png"
  },
  {
    "id": 261,
    "fieldId": [
      "IP/TTOS & KTOS"
    ],
    "name": "Integrated Technology Transfer Unit (ITTU)",
    "description": "The Integrated Technology Transfer Unit (ITTU) is a specialized unit, often associated with academic institutions like Assiut University, that focuses on intellectual property management and the commercialization of innovations. It acts as a crucial link between research and industry, helping to transfer and monetize technology, especially within the ICT sector, by assisting with intellectual property rights, licensing, and business spin-offs.",
    "websiteUrl": "www.ittu.gov.eg",
    "email": "info@ittu.gov.org",
    "phone": "+20 1555742941",
    "facebookUrl": "https://www.facebook.com/ITTUEgypt/about",
    "address": "Assiut University, El Fateh, Assiut Governorate 71111, Egypt",
    "logoImageUrl": "images/ITTU.png"
  },
  {
    "id": 262,
    "fieldId": [
      "Science/Tecknology Parks"
    ],
    "name": "Silicon Waha",
    "description": "Silicon Waha is a public-private partnership in Egypt dedicated to developing and managing technology parks in secondary cities. The company's goal is to decentralize the ICT sector by providing state-of-the-art infrastructure, office spaces, and a supportive ecosystem to attract investment, create jobs, and foster innovation in areas outside of major urban centers like Cairo and Alexandria. It operates in locations such as Borg Al Arab, Sadat City, New Assiut, and Beni Suef.",
    "websiteUrl": "www.siliconwaha.com",
    "email": "info@siliconwaha.com",
    "phone": "+202 3537 2515",
    "facebookUrl": "facebook.com/SiliconWaha",
    "address": "Operates in multiple technology parks across Egypt, including Borg Al Arab (Alexandria), Sadat City (Menoufia), New Assiut, and Beni Suef.",
    "logoImageUrl": "images/silicon-waha.png"
  },
  {
    "id": 263,
    "fieldId": [
      "IP/TTOS & KTOS"
    ],
    "name": "Egypt National Cleaner Production Center (ENCPC)",
    "description": "The Egypt National Cleaner Production Center (ENCPC), established in 2005, is a service provider for Egyptian industries. It focuses on promoting cleaner production, resource efficiency, and the transfer of green technologies. The center offers consulting services and technical assistance to help businesses, particularly those in the manufacturing and sustainability sectors, adopt more efficient and environmentally friendly practices.",
    "websiteUrl": "http://www.encpc.org",
    "email": null,
    "phone": "+20 2 23916154",
    "facebookUrl": null,
    "address": "27A Abdel Khaleq Tharwat St., Downtown, Cairo, Egypt",
    "logoImageUrl": "images/National-Cleaner-Production-Center.png"
  },
  {
    "id": 264,
    "fieldId": [
      "Science/Tecknology Parks"
    ],
    "name": "Maadi Technology Park",
    "description": "Maadi Technology Park is a prominent technology park and Egypt’s first specialized offshore outsourcing park. Developed through a public-private partnership, it provides a supportive ecosystem and state-of-the-art infrastructure for tech companies, particularly those in the ICT and outsourcing sectors. The park is designed to attract investments, foster innovation, and create job opportunities.",
    "websiteUrl": null,
    "email": null,
    "phone": "235341300",
    "facebookUrl": null,
    "address": "Ezbet Fahmi, El Basateen, Maadi, Cairo, 11435, Egypt",
    "logoImageUrl": "images/Maadi-Technology-Park.png"
  },
  {
    "id": 266,
    "fieldId": [
      "Private Equity"
    ],
    "name": "EGYPTIAN PRIVATE EQUITY AND VENTURE CAPITAL ASSOCIATION",
    "description": "The Egyptian Private Equity & Venture Capital Association (EPEA) is a non-profit association committed to supporting and developing the Private Equity and Venture Capital industry in Egypt and the surrounding region(s). Established in 2011 by leading experts and prominent corporate figures in Egypt’s PE and VS sectors. EPEA’s secret sauce it’s the only specialized, trusted bridge that connects investors, regulators, and entrepreneurs while shaping policy, building talent, and opening international doors for Egypt’s private capital industry.",
    "websiteUrl": "https://epea-eg.org/",
    "email": "executivedirector@epea-eg.org",
    "phone": "(+202) 22680944",
    "facebookUrl": null,
    "address": "22 Mohamed Saeed El Halawani Street, Orouba Road, Heliopolis, Cairo, Egypt.",
    "logoImageUrl": "images/EPEA.png"
  },
  {
    "id": 267,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "Vision Ventures",
    "description": "Vision Ventures is an early-stage venture capital firm based in Cairo, Egypt. They invest in strong founders that want to make a difference, focusing on startups in the Pre-Seed, Seed, and Series-A stages. They are generally viewed as founder friendly and are sector agnostic, seeking opportunities that add value to their portfolio companies and create meaningful synergies. Their secret sauce is their regional anchor backing, sector-agnostic but tech-first approach, founder-centric leadership, and regional reach with a local presence.",
    "websiteUrl": "https://visionvc.co/",
    "email": null,
    "phone": null,
    "facebookUrl": "https://www.facebook.com/VisionVCco/",
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/vision.png"
  },
  {
    "id": 268,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "INNOVENTURES",
    "description": "Innoventures' mission is to create value for investors and companies in Egypt, through investing in disruptive early-stage technology-based innovative companies, led by ambitious entrepreneurs. They enable innovation-driven startups and their 'secret sauce' is their Innovation Venture Management (Hands-On Model), Startup Reactor Accelerator, sector-agnostic approach, and their ability to bridge gaps in Egypt's startup ecosystem by fostering a strong community and increasing visibility.",
    "websiteUrl": "https://www.innoventures.me/",
    "email": "info@innoventures.me",
    "phone": "+20-2-2774-4374",
    "facebookUrl": null,
    "address": "124 Othman Ibn Afan Street Heliopolis, Cairo 11361, Egypt",
    "logoImageUrl": "images/innoventures.png"
  },
  {
    "id": 270,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "IDEAVELOPERS",
    "description": "Ideavelopers is a venture capital firm founded in 2004, that helps innovative startups become great companies. We are a subsidiary of EFG-Hermes Private Equity. The firm manages the Technology Development fund – a $50 million fund focused on early stage technology companies. To date, we have invested over $25 million in 17 companies operating inside and outside Egypt. Our mission is to invest, and support startups with great potential. We not only provide risk capital to our portfolio companies, but also support them with strategic advice and industry access.",
    "websiteUrl": "www.ideavelopers.com",
    "email": "info@ideavelopers.com",
    "phone": "+202 35356584 / 16900",
    "facebookUrl": null,
    "address": "5 Farid St, from El Thawra St., suite 4, Cairo, Egypt.",
    "logoImageUrl": "images/Ideavelopers.png"
  },
  {
    "id": 271,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "Openner Capital",
    "description": "Openner is a hands-on, early stage venture capital firm funding early-stage tech startups and emerging founders who have demonstrated 10x potential for growth and scale in the market. They fuel early-stage innovation by providing capital to promising early-stage startups and invest in impactful products that put technology first. Their 'secret sauce' is their dual role as a VC and venture builder, with a focus on nascent stages, cross-regional DNA (USA + MENA), and a hands-on, selective approach with future-oriented bets, notably in Web3.",
    "websiteUrl": "https://openner.vc/capital/",
    "email": "info@openner.vc",
    "phone": null,
    "facebookUrl": null,
    "address": "active operations in Egypt, notably via Qurious Labs (Web3 venture studio)",
    "logoImageUrl": "images/openner.png"
  },
  {
    "id": 272,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "Egypt Ventures",
    "description": "Egypt Ventures is a multi-stage investment vehicle focused on making a deep impact on the Egyptian economy and people by nurturing the Egyptian entrepreneurship ecosystem, contributing to a future knowledge economy, and creating job opportunities. Their 'secret sauce' is a mix of government-backed credibility, being an ecosystem builder, multi-stage flexibility, and a focus on both impact and commercial balance. They are present and accessible at the heart of innovation, acting as a catalyst for Egypt’s startup ecosystem.",
    "websiteUrl": "https://www.egyptventures.com/",
    "email": "info@egyptventures.com",
    "phone": "+20 23411223",
    "facebookUrl": null,
    "address": "The Greek Campus 28 Malaki St., Bob El Louk, Cairo.",
    "logoImageUrl": "images/egypt ven.png"
  },
  {
    "id": 273,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "HIM Angels",
    "description": "HIMangel is an angel network for Egypt based companies. It offers investments for early-stage startups across various sectors, including tech companies, manufacturing, and waste management. Additionally, it provides mentorship, early-stage business building, and cross-portfolio integration. HIM Angels combines founder-level credibility, a focus on early-stage 'smart money', cross-sector reach, and strategic mentorship to fill a critical gap in Egypt’s startup funding environment.",
    "websiteUrl": "https://www.himangel.com/",
    "email": "kismail@himangel.com",
    "phone": null,
    "facebookUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/himangle.png"
  },
  {
    "id": 274,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "CROWZE",
    "description": "CROWZE is a venture builder that builds and invests in high-potential integrated startups with a focus on impact. Since 2011, they have operated with a unique 'Tech Co-Founder' model, acting as the technology arm for new startups to build their MVP with a long-term commitment. They have a track record of success with ventures like Business Plan Creator, Dynamo, and SECTORS. Their 'secret sauce' is their full venture-building approach, expertise in emerging tech, regional footprint, and proven track record.",
    "websiteUrl": "https://crowze.com/index.php/en/",
    "email": "info@crowze.com",
    "phone": "+966 57 077 1170 / +20 (100) 500 1170",
    "facebookUrl": null,
    "address": "Crowze, Cairo, 22 Hesham Labib, Nasr City 11471, Egypt; Jeddah, 7284 Prince Sultan, Jeddah 23615, Saudi Arabia; Madinah, 1170 Ali Ibn Abi Talib, Medina 42316, Saudi Arabia",
    "logoImageUrl": "images/crowze.png"
  },
  {
    "id": 275,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "SAWARI VENTURES",
    "description": "Sawari Ventures is a venture capital firm based in Cairo, investing in knowledge and innovation-based technologies across North Africa. Their mission is to empower entrepreneurs in the region to create innovative solutions that will drive the region’s economies for years to come. They focus their investments on growth and early-stage startups across various industries, including consumer internet, fintech, edtech, healthtech, deeptech, and e-commerce. They also provide a small allocation to seed-stage investments and contribute to building the early-stage ecosystem through their investments in Flat6Labs.",
    "websiteUrl": "https://sawariventures.com/",
    "email": "info@sawariventures.com",
    "phone": null,
    "facebookUrl": null,
    "address": "1 Dr. Mohamed Sobhy, 4th Floor, Apartment 9 - Giza, Egypt.",
    "logoImageUrl": "images/Sawari-Ventures.png"
  },
  {
    "id": 276,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "Algebra Ventures",
    "description": "Algebra Ventures is a tech-focused venture capital firm that partners with bold and resilient founders building transformative companies in Egypt and across the African continent. They provide strategic guidance, access to co-investors, and talent development to support startups from seed stage to Series B. Their mission is to empower entrepreneurs to improve people's lives at scale by investing in high-growth companies with a unique value proposition. Their 'secret sauce' is leveraging their extensive network and experience to provide comprehensive growth platforms for startups, ensuring they have the strategic guidance and resources needed to succeed.",
    "websiteUrl": "https://www.algebraventures.com/",
    "email": "info@algebraventures.com",
    "phone": "+20 2 2735 5555",
    "facebookUrl": "https://www.facebook.com/AlgebraVentureso",
    "address": "4 Omarat Al-Yamani Street, Zamalek, Cairo, Egypt",
    "logoImageUrl": "images/Algebra-Ventures.png"
  },
  {
    "id": 278,
    "fieldId": [
      "Grants"
    ],
    "name": "National Telecommunications Regulatory Authority (NTRA)",
    "description": "The National Telecommunications Regulatory Authority (NTRA) is the regulatory body responsible for overseeing and regulating the telecommunications sector in Egypt. It provides regulatory oversight, policy development, and enforcement to ensure fair competition and the provision of high-quality telecommunications services. NTRA also offers incentives to investors through the Universal Service Fund to encourage the provision of services in underserved areas. Its mission is to promote the development of the telecommunications sector in Egypt, ensuring the availability of advanced and reliable services to all citizens.",
    "websiteUrl": "https://www.tra.gov.eg",
    "email": "info@tra.gov.eg",
    "phone": "+20 2 3534 1111",
    "facebookUrl": "https://www.facebook.com/NTRA.Egypt",
    "address": "Smart Village, Building B4, Cairo-Alex Desert Road, Giza, Egypt",
    "logoImageUrl": "images/NTRA.png"
  },
  {
    "id": 279,
    "fieldId": [
      "Grants"
    ],
    "name": "Gesr",
    "description": "GESR is a program affiliated with the Misr El Kheir Foundation, launched in 2013 to contribute to a knowledge-based economy. It supports innovators and technology startups that solve social challenges in sectors like Water, Energy, Food/Agribusiness, Health, Education, AI, and IoT. Gesr provides funding, mentorship, and strategic support to help these startups scale and succeed in the competitive market. The 'SR MEK Pre-Incubation Program' is a key offering that provides prototyping funds, technical support, training, and a co-working space to teams with innovative early-stage projects.",
    "websiteUrl": "https://gesr.net/",
    "email": "gesr@misrelkheir.org",
    "phone": "28452549 – 28452351",
    "facebookUrl": "https://www.facebook.com/Gesr",
    "address": "4 El Ahram Street, El Nafoura Square, Al Mokattam, Cairo, Egypt",
    "logoImageUrl": "images/Gesr-MEK.png"
  },
  {
    "id": 280,
    "fieldId": [
      "Grants"
    ],
    "name": "Academy of Scientific Research and Technology (AAST) Entrepreneurship Center",
    "description": "The Arab Academy for Science, Technology & Maritime Transport (AASTMT) is a regional educational organization. The AAST Entrepreneurship Center, established in 2015, empowers Arab youth to create a sustainable growing ecosystem in the Arab region and Africa. It offers a variety of programs and services to support startups, including incubators, accelerators, competitions, and student programs, providing funding, mentorship, and strategic support to help them scale and succeed in the competitive market. The center's mission is to build generations of young entrepreneurs who reshape the social and economic status of the Arab region and Africa.",
    "websiteUrl": "https://ec.aast.edu/",
    "email": null,
    "phone": "+20 3 5520 612",
    "facebookUrl": "https://www.facebook.com/AAST-Entrepreneurship-Center-200175893647691/",
    "address": "Smart Village, Building B121, Cairo-Alex Desert Road, Giza, Egypt",
    "logoImageUrl": "images/AASTMT.png"
  },
  {
    "id": 281,
    "fieldId": [
      "Grants"
    ],
    "name": "European Bank for Reconstruction and Development (EBRD)",
    "description": "The European Bank for Reconstruction and Development (EBRD) is an international financial institution that invests in projects to help build market economies and promote private and entrepreneurial initiatives in over 30 countries. The Bank focuses on supporting private sector development and providing project financing to companies and commercial banks. They began investing in Egypt in 2012 and officially became a recipient country in 2015.",
    "websiteUrl": "https://www.ebrd.com/egypt.html",
    "email": null,
    "phone": "+20 2 2322 5900 (Cairo) / +20 3 5419155 (Alexandria)",
    "facebookUrl": "https://www.facebook.com/ebrdhq",
    "address": "EBRD Cairo Resident Office: EGID Building, First Floor, Block 72, off Ninety Axis, 5th Settlement, New Cairo, Cairo, Egypt. EBRD Alexandria Resident Office: Regus offices, Kamarayet Roushdy building, Stanley - Corniche, Alexandria, Egypt",
    "logoImageUrl": "images/EBRD.png"
  },
  {
    "id": 283,
    "fieldId": [
      "Venture Capital"
    ],
    "name": "INVESTIA",
    "description": "Investia is an investment firm that started as a family office and has grown into a trusted partner for family holdings, corporates, and investors across Egypt. They provide a range of services from early venture capital investments to strategic advisory and structured financing. Their mission is to build tailored investment vehicles, empower growth-stage businesses, and support family enterprises. They operate with a 'Strategic Army' approach, focusing on SMEs and traditional sectors, with a cross-border reach and a long-term growth orientation.",
    "websiteUrl": "https://investiaco.com/",
    "email": "info@investiaco.com",
    "phone": "0220200205 – 0220200206",
    "facebookUrl": null,
    "address": "F8, First Floor, Business Center – Golf Kattameya Heights, New Cairo, Cairo, Egypt.",
    "logoImageUrl": "images/investia.png"
  },
  {
    "id": 284,
    "fieldId": [
      "Donors"
    ],
    "name": "Export Credit Guarantee Company of Egypt (EGE)",
    "description": "The Export Credit Guarantee Company of Egypt (EGE) was founded in 1992 to facilitate the development of Egypt's foreign trade and the private sector. The company, which is owned by the Egyptian government through the National Investment Bank, offers trade credit and investment insurance to protect exporters against non-payment risks and provide access to trade finance tools. As of November 2023, the EGE was being replaced by the newly established Egyptian Agency for Export and Investment Guarantee.",
    "websiteUrl": "https://www.ege-eg.com/",
    "email": "contactus@ege-eg.com",
    "phone": "+20 2 2263 6740",
    "facebookUrl": null,
    "address": "5 El Nasr Road, 4th Floor, Nasr City, Cairo",
    "logoImageUrl": "images/final-EGE-logo-.png"
  },
  {
    "id": 285,
    "fieldId": [
      "Donors",
      "Legal Information"
    ],
    "name": "CGC – Credit Guarantee Company (Daman)",
    "description": "The Credit Guarantee Company (CGC), also known as Daman, is a financial institution that provides guarantees to mitigate risk for banks and financial institutions when lending to small and medium-sized enterprises (SMEs). This helps to expand access to finance for a critical sector of the Egyptian economy. CGC is a powerful tool, particularly under initiatives from the Central Bank of Egypt, as it enables SMEs to secure bank financing. It has issued over EGP 181 billion in guarantees, serving over 226,000 beneficiaries and contributing significantly to Egypt’s GDP.",
    "websiteUrl": "https://cgcegypt.com",
    "email": "info@cgcegypt.com",
    "phone": "17001",
    "facebookUrl": "https://www.facebook.com/CGC.Egypt/",
    "address": "F17, B226, Smart Village, Cairo-Alex Desert Road, Giza",
    "logoImageUrl": "images/cgc.png"
  },
  {
    "id": 287,
    "fieldId": [
      "Legal Information"
    ],
    "name": "Proxy Law",
    "description": "Provides legal structuring for startups (company formation, registration, contracts). Offers IP protection (trademarks, copyrights, patents). Drafting and reviewing investment agreements, shareholders’ agreements, and MoUs. Helps with compliance and local regulatory frameworks (Egyptian corporate & labor law). Ensures startups are legally secure, which builds trust with investors and partners.",
    "websiteUrl": "https://proxy-law.com/",
    "email": null,
    "phone": "1011206843",
    "facebookUrl": "https://www.facebook.com/proxylaw9/",
    "address": "Alexandria, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 288,
    "fieldId": [
      "Legal Information"
    ],
    "name": "Hegazy",
    "description": "Specialized in cross-border transactions and foreign investment law. Helps startups seeking international partnerships, M&A, or expansion abroad. Offers legal counsel on fundraising rounds and negotiations with VCs/angel investors. Provides employment law and HR policy support. Bridges startups with international markets and investors while minimizing legal risks.",
    "websiteUrl": "https://www.hegazylaw.com/",
    "email": null,
    "phone": "+20 10 2913 3304",
    "facebookUrl": "https://www.facebook.com/hegazyandpartners/",
    "address": "1095 Nile Cornish St. Garden City, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 289,
    "fieldId": [
      "Legal Information"
    ],
    "name": "Rabie Law",
    "description": "Focused on corporate and commercial law for SMEs and startups. Provides legal audits to prepare for funding or scaling. Guides in contracts drafting, vendor agreements, and client agreements. Advises on regulatory compliance in financial, tech, and e-commerce industries. Equips startups with solid legal frameworks that make them “investment-ready.”",
    "websiteUrl": "https://rabie.law/",
    "email": null,
    "phone": null,
    "facebookUrl": null,
    "address": "Downtown, Cairo, Egypt 11567, EG",
    "logoImageUrl": null
  },
  {
    "id": 290,
    "fieldId": [
      "Legal Information"
    ],
    "name": "Mohamed Hossam Khedr",
    "description": "Provides entrepreneurship training, mentorship, and business strategy consulting. Offers personal branding and leadership coaching for founders. Organizes workshops, podcasts, and events for networking with investors and peers. Helps entrepreneurs with pitch preparation and growth mindset development. Strengthens the founder’s skills and improves business strategy to enhance success rates.",
    "websiteUrl": "https://ratteb.com/mohamed-hossam-khedr",
    "email": null,
    "phone": "01006680032",
    "facebookUrl": "https://www.facebook.com/khedrwbusiness/",
    "address": "New Cairo, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 291,
    "fieldId": [
      "Legal Information"
    ],
    "name": "GESR – Innovation & Social Entrepreneurship Incubator",
    "description": "Provides incubation programs for startups in social impact and technology. Offers funding opportunities, seed grants, and connections to investors. Access to workspace, labs, and technical mentorship. Builds a strong entrepreneurship ecosystem with NGOs, corporates, and universities. Helps early-stage startups turn ideas into marketable, socially impactful businesses with resources and funding.",
    "websiteUrl": "https://www.gesr.net/",
    "email": null,
    "phone": "28452549 – 28452351",
    "facebookUrl": null,
    "address": "4 El Ahram Street, El Nafoura Square, Al Mokattam, Cairo, Egypt.",
    "logoImageUrl": "images/Gesr-MEK.png"
  },
  {
    "id": 292,
    "fieldId": [
      "Accounting"
    ],
    "name": "Abdallah Shalash & Co.",
    "description": "Abdallah Shalash & Co.is an independent audit and accounting firm based in Cairo established since 1980, specialized in audit, tax and advisory services.The Firm is positioned to provide quality, cost-effective and value added services tailored to meet the specific needs of a diverse and successful client base.",
    "websiteUrl": "https://www.abdallahshalash.com/",
    "email": "info@abdallahshalash.com",
    "phone": "0111-1159237",
    "facebookUrl": "https://www.facebook.com/pages/Abdallah-Shalash-Co/265241930183397?sk=info",
    "address": "18 El Obour Buildings, Salah Salem Street, Cairo",
    "logoImageUrl": "images/abdullah.png"
  },
  {
    "id": 293,
    "fieldId": [
      "Accounting"
    ],
    "name": "VIRTUAL CFO",
    "description": "VIRTUAL CFO is a company that provides financial consulting services, particularly through its Virtual CFO model. This service offers businesses access to experienced financial professionals for a fraction of the cost of a full-time CFO. The company's mission is to empower startups and SMEs in Egypt by providing tailored financial solutions in bookkeeping, business planning, investment support, and tax compliance. They aim to be a trusted financial partner, fostering sustainable success and long-term growth for their clients.",
    "websiteUrl": null,
    "email": "info@vcfoconsulting.com",
    "phone": "+201225390594",
    "facebookUrl": "https://www.facebook.com/VCFOeg/",
    "address": "Park St. Mall, 17 El Bostan St., Sheikh Zayed City, 6th of October, Building 2A, Office 2207, Giza, Egypt",
    "logoImageUrl": "images/virtual-chief.png"
  },
  {
    "id": 295,
    "fieldId": [
      "Accounting",
      "Training"
    ],
    "name": "AXCELL BUSINESS SERVICES",
    "description": "AXCELL BUSINESS SERVICES offers business outsourcing services, including HR management and operational support, to help companies keep costs low.",
    "websiteUrl": "https://axcellservice.com/",
    "email": "INFO@EXCELLSERVICE.COM",
    "phone": "+201020104141",
    "facebookUrl": "https://www.facebook.com/share/197Ffj5LRy/",
    "address": "REGUS, PLOT31, EL SHEIKH ZAYED, 6TH OCTOBER, GIZA, EGYPT",
    "logoImageUrl": "images/axcell.png"
  },
  {
    "id": 296,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Flux Coworking Space",
    "description": "A co-working space that provides a proper environment for work, gathering art, culture, and entrepreneurship in one place. It is a community service with a high recommendation rate.",
    "websiteUrl": "http://fluxcoworking.space",
    "email": "admin@fluxcoworking.space",
    "phone": "01006269484",
    "facebookUrl": "https://www.facebook.com/fluxcoworking.space",
    "address": "696 El Horreya Road, Laurean - 7th floor above B.tech - Office 708, Alexandria, Egypt",
    "logoImageUrl": "images/flux-Connect-Coworking-Spaces.png"
  },
  {
    "id": 299,
    "fieldId": [
      "Culture"
    ],
    "name": "Techne Drifts",
    "description": "Techne Drifts are one-day events held across various cities in Egypt throughout the year. They aim to strengthen and empower entrepreneurs within the startup community by fostering collaboration, creativity, and resilience. The initiative provides opportunities for entrepreneurs to create economic value, establish startups, and contribute solutions to Egypt’s most urgent challenges.",
    "websiteUrl": null,
    "email": "info@gu.edu.eg",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/TechneDrifts/?_rdr",
    "address": null,
    "logoImageUrl": "images/Techne-Drifts.png"
  },
  {
    "id": 300,
    "fieldId": [
      "Culture",
      "Platforms"
    ],
    "name": "GEN Egypt",
    "description": "GEN Egypt is the national affiliate of the Global Entrepreneurship Network. It supports entrepreneurs at idea, early, and growth stages with training, mentorship programs, competitions, and networking events including conferences and summits. GEN Egypt strengthens the ecosystem by activating new entrepreneurs, supporting the development of existing startups, convening entrepreneurial networks, providing targeted training, and maintaining dialogue with government. With over 100K social media followers, GEN Egypt connects entrepreneurs, support organizations, and ecosystem enablers.",
    "websiteUrl": "https://www.genglobal.org/egypt",
    "email": null,
    "phone": null,
    "facebookUrl": "https://www.facebook.com/unleashingideas",
    "address": null,
    "logoImageUrl": "images/GEN-Egypt.png"
  },
  {
    "id": 301,
    "fieldId": [
      "Culture"
    ],
    "name": "RiseUp Summit",
    "description": "Since 2013, RiseUp Summit has been a leading platform for entrepreneurs, startups, investors, and change-makers across the MENA region. The summit hosts 25,000+ attendees, 250+ exhibiting startups, 100+ partners, and 350+ speakers annually. It brings together bold innovators to connect, learn, and showcase new ideas while pushing the boundaries of entrepreneurship and innovation.",
    "websiteUrl": "https://www.riseupsummit.com/",
    "email": "hello@riseup.co",
    "facebookUrl": "https://www.facebook.com/RiseUpSummit",
    "address": "107 GrEEk Campus, Youssef El Gendy St., Downtown, Cairo, Egypt",
    "logoImageUrl": "images/riseUp.png"
  },
  {
    "id": 302,
    "fieldId": [
      "Culture"
    ],
    "name": "iHub - Ain Shams University",
    "description": "The Innovation and Entrepreneurship Hub (iHub) at Ain Shams University, founded in 2013, is the first governmental university center for innovation, entrepreneurship, and employability in Egypt. Established with the support of the Central Bank of Egypt and in collaboration with 6th of October University, iHub provides MVP development, business modeling, and pitch readiness programs. The hub aims to create an enabling environment that empowers innovators and entrepreneurs through training, technical support, and consultations. iHub collaborates with TU Berlin and other EU institutions on Industry 4.0 projects, connects students with the job market, fosters a culture of innovation and entrepreneurship, and aspires to achieve regional leadership by building effective bridges between academic minds and industrial expertise, creating innovative solutions that generate tangible societal impact and align with the evolving demands of the labor market.",
    "websiteUrl": "http://asu.edu.eg/ihub/",
    "email": "ihub@eng.asu.edu.eg",
    "phone": "+2012345678901",
    "facebookUrl": "https://www.facebook.com/iHubASU/",
    "address": "Credit Building, Office 934, 3rd Floor, Ahmed Fouad Abd Al Aziz St., El Sarayat, El Weili, Cairo, Egypt",
    "logoImageUrl": "images/i-hub.png"
  },
  {
    "id": 303,
    "fieldId": [
      "Culture"
    ],
    "name": "Techne Summit",
    "description": "Techne is a leading platform supporting tech and tech-enabled startups across the Mediterranean region. Founded to connect innovative startups with strategic corporates and investors, Techne facilitates collaboration, partnerships, and growth opportunities. Its flagship event, Techne Summit, brings together thousands of entrepreneurs, investors, and industry leaders, featuring workshops, discussions, and networking to fuel innovation. The Summit has attracted over 45,000 attendees, 1,000 startups, and 200 investors from 70+ countries, spotlighting cutting-edge industries like FinTech, HealthTech, and Gaming. Techne aims to accelerate corporate innovation by bridging the gap between startups and enterprises, fostering collaboration that transforms bold ideas into impactful solutions, while leading the development of startup and investment ecosystems in the Mediterranean and beyond.",
    "websiteUrl": "https://techne.me/",
    "email": "info@techne.me",
    "phone": "01024615784",
    "facebookUrl": "https://www.facebook.com/techne.me/",
    "logoImageUrl": "images/Techne-Summit.png"
  },
  {
    "id": 304,
    "fieldId": [
      "Culture",
      "Training",
      "Platforms"
    ],
    "name": "Rowad 2030",
    "description": "Rowad 2030, established under the Ministry of Planning and Economic Development by Ministerial Resolution No. 88 of 2017, empowers youth to create private ventures and supports entrepreneurship in Egypt. The program has trained over 3,460 participants, established 9 business incubators, provided 312,546 opportunities, conducted 50 activities, and facilitated 21,400 direct youth interactions. Rowad 2030 focuses on capacity building and skill development, expanding and developing business incubators across Egyptian universities, and promoting entrepreneurship and self-employment through initiatives like the 'Start Your Future' campaign. It also provides advanced scholarships in collaboration with international universities to enhance government employees’ skills, fostering innovation and supporting economic growth. The project aims to cultivate a new generation of entrepreneurs capable of turning knowledge and ideas into successful businesses while reducing unemployment and encouraging creativity among students and graduates.",
    "websiteUrl": "http://www.rowad2030.com/",
    "email": "info@rowad2030.com",
    "phone": "+20224070790",
    "facebookUrl": "https://www.facebook.com/RowadEgypt2030/about?locale=ar_AR",
    "address": "9 Salah Salem St., Nasr City, Cairo, Egypt",
    "logoImageUrl": "images/rowad.png"
  },
  {
    "id": 305,
    "fieldId": [
      "Culture"
    ],
    "name": "Arab Council for Social Responsibility (ACSR)",
    "description": "The Arab Council for Social Responsibility (ACSR) is Egypt’s first council dedicated to promoting community development and corporate social responsibility (CSR) across the Arab region. A member of the UN Global Compact, ACSR collaborates with national, regional, and international partners, including ISESCO and One Global Economy USA. The council conducts professional trainings for community capacity building, publishes a monthly magazine, and organizes an annual award ceremony for best CSR practices in the region. ACSR encourages enterprises in all sectors to integrate social, environmental, ethical, human rights, and consumer concerns into their business operations and strategies, fostering positive impacts on society and stakeholders. The council also works closely with the government to assess and advance sustainability practices.",
    "websiteUrl": "https://www.acsrglobal.org/en",
    "email": "info@acsrglobal.org",
    "phone": "+201001111229",
    "facebookUrl": "https://www.facebook.com/ACSRGLOBAL/?locale=ar_AR",
    "address": "106 Canadian School St., Fourth District, Fifth Settlement, Cairo, Egypt",
    "logoImageUrl": "images/ACSR.png"
  },
  {
    "id": 306,
    "fieldId": [
      "Events",
      "Competitions"
    ],
    "name": "Arab IoT & AI Challenge",
    "description": "The Arab IoT & AI Challenge is a regional capacity-building and pre-incubation program targeting high school students, senior university students, and startups with innovative ideas in the fields of Internet of Things (IoT) and Artificial Intelligence (AI). Beyond being a competition, it is a digital transformation movement designed to build qualified Arab talent in technical fields. Participants receive training, workshops, and mentorship before competing in local finals, with winners advancing to the regional finals held annually at the IEEE Global Conference on Artificial Intelligence and Internet of Things (GCAIoT) in Dubai. The program also features the Arab IoT & AI Knowledge Hub, which provides online workshops, panel discussions, interviews, and other resources to guide participants in launching careers in IoT and AI.",
    "websiteUrl": "https://www.arabiotai.org",
    "email": "info@arabiotai.org",
    "phone": null,
    "facebookUrl": "https://www.facebook.com/messages/t/ArabIoTAI",
    "instagramUrl": null,
    "youtubeUrl": null,
    "linkedinUrl": "https://www.linkedin.com/company/arabiotaichallenge/",
    "xUrl": null,
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/arablot.png"
  },
  {
    "id": 307,
    "fieldId": [
      "Events",
      "Competitions"
    ],
    "name": "Hult Prize Egypt",
    "description": "Hult Prize Egypt is part of the global Hult Prize initiative, empowering young social entrepreneurs to create scalable solutions that tackle pressing societal challenges. The program supports students and innovators in developing social enterprises that aim to generate positive impact and sustainable change in Egypt and beyond.",
    "websiteUrl": "https://www.hultprize.org/",
    "email": "info@yourcompany.example.com",
    "phone": "+1 555-555-5556",
    "facebookUrl": "https://www.facebook.com/odoo/",
    "instagramUrl": null,
    "youtubeUrl": null,
    "linkedinUrl": "https://www.linkedin.com/company/odoo/",
    "xUrl": "https://x.com/Odoo",
    "address": "3575 Fake Buena Vista Avenue, Egypt",
    "logoImageUrl": "images/Hult-Prize.png"
  },
  {
    "id": 309,
    "fieldId": [
      "Events",
      "Competitions"
    ],
    "name": "TIEC - Technology Innovation & Entrepreneurship Center",
    "description": "The Technology Innovation & Entrepreneurship Center (TIEC), located in Smart Village, Cairo, fosters innovation and entrepreneurship across Egypt’s ICT sector. TIEC supports startups, SMEs, and entrepreneurs through four core departments: Innovation Support, Incubation, Entrepreneurship and Business Support, and Technology Management. The center provides funding, incubation, mentorship, and workshops to develop entrepreneurial skills and build a robust ecosystem. TIEC connects innovators with local, regional, and international stakeholders, promotes intellectual property rights, and encourages technological development that drives economic growth and job creation.",
    "websiteUrl": "https://tiec.gov.eg/English/Pages/default.aspx",
    "email": "info@tiec.gov.eg",
    "phone": "+20235345196",
    "facebookUrl": null,
    "instagramUrl": null,
    "youtubeUrl": null,
    "linkedinUrl": null,
    "xUrl": null,
    "address": "Smart-Village, Building B5, Cairo-Alexandria Desert Road, Giza, Egypt, P.O. Box 12577",
    "logoImageUrl": "images/tiec.png"
  },
  {
    "id": 311,
    "fieldId": [
      "Events",
      "Competitions"
    ],
    "name": "AAST Entrepreneurship Center",
    "description": "The AAST Entrepreneurship Center, part of the Arab Academy for Science, Technology, and Maritime Transport (AASTMT), empowers young entrepreneurs and change agents across the Arab and African regions. Established to foster an environment of innovation, growth, and mentorship, the center supports private businesses through training, networking, and guidance, enabling students and graduates to reshape social and economic landscapes while building sustainable ventures.",
    "websiteUrl": "http://www.aast.edu/",
    "email": "ec@aast.edu",
    "phone": "19838",
    "facebookUrl": "https://www.facebook.com/profile.php?id=100066649772527#",
    "address": "Graduate Studies Building, P.O. Box 2033, Elhorria, El Moshir Ismail St., behind Sheraton Buildings, Cairo, Egypt",
    "logoImageUrl": "images/AASTMT.png"
  },
  {
    "id": 314,
    "fieldId": [
      "Mentoring",
      "Training"
    ],
    "name": "Nurture",
    "description": "Nurture is a consulting agency that helps to grow and support the ideas of startups and potential entrepreneurs.",
    "websiteUrl": null,
    "email": null,
    "phone": "01016797969",
    "facebookUrl": "https://www.facebook.com/Nurture",
    "address": "Cairo, Egypt",
    "logoImageUrl": "images/nurture.png"
  },
  {
    "id": 318,
    "fieldId": [
      "Mentoring"
    ],
    "name": "ICE ALEX",
    "description": "ICE ALEX provides access to innovation programs, entrepreneurial networks, and potential partnerships with tech innovators.",
    "websiteUrl": "https://icealex.com",
    "email": null,
    "phone": "+201012257535",
    "facebookUrl": "https://www.facebook.com/icealexHub/",
    "instagramUrl": null,
    "youtubeUrl": null,
    "linkedinUrl": null,
    "address": "LA DEFENSE, PARIS",
    "logoImageUrl": "images/icealex.png"
  },
  {
    "id": 319,
    "fieldId": [
      "Mentoring"
    ],
    "name": "Beans Consult",
    "description": "Beans Consult L.L.C. is a Business Management Consultancy Boutique founded in 2016. It helps startups and small businesses by acting as a management arm, providing integrated services, expert guidance, tailored mentoring, and hands-on support to build successful and sustainable businesses.",
    "websiteUrl": "https://beansconsult.com",
    "email": null,
    "phone": "01006699551",
    "facebookUrl": "https://www.facebook.com/beansconsult1",
    "address": "1D Amin ElRafey Street, 6th of October, Giza Governorate 12582",
    "logoImageUrl": "images/Beans_logo_fin-01_edited.png"
  },
  {
    "id": 320,
    "fieldId": [
      "Mentoring"
    ],
    "name": "UN World Food Programme Office",
    "description": "The UN World Food Programme (WFP) office in Egypt is part of the global WFP, which works to save and change lives by delivering food assistance in emergencies and working with communities to improve nutrition and build resilience.",
    "websiteUrl": "https://ar.wfp.org/",
    "email": "amina.alkorey@wfp.org",
    "phone": "0020225261993",
    "facebookUrl": "https://www.facebook.com/WorldFoodProgramme.Arabic",
    "address": "49 Street 105, Hadayek El Maadi, Cairo, Egypt",
    "logoImageUrl": "images/1010px-World_Food_Programme_Logo_Simple.svg.png"
  },
  {
    "id": 323,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Makan",
    "description": "Makan is a coworking space and business solutions consultant based in Cairo, Egypt. It provides individuals and teams with a supportive environment to achieve their career and business goals. Makan offers flexible workspaces, professional services, and tailored business solutions to help entrepreneurs, startups, and organizations grow and succeed.",
    "websiteUrl": "http://www.makanspace.com/",
    "email": "info@makanspace.com",
    "phone": "+201117244030",
    "address": "12 El Dokki Street, Dokki, Cairo, Egypt, 12611",
    "logoImageUrl": "images/Makan.png"
  },
  {
    "id": 325,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "District Spaces",
    "description": "District Spaces is a coworking space and community hub in Cairo designed for entrepreneurs, freelancers, and startups. With the motto 'Spaces for Doers,' it provides flexible workspaces, networking opportunities, and access to a supportive community where members can collaborate, innovate, and grow their businesses. District fosters a vibrant culture of creativity and productivity, offering a professional yet collaborative environment.",
    "websiteUrl": "https://districtspaces.xyz",
    "email": "info@district-egypt.com",
    "phone": "+201016649967",
    "address": "51 B - Masr Helwan Agriculture Road, Cairo, Egypt",
    "logoImageUrl": "images/District.png"
  },
  {
    "id": 326,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Shamsia Space",
    "description": "Shamsia Space is a fully equipped coworking and learning space that provides an ideal environment for productivity, growth, and collaboration. Positioned as 'مساحتك للإنتاجية والتطور,' it supports individuals, entrepreneurs, and learners with modern facilities, fostering creativity, continuous development, and community engagement.",
    "email": "mahfouz@shamsiaspace.com",
    "phone": "+201094993034",
    "instagramUrl": "https://www.instagram.com/shamsiaspace",
    "linkedinUrl": "https://www.linkedin.com/company/shamsiaspace",
    "tiktokUrl": "https://www.tiktok.com/@shamsiaspace",
    "address": "Egypt",
    "logoImageUrl": "images/shamsia.png"
  },
  {
    "id": 327,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "302Labs",
    "description": "302Labs is a coworking space and entrepreneurial hub established in 2011 in Cairo. It provides a collaborative work environment with a variety of spaces for entrepreneurs, startups, and students. With diverse, affordable, and integrated services, 302Labs supports innovation and creativity while fostering a community of changemakers. The space also offers mentorship, networking opportunities, and resources for business development.",
    "websiteUrl": "http://302labs.com",
    "phone": "+201204222265",
    "facebookUrl": "https://www.facebook.com/302Labs",
    "linkedinUrl": "https://www.linkedin.com/company/302labscoworkingspace/",
    "address": "7th Wahran St. from El Tayaran Street, Nasr City, Cairo 11727, Egypt",
    "logoImageUrl": "images/302labs.png"
  },
  {
    "id": 328,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Makanak Office Space",
    "description": "Makanak Office Space, established in December 2014, is a leading Egyptian office space operator that provides fully equipped workspaces tailored to meet the needs of startups, SMEs, and entrepreneurs. With flexible office solutions, coworking areas, and professional services, Makanak supports business growth by creating an inspiring and productive environment.",
    "websiteUrl": "https://www.makanakoffice.com/",
    "facebookUrl": "https://www.facebook.com/makanakoffice",
    "youtubeUrl": "https://www.youtube.com/@makanakofficespace6119/videos",
    "xUrl": "https://x.com/Makanak_Office",
    "logoImageUrl": "images/Makanak.png"
  },
  {
    "id": 329,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "GSpace El Gouna",
    "description": "GSpace is a coworking space and entrepreneurial hub located in El Gouna, Hurghada, on the Red Sea. It provides flexible workspaces, meeting areas, and networking opportunities for entrepreneurs, startups, and professionals in a vibrant coastal environment.",
    "websiteUrl": "https://mqrspaces.com/gspace",
    "email": "gspace@elgouna.com",
    "phone": "+201211428888",
    "facebookUrl": "https://www.facebook.com/gspacegouna",
    "address": "El Gouna, Hurghada, Egypt",
    "logoImageUrl": "images/g-space.png"
  },
  {
    "id": 330,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "MQR Spaces",
    "description": "Founded to become the leading workspace operator in Egypt, MQR Spaces provides turnkey office solutions, coworking spaces, and meeting room bundles designed to empower businesses and boost productivity. Through strategic partnerships, MQR has expanded into numerous locations across Egypt and manages flagship hubs such as The GrEEK Campus in Downtown Cairo and West Cairo.",
    "websiteUrl": "https://www.mqrspaces.com/",
    "email": "info@mqrspaces.com",
    "phone": "+201211428888",
    "facebookUrl": "https://www.facebook.com/mqrspaces",
    "youtubeUrl": "https://www.youtube.com/@mqrspaces",
    "linkedinUrl": "https://www.linkedin.com/company/mqrspaces/",
    "address": "Cairo, Egypt (multiple locations including Downtown Cairo and Mall of Arabia in West Cairo)",
    "logoImageUrl": null
  },
  {
    "id": 331,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "TeamYea",
    "description": "TeamYea is a coworking space in Mansoura designed for startups and freelancers to escape their daily routine and integrate within a diverse, supportive professional community. It fosters collaboration, productivity, and creativity by offering exceptional coworking facilities, networking opportunities, and a culture built on diversity, efficiency, and sustainability.",
    "websiteUrl": "http://www.teamyea.com",
    "email": "info@teamyea.com",
    "phone": "+201062588431",
    "facebookUrl": "https://www.facebook.com/TeamYea/",
    "instagramUrl": "https://www.instagram.com/teamyea/",
    "linkedinUrl": "https://www.linkedin.com/company/teamyea-business-house/",
    "xUrl": "https://x.com/TeamYeaOfficial",
    "address": "18 Basim Street - Al-Gomhouria Street - opposite Linza Pastry Shop - second right building - first floor, Mansourah, Ad Daqahliyah, Egypt, 35511",
    "logoImageUrl": "images/TeamYea.png"
  },
  {
    "id": 332,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Sharik Hub",
    "description": "Sharik Hub is a Saudi company specialized in providing coworking spaces for entrepreneurs and businesses, with branches in Saudi Arabia and Egypt. Starting in Al Khobar, the network has expanded to Dammam, Jubail, Riyadh, Jeddah, and Cairo. Sharik Hub offers premium workspaces with comprehensive office services, consulting programs, and modern facilities designed to boost productivity and efficiency, while building an integrated entrepreneurial community across the MENA region.",
    "websiteUrl": "https://sharik-hub.com",
    "phone": "+201111155327",
    "address": "334 Southern 90th St, Fifth Settlement, New Cairo, Cairo, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 333,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Workstation",
    "description": "Workstation is the leading coworking space in Alexandria, providing entrepreneurs, startups, and professionals with a collaborative environment designed to incubate excellence. It offers modern facilities, networking opportunities, and a supportive community that empowers individuals to grow their businesses and ideas.",
    "websiteUrl": "https://workstation-eg.co",
    "email": "info@workstation-eg.co",
    "phone": "+2034241194",
    "facebookUrl": "https://www.facebook.com/WorkstationEgypt",
    "address": "29 El Fardous St, Pharmaceutical Buildings, Alexandria, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 334,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Bee Cell",
    "description": "Bee Cell is a coworking space in Nasr City where you can study or work in a productive environment. It offers comfortable workspaces and a vibrant atmosphere for freelancers, students, and entrepreneurs.",
    "websiteUrl": "https://beecelleg.com",
    "email": "info@beecelleg.com",
    "phone": "+201013174445",
    "facebookUrl": "https://www.facebook.com/beecelleg/",
    "instagramUrl": "https://www.instagram.com/beecelleg/",
    "address": "4 Emad El Deen Kamal St, Abbas El Aqqad, Beside Koshary El Tahrir, Nasr City, Egypt",
    "logoImageUrl": "images/bee.png"
  },
  {
    "id": 335,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "The B-HUB",
    "description": "The B-HUB is a business community services provider that offers fully serviced, flexible offices, and coworking space, along with essential business support functions. Located in Heliopolis, Cairo, The B-HUB serves startups, growing companies, representative offices, and multinational corporations seeking a base in East Cairo. The space combines a professional atmosphere with a strong community to inspire success and business growth.",
    "websiteUrl": "https://theb-hub.com",
    "email": "info@theb-hub.com",
    "phone": "+201092619655",
    "facebookUrl": "https://www.facebook.com/THE.BHUB.Coworking",
    "linkedinUrl": "https://www.linkedin.com/company/the-b-hub-coworking/",
    "address": "16 El Khartoum St, Off El Orouba, Korba, Heliopolis, Cairo, Egypt",
    "logoImageUrl": "images/the b.png"
  },
  {
    "id": 336,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Step Coworking Space",
    "description": "Step Coworking Space في أسيوط يوفر بيئة عمل مرنة للاجتماعات، الكورسات، والأنشطة المختلفة، بالإضافة إلى مكاتب مجهزة لمقابلة العملاء. يهدف المكان لدعم الأفراد والأنشطة التجارية المحلية بتقديم مساحات عمل عملية ومجتمعية.",
    "websiteUrl": "https://step-eg.com",
    "email": "info@step-eg.com",
    "phone": "+201099944961",
    "facebookUrl": "https://www.facebook.com/stepcoworking",
    "address": "17 Momtaz Street, Asyut, Egypt",
    "logoImageUrl": "images/STEP.png"
  },
  {
    "id": 337,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "T-Hub",
    "description": "T-Hub هو كيان متكامل يقدم حلول أعمال شاملة تشمل الاستشارات الاستراتيجية، تحسين القوى العاملة، التعليم المؤسسي، تنسيق الفعاليات، استراتيجيات الاستثمار، خدمات تأسيس الشركات، المبادرات المجتمعية، وتصميم مساحات العمل المبتكرة. يهدف ليكون SMART BUSINESS JOINT في منطقة الشرق الأوسط وشمال إفريقيا، مساهماً في بناء مستقبل أفضل من خلال الابتكار والتكامل.",
    "websiteUrl": "https://thubeg.com",
    "email": "info@thubeg.com",
    "phone": "+201126644959",
    "facebookUrl": "https://www.facebook.com/T-HubMidEast",
    "linkedinUrl": "https://www.linkedin.com/company/t-hub-middle-east/",
    "address": "4 Ibn El Saegh Street, El Attareen, Alexandria, Egypt",
    "logoImageUrl": null
  },
  {
    "id": 338,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Geeks Co-working Space",
    "description": "Geeks Co-working Space aggregates creative, digital, and social entrepreneurs to connect and support one another while developing their businesses in a nurturing environment. It provides a highly equipped space where entrepreneurs can start, learn, and grow as business leaders.",
    "email": "geekspace.luxor@gmail.com",
    "facebookUrl": "https://www.facebook.com/profile.php?id=100064131571679",
    "address": "Shagaret Al DOR, Gazirat Al Awameyah, Luxor, Egypt",
    "logoImageUrl": "images/geeks.png"
  },
  {
    "id": 339,
    "fieldId": [
      "Coworking/Marker Spaces"
    ],
    "name": "Town4One Co-working Space",
    "description": "Town4One is the first co-working space in El Sheikh Zayed. It transforms the normal working place into an energetic and balanced community, providing freelancers and startups with a fancy, comfortable space to work, collaborate, and grow.",
    "websiteUrl": "https://town4one.com",
    "email": "info@town4one.com",
    "phone": "+201016647831",
    "facebookUrl": "https://www.facebook.com/Town4One",
    "instagramUrl": "https://www.instagram.com/town4one/",
    "address": "Al Mostakbal, El Sheikh Zayed, Cairo, Egypt",
    "logoImageUrl": "images/town.png"
  },
  {
    "id": 340,
    "fieldId": [
      "Training"
    ],
    "name": "MSMEDA",
    "description": "MSMEDA provides financing, non-financial services, training, and nationwide support for MSMEs and entrepreneurs.",
    "websiteUrl": "https://www.msmeda.org.eg/",
    "email": "info@msmeda.org.eg",
    "phone": "16733",
    "facebookUrl": "https://www.facebook.com/MSMEDA.Egypt",
    "youtubeUrl": "https://www.youtube.com/@MSMEDAEgypt",
    "linkedinUrl": "https://www.linkedin.com/company/msmeda-eg/",
    "address": "120 Mohie El Din Abou El Ezz Street, Dokki, Giza, Egypt",
    "logoImageUrl": "images/Medium-Small-and-Micro-Enterprises.png"
  },
  {
    "id": 355,
    "fieldId": [
      "Training"
    ],
    "name": "Information Technology Institute (ITI)",
    "description": "The Information Technology Institute (ITI) is an affiliate of the MCIT dedicated to ICT human capacity development. It offers a variety of training programs in areas such as development, game development, data analytics, and cybersecurity. For over 30 years, ITI has helped thousands of Egyptian youth from various academic backgrounds, maintaining an 85% employment rate for its graduates through its strong network with industry and academia.",
    "websiteUrl": "https://www.iti.gov.eg",
    "email": "itiinfo@iti.gov.eg",
    "phone": " 17002",
    "facebookUrl": "https://www.facebook.com/ITI.eg",
    "address": "Smart Village building B148 - 28 Km by Cairo / Alexandria Desert road- 6 October",
    "logoImageUrl": "images/ITI.png"
  },
  {
    "id": 356,
    "fieldId": [
      "Training"
    ],
    "name": "Enroot",
    "description": "Enroot is a social business founded in 2018 to develop disruptive models that empower communities with untapped potential, especially youth and women, across the MENA region and Africa. It designs and executes socio-economic development projects and conducts research to promote inclusive and sustainable economic development.",
    "websiteUrl": "https://enroot.org/",
    "email": "info@enroot.org",
    "phone": "+20225089462",
    "facebookUrl": "https://www.facebook.com/enrootdevelopment",
    "address": "7299 street 83, Mokattam, Cairo, Egypt",
    "logoImageUrl": "images/Enroot.png"
  },
  {
    "id": 357,
    "fieldId": [
      "Training"
    ],
    "name": "YouThinkGreen Egypt (YTG)",
    "description": "YouThinkGreen Egypt (YTG) is a non-profit social enterprise established in 2013. It empowers youth in Egypt, MENA, and Africa by fostering sustainable development through non-formal education, consulting, and entrepreneurship programs. YTG helps startups and SMEs with green entrepreneurship support, networking events like ideathons and summits, and sustainability consulting to promote eco-friendly business innovations.",
    "websiteUrl": "https://ytg.eco/",
    "email": "info@ytg.co",
    "phone": "02 20801743",
    "facebookUrl": "https://www.facebook.com/YouthinkgreenEgypt",
    "linkedinUrl": "https://www.linkedin.com/company/ytgeco/",
    "address": "28 Ali Amin st - Nasr City 27, Cairo, Cairo 11835, Egypt",
    "logoImageUrl": "images/ytg.png"
  },
  {
    "id": 359,
    "fieldId": [
      "Platforms"
    ],
    "name": "EgyptInnovate",
    "description": "EgyptInnovate is the official online innovation hub for Egypt, powered by the Technology Innovation & Entrepreneurship Center (TIEC). Managed by Innovety and developed by Link Development, the platform provides inspiration, education, and networking opportunities for innovators and entrepreneurs. It offers access to learning resources, practical tools, global innovation hubs, and highlights Egyptian innovators locally and globally. EgyptInnovate builds collaborative communities within Egypt’s entrepreneurship and innovation ecosystem, while promoting technology adoption and innovation management for startups and SMEs.",
    "websiteUrl": "https://egyptinnovate.com/en/tags/platform",
    "email": null,
    "phone": null,
    "facebookUrl": "https://www.facebook.com/EgyptInnovate",
    "instagramUrl": null,
    "youtubeUrl": null,
    "linkedinUrl": null,
    "xUrl": "https://x.com/EgyptInnovate",
    "tiktokUrl": null,
    "address": "Egypt (Online Platform powered by TIEC)",
    "logoImageUrl": "images/Egypt-Innovate.png"
  },
  {
    "id": 361,
    "fieldId": [
      "Platforms"
    ],
    "name": "Lean Startup Circle Egypt",
    "description": "Lean Startup Circle Egypt is the official community for entrepreneurs and ecosystem players in Egypt who are interested in applying Lean Startup principles and Customer Development methodologies, originally developed by Steve Blank and refined by Eric Ries. The group fosters conversations and meetups where entrepreneurs, mentors, trainers, VCs, business angels, accelerators, incubators, and coworking spaces collaborate to strengthen Egypt’s entrepreneurial ecosystem through knowledge sharing and practice.",
    "websiteUrl": "http://leanstartup.pbworks.com/w/page/15765228/Meetups",
    "facebookUrl": "https://www.facebook.com/groups/LeanStartupCircleEgypt",
    "address": "Egypt (community-based group)",
    "logoImageUrl": "images/lean.png"
  },
  {
    "id": 364,
    "fieldId": [
      "Platforms"
    ],
    "name": "Freight Anchor",
    "description": "Freight Anchor is a global E-Logistics Ecosystem Marketplace that connects Importers/Exporters with Logistics Service Providers (freight forwarders, couriers, customs clearance, trucking, insurance, warehousing). The platform enables businesses to receive competitive quotations, streamline logistics transactions, and improve cooperation using cutting-edge technologies. It supports exporters, importers, and service providers in managing deals efficiently and expanding their market presence, while also providing resources and insights about the logistics industry.",
    "websiteUrl": "https://freightanchor.com/",
    "facebookUrl": "https://www.facebook.com/FreightAnchor",
    "twitterUrl": "https://twitter.com/FreightAnchor",
    "linkedinUrl": "https://www.linkedin.com/company/freight-anchor",
    "instagramUrl": "https://www.instagram.com/freightanchor",
    "youtubeUrl": "https://www.youtube.com/channel/UCRZECulKJsS9HzehqGYYr3Q",
    "address": "9C Al Selhdar St., Roxy, Heliopolis, Cairo, Egypt, P.C:11341",
    "phone": "+201007815343",
    "email": "info@freightanchor.com",
    "logoImageUrl": "images/freighanchor-logo.png"
  },
  {
    "id": 366,
    "fieldId": [
      "Media"
    ],
    "name": "Rowad Al Aamal Magazine",
    "description": "Rowad Al Aamal Magazine, founded in 2008, is a leading publication dedicated to promoting entrepreneurship culture and developing diverse career opportunities for youth in small and medium-sized enterprises across the Arab world. The magazine highlights success stories, provides knowledge and tools to young entrepreneurs, and raises awareness about innovation, franchising, and SME development. Its mission is to inspire and empower youth to embrace entrepreneurship and build sustainable businesses, while its vision is to be a key knowledge resource in entrepreneurship and economic development.",
    "websiteUrl": "https://www.rowadalaamal.com",
    "facebookUrl": null,
    "twitterUrl": null,
    "linkedinUrl": null,
    "instagramUrl": null,
    "youtubeUrl": null,
    "address": "Saudi Arabia Office: 2321 King Abdullah Road, Intersection with Abu Bakr Al Siddiq, Al Waha District, Unit No. 41, Riyadh, Saudi Arabia. P.O. Box 1244 Riyadh 8714. Cairo Office: Corniche El Nil, Maadi, Saraya Al Mashreq Tower, Building B, 5th Floor, Cairo, Egypt.",
    "phone": "+966118106183",
    "email": "info@rowadalaamal.com",
    "logoImageUrl": "images/Rowad-Alaamal.png"
  },
  {
    "id": 367,
    "fieldId": [
      "Media"
    ],
    "name": "Al-Ahram Al-Eqtesady & Loghat Al-Asr Magazine",
    "description": "Al-Ahram Al-Eqtesady & Loghat Al-Asr is one of the leading magazines in the Arab world focused on economics and technology. It provides in-depth analysis of economic and political events and their impacts on markets. The magazine serves as a trusted source of knowledge for professionals, decision-makers, and readers interested in the intersection of economy and technology.",
    "websiteUrl": "https://www.ahram.org.eg",
    "facebookUrl": null,
    "twitterUrl": null,
    "linkedinUrl": null,
    "instagramUrl": null,
    "youtubeUrl": null,
    "address": "Cairo, Egypt",
    "phone": null,
    "email": "logahtalasr@ahram.org.eg",
    "logoImageUrl": "images/Loghat-Al-Asr.png"
  },
  {
    "id": 368,
    "fieldId": [
      "Media"
    ],
    "name": "Alex Agenda",
    "description": "Alex Agenda is the news of Alexandria in Egypt.",
    "websiteUrl": null,
    "facebookUrl": "https://www.facebook.com/AlexAgenda",
    "twitterUrl": null,
    "linkedinUrl": null,
    "instagramUrl": null,
    "youtubeUrl": null,
    "address": "Alexandria, Egypt",
    "phone": null,
    "email": null,
    "logoImageUrl": "images/Alex-Agenda.png"
  },
  {
    "id": 369,
    "fieldId": [
      "Media"
    ],
    "name": "Watan Rakamy TV Program",
    "description": "Watan Rakamy TV Program is an Egyptian television program dedicated to simplifying the digital economy and technology for a wider audience. It features diverse segments including reports, dialogues, exclusive coverage, and data visualization through infographics and timelines. The program is hosted by Hassan Othman, a distinguished journalist and media professional with extensive experience across Egyptian satellite channels and newspapers, known for his ability to present economic issues in a clear and engaging manner.",
    "websiteUrl": null,
    "facebookUrl": null,
    "twitterUrl": null,
    "linkedinUrl": "https://www.linkedin.com/in/hassan-othman-watan-raqami-38196280/",
    "instagramUrl": null,
    "youtubeUrl": null,
    "address": "Cairo, Egypt",
    "phone": null,
    "email": null,
    "logoImageUrl": "images/watan raqamy.png"
  },
  {
    "id": 370,
    "fieldId": [
      "Media"
    ],
    "name": "El Mashrou3 TV Program",
    "description": "El Mashrou3 is the first Egyptian reality television program dedicated to young entrepreneurs. The show highlights startup journeys, challenges, and successes, aiming to inspire and support the entrepreneurial ecosystem in Egypt.",
    "websiteUrl": "http://www.elmashrou3.tv",
    "facebookUrl": null,
    "twitterUrl": null,
    "linkedinUrl": null,
    "instagramUrl": null,
    "youtubeUrl": null,
    "address": "Cairo, Egypt",
    "phone": null,
    "email": null,
    "logoImageUrl": "images/Al-Mashro3.png"
  }
]